[["akki rotti", 61179167, "RT @thevirdas: I'm pretty sure somewhere in our history, in the year 1526, was a lady named Tejasvi who was less afraid of the actual Mugha…"], ["akki rotti", 61179167, "RT @rahm3sh: It was at that moment she knew she messed up 🤣🤣💀 https://t.co/4FYt8QYoZz"], ["akki rotti", 61179167, "RT @Y2SHAF: when i have a breakdown i open the fridge"], ["akki rotti", 61179167, "RT @Saumyart: Tamil Nadu Forest Minister Dindigul C Sreenivasan asked two tribal boys to remove his slippers to enter a shrine. Sack him fr…"], ["akki rotti", 61179167, "RT @DDSez: Any normal Indian would have drawn a parallel to the more recent, well documented, destructive, British Raj. But a Sanghi can't…"], ["akki rotti", 61179167, "RT @salsnotserious: I'm Salman not salmon"], ["akki rotti", 61179167, "RT @Pun_Starr: Trust IT Cell. They can even give you 'proof' of money, Biryani &amp; AAP placards being distributed at Shaheen Bagh.\n\nThe only…"], ["akki rotti", 61179167, "RT @kunalkamra88: 😂😂😂\n\nWho did this? https://t.co/7EXuFTUxnD"], ["akki rotti", 61179167, "RT @Meherr_: Why is this so funny? https://t.co/ynNO3j4RVT"], ["akki rotti", 61179167, "RT @srivatsayb: Majority Persecution Complex is the defining delusional modern psychosis\n\nAfter winning 303 seats, instead of governing the…"], ["akki rotti", 61179167, "RT @LiberalMantri: Brahmins and Rajputs and Bania benefitted greatly from the Mughal rule so why are you so worried about it Surya?"], ["akki rotti", 61179167, "RT @thevirdas: Sir please don't be upset at me. I'm a fan. I apologise. You're my second favourite right wing Vivek. \n\n#BuddhaInASanghiJam"], ["akki rotti", 61179167, "RT @thevirdas: I agree sir. So savage. Also, your tweet is in English. \n\n#BuddhuInAStrawberryJam"], ["akki rotti", 61179167, "RT @SingleIdly: Focus on Karnataka, you have a BJP Delhi handle to fight the electoral battle. Rahul Gandhi doing temple rounds is irreleva…"], ["akki rotti", 61179167, "RT @ColdCigar: What is this behaviour Gunja https://t.co/RAajTkfzWw"]]