[["aloo gobi", 976738703828758528, "RT @RajeIyer: @IamRajii Why trying a Idli in Delhi !? 😬 \nTry their awesome parathas, (Aloo,gobi,mooli) chole &amp; evening Gol Gappas..."], ["aloo gobi", 22613114, "RT @RajeIyer: @IamRajii Why trying a Idli in Delhi !? 😬 \nTry their awesome parathas, (Aloo,gobi,mooli) chole &amp; evening Gol Gappas..."], ["aloo gobi", 8202432, "RT @RajeIyer: @IamRajii Why trying a Idli in Delhi !? 😬 \nTry their awesome parathas, (Aloo,gobi,mooli) chole &amp; evening Gol Gappas..."], ["aloo gobi", 3311551130, "RT @RajeIyer: @IamRajii Why trying a Idli in Delhi !? 😬 \nTry their awesome parathas, (Aloo,gobi,mooli) chole &amp; evening Gol Gappas..."], ["aloo gobi", 995580651377049601, "RT @RajeIyer: @IamRajii Why trying a Idli in Delhi !? 😬 \nTry their awesome parathas, (Aloo,gobi,mooli) chole &amp; evening Gol Gappas..."], ["aloo gobi", 48672667, "@IamRajii Why trying a Idli in Delhi !? 😬 \nTry their awesome parathas, (Aloo,gobi,mooli) chole &amp; evening Gol Gappas..."], ["aloo gobi", 1107295394042728450, "RT @AcademicSurgery: We love biryani and mango lassi, but what really revs our engine is a good aloo gobi and pag saneer. #SnackadenicSurge…"], ["aloo gobi", 2315750990, "Back in SLU with two trucks today. \n\nTruck 1 is next to Whole Foods at Westlake and 9th\n\nTruck 2 is next to Amazon Apollo at 9th and Thomas\n\nSpecials are Chicken Kali Mirch, Aloo Paneer, Aloo Gobi and Lamb Curry\n\nOpen at 11am until 145pm"], ["aloo gobi", 1114309583974150145, "@fackinfuumin Palaks nice I'll give you that but FUCKIN ALOO GOBI I can't stop laughing 😭😂😂"], ["aloo gobi", 79351830, "@LindaEpstein @HighlightsFound @padmatv A complicated question for me since my home cooking has many influences! I’m as likely to make a pot of matzo ball soup as aloo gobi.😁 I’d serve this lovely tomato bisque with cheese and baguette. But..I keep this green chutney in the fridge and use it often on almost anything. https://t.co/CSsKNPudAa"], ["aloo gobi", 1090469197237243905, "@_aloo_gobi @DsSayed These people are out their minds."], ["aloo gobi", 29531918, "@DsSayed Omfg 45 dollars! FOR TURMERIC. https://t.co/BYec390H2R"], ["aloo gobi", 44879190, "@BalvinderITV ..... and we need aloo gobi 😆😆"], ["aloo gobi", 1043269975530778624, "@mohsin__s1 Aloo gobi is so fkn peng 😍😋 that and palak&gt;&gt;&gt;"], ["aloo gobi", 1114309583974150145, "@fackinfuumin Aloo Gobi just isn't nice 😭😂 of all the salaans you pick that 😂😂😂"], ["aloo gobi", 519289613, "@_aloo_gobi @NPRCodeSwitch @heyDejan @yourewrongabout Oooo! Thank you so much, I've not listened to either of those. There are just so many and I haven't time to read up on them all so recommendations are where it's at 😁❤️"], ["aloo gobi", 29531918, "@pennmcam Code Switch (@NPRCodeSwitch) is a good one about race! It’s America focussed but very good! Also @heyDejan has me hooked on You’re Wrong About (@yourewrongabout) which is always a fun (and informative) listen!"], ["aloo gobi", 1057853085270360066, "@udettydettypig Aloo gobi"], ["aloo gobi", 2365009111, "@_aloo_gobi yeah tbh only a couple of them are surprising and he's one of them"], ["aloo gobi", 1075478114145353733, "RT @_smolpineapple: i remember one time my white friend was drunk and she called my mum an aloo gobi"], ["aloo gobi", 29531918, "@DsSayed Yup! Turmeric chai lattes and coconut oil in the hair when little brown kids were made fun of smelling like coconuts all through my primary school days!!!"], ["aloo gobi", 376454100, "@_aloo_gobi yes, exactly it’s like peak turmeric latte syndrome... next thing they’ll be telling us all the benefits of saffron 😡🤬"], ["aloo gobi", 29531918, "@DsSayed It’s all very trash"], ["aloo gobi", 29531918, "RT @DsSayed: @_aloo_gobi agreed, but it’s the billionsssss they make off of our traditional healing methods that they were happy to shun fo…"], ["aloo gobi", 29531918, "@DsSayed Yup! I was listening to a podcast about how  the ayahuasca business in Peru has been taken over by yts and some Indigenous ppl there equate it to cultural exploitation and even cultural genocide (!!!) because yts are seen as becoming the gatekeepers of the ayahuasca retreats."], ["aloo gobi", 376454100, "@_aloo_gobi agreed, but it’s the billionsssss they make off of our traditional healing methods that they were happy to shun for years as “barbaric” but now all of a sudden their all so enlightened — GIVE. ME. A. BREAK 🥱"], ["aloo gobi", 29531918, "@DsSayed And ww probably do a watered down version of the black and brown ways because they whitewash it, which probably also makes it less effective anyway ¯\\_(ツ)_/¯"], ["aloo gobi", 29531918, "RT @DsSayed: sorry not sorry - reason I don't buy into the hysteria around GOOP/Gwyneth isn't because i'm afraid of alternative medicines t…"], ["aloo gobi", 86137896, "We love biryani and mango lassi, but what really revs our engine is a good aloo gobi and pag saneer. #SnackadenicSurgery https://t.co/v2T5XDUO2P"], ["aloo gobi", 1043269975530778624, "@mohsin__s1 Same with aloo gobi bro 🤷🏻‍♀️"], ["aloo gobi", 2430112386, "@iam_dev_null Maheshwari Aloo Gobi Club. Loool good one 😂"], ["aloo gobi", 29531918, "@sampi_martoo You look so happy! Congrats and hope you find the strength you have within to heal ❤️ It’s a journey and feeling honoured you shared some of it with all of us!"], ["aloo gobi", 29531918, "V good thread https://t.co/usE99l02iY"], ["aloo gobi", 29531918, "RT @lolacoaster: Joker is this generation’s Fight Club, in that it’s a movie many young men find deep and everyone else finds exhausting"], ["aloo gobi", 29531918, "Omg what makes you beautiful is playing on the radio in my didi and I’m CRYING 😭 sorry Sarthak, but I used to co-run a highly successful 1D tumblr so.... ¯\\_(ツ)_/¯"], ["aloo gobi", 29531918, "@Baqir_Kh Hahahahahaha! Golden ratio of white bread maybe..."], ["aloo gobi", 29531918, "RT @UsmanAhmad_iam: Why are Pakistanis so completely and utterly embarrassing and insane when it comes to matters of religion? https://t.co…"], ["aloo gobi", 29531918, "RT @YasMohammedxx: This is an #LGBT friendly mosque w a rainbow flag up on the wall\n\nA woman is leading the prayer\n\nMen and women are stand…"], ["aloo gobi", 27602599, "1 x aloo gobi, 2 x cups tea, 1x10min hot shower, 1x hot water bottle and a shortbread biscuit later &amp; my hands and I have just about defrosted after track 🥶🏃‍♀️🥶"], ["aloo gobi", 2344217515, "@bobuqsayed @Roj_Ame @_aloo_gobi Oh yeah my family thinks that I’m like that too, and it’s really frustrating because I want to be as loving with them as I am with friends 😕 just have to remind myself that distance is something they’ve imposed really"], ["aloo gobi", 3063688222, "#morrisons had this tonight,  added some chilli &amp; butter it was really nice. VERY impressed with the vegetarian food as well that was in store - my  cupboard is now stocked  https://t.co/jRMNTAPaoe"], ["aloo gobi", 28661757, "Tonight is aloo gobi with (no tomatoes) mango masala sauce and added quark and chick peas for #protein #gymlife 👍🏽💪🏽"], ["aloo gobi", 895653119568232449, "RT @LukeEMiaPI: Deep dish pizza tops my list of food cravings almost always. That and tacos. Also almost any Indian food, but especially we…"], ["aloo gobi", 978609288372465670, "Deep dish pizza tops my list of food cravings almost always. That and tacos. Also almost any Indian food, but especially well-made Aloo Gobi."], ["aloo gobi", 1347889298, "@Irene__again Thats just aloo gobi or bombay potatoes with a curry... weve all had that...nom nom nom"], ["aloo gobi", 3188183869, "RT @NaanSenseMobile: Back in SLU with one truck and at Bellevue with the other. \n\nTruck 1 is next to Bellevue Barnes and Noble on 106th ave…"], ["aloo gobi", 2315750990, "Back in SLU with one truck and at Bellevue with the other. \n\nTruck 1 is next to Bellevue Barnes and Noble on 106th ave\n\nTruck 2 is next to Amazon Apollo at 9th and Thomas \n\nSpecials are Chicken Salna, Paneer Jalfrezi, Lamb Curry, and Aloo Gobi\n\nOpen at 11am until 145pm"], ["aloo gobi", 941757459420545025, "@aniket_anikett The plan was to make a batch tonight with Aloo gobi, but we're going out for dinner instead so I'll save the dough for tomorrow 🙂👍"], ["aloo gobi", 937723070177038337, "@SarkyIntrovert I cringed all the way through because ALL their  aloo gobi looked like shit 😂😂😂😂"], ["aloo gobi", 746726400372137988, "Omfg why have they white washed the pronunciation of aloo gobi FML I can't watch it https://t.co/uZK8Hlm6Vj"], ["aloo gobi", 937723070177038337, "Indian Mums Try Other Indian Mums' Aloo Gobi https://t.co/DExJ2C6tzi via @YouTube\n\nLOOOL it would have banged if it was proper desi mum’s"], ["aloo gobi", 978884532, "@anyasaravanan @Roj_Ame @_aloo_gobi it so hard and i feel you bb, mine think i’m cold and unemotional, which is soo far from the truth, because i have to dissociate and robotise to protect myself. sometimes distance is the only way forward when boundaries aren’t respected"], ["aloo gobi", 895365384580345856, "i remember one time my white friend was drunk and she called my mum an aloo gobi"], ["aloo gobi", 821674108379402240, "RT @keakandrew: What's your best Indian dish😋😋😋\nMe: Aloo Gobi https://t.co/tA2xckz8SI"], ["aloo gobi", 1022070379299438595, "RT @keakandrew: What's your best Indian dish😋😋😋\nMe: Aloo Gobi https://t.co/tA2xckz8SI"], ["aloo gobi", 1173588202181025794, "RT @keakandrew: What's your best Indian dish😋😋😋\nMe: Aloo Gobi https://t.co/tA2xckz8SI"], ["aloo gobi", 1114309583974150145, "@fackinfuumin I'd rather my heart break than love  aloo Gobi 😂😂😂"], ["aloo gobi", 1043269975530778624, "does ur heart ever just go\n\n         🦋 💓      💓 🦋\n      💓          🦋          💓\n      🦋      Aloo Gobi       \n          💓                💓\n              🦋          🦋\n                     💓 https://t.co/W9xOVIkjMm"], ["aloo gobi", 847454460511100928, "RT @Veg_Ezy_: Recipe: Try this delicious Indian dish Gobi Aloo   - VegEzy https://t.co/U4N2vfera5\n#Recipes #veganrecipies https://t.co/2EbDEqUxdo"], ["aloo gobi", 66517388, "Recipe: Try this delicious Indian dish Gobi Aloo   - VegEzy https://t.co/EtlAJSj2Mn\n#Recipes #veganrecipies https://t.co/jlyaDcoWoI"], ["aloo gobi", 29531918, "RT @charles_kinbote: Pete Buttigieg pulling you into the conference room to tell you he’s noticed you’ve been leaving a little earlier than…"], ["aloo gobi", 2671092383, "RT @keakandrew: What's your best Indian dish😋😋😋\nMe: Aloo Gobi https://t.co/tA2xckz8SI"], ["aloo gobi", 805022727560200193, "RT @keakandrew: What's your best Indian dish😋😋😋\nMe: Aloo Gobi https://t.co/tA2xckz8SI"], ["aloo gobi", 1056503806341627909, "RT @keakandrew: What's your best Indian dish😋😋😋\nMe: Aloo Gobi https://t.co/tA2xckz8SI"], ["aloo gobi", 718455448190455809, "What's your best Indian dish😋😋😋\nMe: Aloo Gobi https://t.co/tA2xckz8SI"], ["aloo gobi", 886044163, "📷 Aloo gobi curry is a Punjabi delicacy popular in North Indian. It is a semi-dry dish made from potatoes or aloo and cauliflower or gobi. Aloo gobi curry is a Punjabi style gravy dish made from potato, onion  cauliflower and Indian spices.... https://t.co/FoE1hBD0NP"], ["aloo gobi", 29531918, "RT @emeraldxmoon: I’m... here for this chaotic headline energy https://t.co/SuL4mszQg1"], ["aloo gobi", 29531918, "RT @oz_f: This is extraordinary - it’s alleged a Liberal candidate and police officer leaked secret police records to 3AW in order to creat…"], ["aloo gobi", 29531918, "@DsSayed @dmejiacanales Honestly SAME"], ["aloo gobi", 29531918, "@tarang_chawla I always get \"Aloha\" instead of \"Aliya\"..."], ["aloo gobi", 29531918, "@aaolomi Please do a podcast episode on this! I'm craving more!!! 🧕🏾🔮"], ["aloo gobi", 29531918, "RT @alexmc_lean: @WHO did NOT recommend travel bans in response to #coronavirus, yet Australia and other countries went against this. These…"], ["aloo gobi", 19259844, "Indian Mums Try Other Indian Mums' Aloo Gobi https://t.co/Jnf5PBdlJy via @YouTube"], ["aloo gobi", 841780145606205440, "@anyasaravanan @Roj_Ame @_aloo_gobi Thirding the disassociative robot suggestion"], ["aloo gobi", 460518439, "@PKgourmet in honor of your @bonappetit video I made your roasted aloo gobi while watching Bend it like Beckham 👍🏽 paired great with a light ipa!"], ["aloo gobi", 1119771267756900354, "@PKgourmet I want to thank you from the bottom of my heart for introducing me to asafetida. I'd never heard of it before your videos and now it's a favorite member of my spice rack! \n\n(Also I've made your roasted aloo gobi recipe twice now.🤫 It's so good!)"], ["aloo gobi", 1090469197237243905, "@anyasaravanan @_aloo_gobi A reminder to you, Unbow your head, sister. You are beautiful and loved. Unbow your head. And move through the world with your beautiful QPOC energy. Unbow your head."], ["aloo gobi", 2344217515, "@Roj_Ame @_aloo_gobi Robot love! ❤️❤️❤️ here’s to surviving 🥂"], ["aloo gobi", 2344217515, "@dmejiacanales @_aloo_gobi Thank you ❤️ it’s so heartbreaking to have to navigate family and set all these boundaries (and they’re defs not doing the work, it’s all us) but you’re all my family ❤️"], ["aloo gobi", 1090469197237243905, "@_aloo_gobi @anyasaravanan I struggle sometimes, a lot. But it’s the amazingness of our QPOC beauty that keeps me going. There is beauty and pride in being QPOC. I feel sad for non QPOC folks, cos like... how do you, how do you even live?\n\nWe. Are. Not. Going. Anywhere."], ["aloo gobi", 29531918, "@Roj_Ame @anyasaravanan Sometimes turning into a robot is the best way to cope!!"], ["aloo gobi", 29531918, "@dmejiacanales @anyasaravanan Can you please just spread your love and positive vibes ALL OVER THE COUNTRY?! I have a massive smile on my face because of you!! 🥰"], ["aloo gobi", 1090469197237243905, "@_aloo_gobi @anyasaravanan We’ve got to hold each other sistren. Cos if the world has failed us, we must never fail ourselves. This is our place too and we are not going anywhere."], ["aloo gobi", 29531918, "@dmejiacanales @anyasaravanan You are so beautiful ❤️ despite all the hate and abuse from actual family members, being a qpoc means I get to form a whole other qpoc chosen family!"], ["aloo gobi", 60608730, "@anyasaravanan @_aloo_gobi I do the same. Used to get a deluge of abusive text messages and I had to block people and then check back in to see if they had tired themselves out. After 9 months they did. But it starts back up every once in a while. Turn into a 🤖 to deal"], ["aloo gobi", 1090469197237243905, "@anyasaravanan Also, huge love to you and to @_aloo_gobi  - it’s hard in these streets. But we can also rely on each other and your combined extreme excellence is delicious, enriching, and inspiring."], ["aloo gobi", 2344217515, "@_aloo_gobi Same here friend! It’s sometimes nice (?!) to know that other people deal with it the same way I suppose ❤️"], ["aloo gobi", 29531918, "@anyasaravanan I try to avoid being around them tbh... It helps that I don't live in the same country but when I am around them I sort of just go into autopilot mode and disassociate. Sending lots of brown queer solidarity friend! ✊🏾"], ["aloo gobi", 29531918, "RT @aaolomi: In Islamic and Middle Eastern lore the djinn as an invisible race of supernatural beings have a unique relationship to magic…"], ["aloo gobi", 750266969748860928, "Just saw Indian mom's judge each others aloo gobi video.\nNow first let's get this clear, BROWN PEOPLE FROM UK do not represent actual taste of India. Gosh the aloo gobi looked so lack lustre and they were all such judgmental aunties."], ["aloo gobi", 852767915103240194, "New post (Aloo Gobi Curry Sabzi Very Healthy Easy Recipe Cauliflower Curry Desi Cooking Homemade good food) has been published on Age In Grace - https://t.co/x1UhjFBqXp https://t.co/mF4ZS8NzCv"], ["aloo gobi", 36351427, "@ShreeSaanthosh @melindafarrell Basically paratha is a north indian dish and got many varieties like paneer, aloo, gobi etc. and parotta is spclly from south like malabar, kuthu 😊"], ["aloo gobi", 1193441528112459776, "Band Gobi Ke Pakoray | Aloo Payaz Ke Pakoray | Pray For Corona Virus Inf... https://t.co/VUfKWjeqIs via @YouTube\nWelcome To My Youtube Channel Plz Subscribe For More Easy And Healthy Recipes.\nPlease Pray For Corona Virus Infected Peoples"], ["aloo gobi", 29531918, "RT @senthorun: You know what isn’t hateful?\n\n— Pointing out racist behaviour.\n— Refusing someone’s sexual advances.\n— Protesting a homophob…"], ["aloo gobi", 29531918, "RT @alexmc_lean: \"Ravenswood has taken the protocol a step further and required students who have recently travelled to \"other affected are…"], ["aloo gobi", 895547228554702849, "Martin says this is one of the best curry nights I’ve done. We have some chicken tikka masala, aloo gobi, rice, cucumber raita, onion salad and lentils. His plate, and my plate. https://t.co/5JBBcGPYUP"]]