[["arugula pesto pasta", 23254912, "#Leftovers 🌱\nThawed 3 small containers: 1st had sauce, carrots, roasted garlic, red onion, arugula; 2nd had doctored fire-roasted crushed tomatoes &amp; homemade pesto; 3rd had 5 roasted Brussels sprouts.  \nReheat, mingle, make angel hair pasta... dinner is served.\n🤘😆 #veganfood https://t.co/TUWvRi7tMv"], ["arugula pesto pasta", 745008493598478337, "RT @WhatsGabyCookin: I’ve never been someone to buy souvenirs while on vacation, rather I just stock pile ideas for recipes and bring them…"], ["arugula pesto pasta", 213405395, "This Pine Nut and Arugula Pesto Pasta Salad contains four things I love: pine nuts, arugula, pasta, and feta. I think it’s a delightful combination of flavors that almost everyone will enjoy.\n\nGet the RECIPE: https://t.co/cbvRsHvzIm https://t.co/CKQ90vPvFR"], ["arugula pesto pasta", 1070663760627388419, "RT @WhatsGabyCookin: I’ve never been someone to buy souvenirs while on vacation, rather I just stock pile ideas for recipes and bring them…"], ["arugula pesto pasta", 21119050, "I’ve never been someone to buy souvenirs while on vacation, rather I just stock pile ideas for recipes and bring them home so I can reminisce about where I’ve been. And that’s exactly where this Arugula Pesto Pasta comes from! https://t.co/O3YorYM2XB https://t.co/KJdLakHBfu"], ["arugula pesto pasta", 213405395, "Remember that pasta salad I shared in my stories last week? Well, the recipe is on the blog today. In case you missed, it’s a Pine Nut and Arugula Pesto Pasta Salad. It’s bursting with fresh flavor. The homemade… https://t.co/ziMAyfhhai"], ["arugula pesto pasta", 2788733852, "RT @RachaelRayShow: .@gzchef makes an easy arugula pesto for a vegetarian ziti pasta that looks fancy but only takes minutes to make. \n\nGET…"], ["arugula pesto pasta", 46444397, "Our Chicken Parm. A breaded chicken breast topped with marinara and provolone cheese, served over Cavatappi pasta with tomatoes, broccoli, parmesan, and house-made arugula pesto.\n\nAvailable only at our Williams pub. https://t.co/TlPEhnwPoT"], ["arugula pesto pasta", 271902730, "RT @RachaelRayShow: .@gzchef makes an easy arugula pesto for a vegetarian ziti pasta that looks fancy but only takes minutes to make. \n\nGET…"], ["arugula pesto pasta", 56736161, ".@gzchef makes an easy arugula pesto for a vegetarian ziti pasta that looks fancy but only takes minutes to make. \n\nGET THE RECIPE &gt; https://t.co/GnLbsQXMqd https://t.co/vShMl8PNyF"], ["arugula pesto pasta", 27887540, "I home made pasta sauce is good, but 2 is even better. @nikvulper's exquisite scratch made red sauce and my arugula pesto. They were so different and balanced one another super well. https://t.co/7qsy9s9kSJ"]]