[["bean sprouts soup", 818993986354352129, "\"You Still Rock!\" noodle soup. With fish cake and enoki mushrooms and yellow bean sprouts and bok choy and kimchi and seaweed and a poached egg. https://t.co/e3RIdO84J0"], ["bean sprouts soup", 866363976262615040, "@melstonemusic what’s your fav. type of “Hot &amp; Sour Soup”?\n\nmy local Vietnamese restaurant makes one with bean-sprouts, pineapple &amp; tomato.\n\nit’s orgasmic   😍 https://t.co/nFW8c8xmuv"], ["bean sprouts soup", 705741417, "Someone asked if the little plate of bean sprouts/cilantro/etc. they give u for ur pho was the salad u eat before the soup"], ["bean sprouts soup", 757306662101274624, "“Curry Laksa, a tasty and spicy Malaysian coconut based curried noodle soup topped with shredded chicken, shrimps, fried tofu, and bean sprouts.”"], ["bean sprouts soup", 1227244624911196160, "Hue Style Spicy Beef in Noodle Soup #Pho\n.\n.\nSliced Brisket and Sliced Pork Loaf in a Spicy Beef Broth with Shrimp Paste, Lime, Cilantro, and Bean Sprouts. It was super delicious and the spice hit just right. The… https://t.co/efZtIPYhQl"], ["bean sprouts soup", 1227244624911196160, "Hue Style Spicy Beef in Noodle Soup #Pho\n.\n.\nSliced Brisket and Sliced Pork Loaf in a Spicy Beef Broth with Shrimp Paste, Lime, Cilantro, and Bean Sprouts. It was super delicious and the spice hit just right. The… https://t.co/KsJ6GYahph"], ["bean sprouts soup", 736877014989340672, "@ambient_soup @HurleyFace @BridgetPhetasy my sprouts! where are my perfect little bean sprouts!"], ["bean sprouts soup", 1218903604981063680, "@sytaya_woman i've cooked miso soup with fresh shiitake and bean sprouts today. ummm.....it's tasty! https://t.co/P47JHvNC6S"], ["bean sprouts soup", 1161602923492626433, "Nabe again but it’s really cold here lmfao. Before we boil: sausage mushrooms bean sprouts lettuce konyaku (idk in English, potato jelly basically) meat... spicy kimchi soup 🤟 https://t.co/rLdsMQ02Kn"], ["bean sprouts soup", 817484454453268481, "For soup, cook ground garlic in oil, then simmer with meatballs, green curry paste, vegetable broth and bean sprouts. Top with mint."], ["bean sprouts soup", 872882605439537152, "@prettiiNsomniac It was good! The spring rolls were great especially with that sauce and the soup was bomb except the cilantro. Ion like cilantro. It was really filling especially cause I had a large bowl. The peach tea was good but I didn't like the bean sprouts. They were okay"], ["bean sprouts soup", 766452357710438405, "I’ve been cooking for like the last nine hours no joke. Literally made creamed spinach, chinese broccoli, kung pao brussels sprouts, red cabbage soup, mushroom stroganoff, black bean burgers."], ["bean sprouts soup", 1048247881977671686, "@laughsfliesaway Yes,I had lukewarm water in morning along with Lemon,then Cucumber salad along with bean sprouts, \nThen you can have Cashwe and Egg as much as you can,Have Tomato soup as much as You can, not harmful, it will reduce your weight and metabolism"], ["bean sprouts soup", 56887402, "Foodie eats: yummy beef pho noodle soup at Pho Dao in North San Jose, Pho ( \"fuh\") is a soup made w beef broth, rice noodles, sliced beef; it comes w a side of fresh mint leaves, lime, bean sprouts to top off.. it’s Vietnamese soul food esp good on cold days, 😋 Apres Ski ⛷ #SF https://t.co/ZogEjWvWaY"], ["bean sprouts soup", 712722493350551552, "Inspiration from the ASIAN continent!\n\nHot and sour shrimp soup…fragrant broth…rice noodles…jumbo shrimp…bean sprouts…veggies…fresh herbs…YUM!\n\n#ConvenientFeast #GoodFoodDelivered #LanhamMD #LandoverMD #GreenbeltMD #DMVFoodie #MealDeliveryMD #MealPrepMD #SweetAndSourSoup https://t.co/M6OxVH6W7j"], ["bean sprouts soup", 172477667, "Friday, February 7:\n\nHOT BAR: Coconut Curry Chicken; Tofu &amp; Baby Bok Choy; Basmati Rice With Leeks; Zucchini &amp; Squash; Roasted Brussels Sprouts\n\nSOUP: White Bean &amp; Vegetable; Chicken Noodle\n\nDon’t forget about our salad bar, deli case and bakery items! https://t.co/YiVwOdAXNp"], ["bean sprouts soup", 25965787, "#Vegan Noodles in Authentic TomYam Soup topped with fried Seaweed, Tofu, Mushrooms, long Bean, Sprouts, Pumpkin, Peanut and Red Onion. #deliciousveganfood @ Veganerie Silom https://t.co/LqBoHWdBH7"], ["bean sprouts soup", 990076230664794112, "I cooked a lot tohu and bean sprouts miso soup today."], ["bean sprouts soup", 1027656540138946560, "Chefs, the ingredients for the dessert round are: \n \n Mung bean sprouts, \n Pine nuts, \n Toenails, \n and matzo ball soup \n \n Time starts now."], ["bean sprouts soup", 16362450, "I made laksa (an Asian noodle soup @YingjueChen introduced me to and I’m now obsessed with).  I cheated and used laksa paste, but I did grow the bean sprouts on my kitchen counter so maybe that counts for something? https://t.co/tw8RN958fj"]]