[["beef and spinach curry", 1218583936743264256, "Don’t be afraid to tackle Indian food—start with these simple recipes for flavorful curries, samosas, and more.\nChickpea-Spinach Curry With Cucumber-Yogurt Sauce\n1 of 12\nIndian-Style Beef Kebabs With Cilantro Sauce\nMarinate the steak in a mixture  #Fo https://t.co/U737CRqstX https://t.co/uZphqM7jJL"], ["beef and spinach curry", 955366241870413824, "No games night this week, but I'll be having the group over for dinner tomorrow and I'm gonna be making Indonesian food for everyone.\n\nThe plan is to make some Nasi Goreng, a beef curry and a lamb curry, some fried tofu and some potatoes and spinach. \n\nIt's gonna be so much fun!"], ["beef and spinach curry", 568555546, "RT @PlymUniCatering: Have a #CurryandChaat at one of the cafes this week. 5 of our cafes are serving curry specials to raise money for @Men…"], ["beef and spinach curry", 1163479362257215489, "RT @PlymUniCatering: Have a #CurryandChaat at one of the cafes this week. 5 of our cafes are serving curry specials to raise money for @Men…"], ["beef and spinach curry", 3545673263, "RT @PlymUniCatering: Have a #CurryandChaat at one of the cafes this week. 5 of our cafes are serving curry specials to raise money for @Men…"], ["beef and spinach curry", 3314791911, "Have a #CurryandChaat at one of the cafes this week. 5 of our cafes are serving curry specials to raise money for @MentalHealth. Today, RLB is serving beef madras, seasonal fish coconut and spinach curry or lentil dhal with saag aloo, long-grain rice, naan bread &amp; dips. @plymuni https://t.co/7JsjZmkQ9l"], ["beef and spinach curry", 575520879, "Paki-beef curry, Med roasted potatoes, and sautéed spinach https://t.co/QxsGU0mCI8"], ["beef and spinach curry", 1130569001736781826, "Hi, today there’s:\n\nSoup of the day\nBarley-Vegetable-Pan\nSpinach spaetzle pan with mountain cheese and abgeschmelzten onions\nChili con Carne\n\nMensa only:\nTurkey steak with herb butter\n\nstuBistro only:\nGreen-Thai-Curry from beef\nGnocchi with sheep's cheese and fresh Basil\n#enjoy"], ["beef and spinach curry", 74111600, "Good morning. Remember that  we serve our breakfast all day. On the buffet for today we have spinach quiche, butternut curry, beef bobotie, chicken and broccoli bake accompanied by a herb salad and a summer salad."], ["beef and spinach curry", 852091584325705728, "RT @BengalChiba: The exciting grand opening of Bengal Tiger SOGO Chiba will take place tomorrow! Prawn Biriyani will be available, and new…"], ["beef and spinach curry", 979017671130804226, "The exciting grand opening of Bengal Tiger SOGO Chiba will take place tomorrow! Prawn Biriyani will be available, and new items, Spinach Beef Curry and Paneer Manchurian, will also be introduced tomorrow!! Savor Chef Sahid’s curries surrounded by the comforts of home."], ["beef and spinach curry", 1229340324, "When we’re overwhelmed by things we can’t control, we focus on things that are in our control: diet, physical/mental health.\n\nChicken, avocado, beef curry, spinach and cauliflower fried rice with egg &amp; sriracha.\n\n12g net carbs\n1,240 cal\n23:1 fasting\n\n#keto #omad #fuckcancer #lchf https://t.co/bdeoFV9gmI"], ["beef and spinach curry", 178183112, "RT @Yummy_Lummy: Curry corned beef with cherry tomatoes and spinach\nhttps://t.co/j71wUr3iyp\nI had to dash home for a 7 pm international Sky…"], ["beef and spinach curry", 152604471, "Curry corned beef with cherry tomatoes and spinach\nhttps://t.co/j71wUr3iyp\nI had to dash home for a 7 pm international Skype call. I got home at 6.30 pm, threw a week’s worth of shirts into the washing machine and then quickly fried up some curry corned beef."], ["beef and spinach curry", 74111600, "Good morning city people, today on the buffet we have the following to offer: Tuscan chicken, Cape Malay beef curry, potato and spinach curry, chicken masala accompanied by basmati rice and seasonal salads. Quiche of the day is Salmon and cream cheese. https://t.co/AvpPHreYhD"]]