[["bourbon burger", 301606853, "@BradenShamo @BrownbearSLC When I cook my burger's inside it is always unhealthy as hell!!!\nThat's a bunch of real butter, Worcestershire, and some bourbon...\nI sear, than add the sauce and basically steam them...\nDrain only at end."], ["bourbon burger", 898252513811415040, "Instead of ordering a Takeaway dinner at the Heathen Feral Pub, I decided to dine in instead, and ordered the 'Mmerica Burger with Chips and a glass of Bourbon Imperial Stout! https://t.co/BzPZ2UXw5x"], ["bourbon burger", 1053872913051512832, "EVERGREEN BURGER (GFP)\nbourbon bacon jam, swiss, arugula, IPA mustard, brioche"], ["bourbon burger", 598642412, "@ParallaxStella @ZacharyDiaz Oh lord jesus enjoy Mardi Gras.  And do me a favor and go to the Krystal burger on Bourbon.  I miss those damn hamburgers."], ["bourbon burger", 19624502, "RT @piperspub: The Roadhouse Burger... grilled to order ground steak burger, baby greens, gouda, bbq bourbon brisket, and pickled jalapeno…"], ["bourbon burger", 18976591, "The Roadhouse Burger... grilled to order ground steak burger, baby greens, gouda, bbq bourbon brisket, and pickled jalapeno &amp; onion, served with s&amp;p chips! https://t.co/ZxwAIgFspc"], ["bourbon burger", 1095464613246726144, "RT @SuckMyCrops: I could go for a burger, bourbon and the sex rn"], ["bourbon burger", 1230230971741548547, "RT @SuckMyCrops: I could go for a burger, bourbon and the sex rn"], ["bourbon burger", 38666748, "Pulled up to my fave burger spot to grab lunch and #decompress with a bourbon smash and across the restaurant I see all the managers in the department 😑😑😑😑😑😑"], ["bourbon burger", 110513492, "RT @beckschicago: 🚨Wednesday Special🚨Our Double Patty Beck’s Burger $7. Drafts $5. Redemption Bourbon or Rye shots $4. 🍔🍔🍔 \n\n#cheeseburger…"], ["bourbon burger", 1189359256803389440, "@_Kenziepuff What do you classify as \"drinking\".\nIs having a bit of wine with/after dinner \"drinking\"?\nIs having a pint of beer with a burger at lunch \"drinking\"?\nIs having a glass of bourbon in the evening \"drinking\"?\n\nI do not like getting drunk (or even tipsy) but I enjoy \"having a drink\"."], ["bourbon burger", 780890659448233984, "RT @SuckMyCrops: I could go for a burger, bourbon and the sex rn"], ["bourbon burger", 89632422, "Bard &amp; Banker Boots &amp; Bourbon Country Night every Wednesday! Join us tonight for live Country music with Tumblin Dice, Buffalo Trace Bourbon on special, Bison Burger &amp; Buffalo Wings! \n#whiskeywednesday #bootsandbourbon #countrymusic #yyjevents #bardandbanker @BuffaloTrace https://t.co/9XLcZBZI67"], ["bourbon burger", 317562521, "@titonka Definitely the Whig. Or Bourbon. 🙂"], ["bourbon burger", 157892535, "Working outside in the snow and wind of the Colorado winter really works up my appetite for a brioche bun bison burger with malt vinegar soaked yukon gold frites a frosty bourbon barrel aged stout and the comforts of a warm soft woman"], ["bourbon burger", 701782577829564416, "@crimethink Not spending the week micro dosing lsd and drinking bourbon? Maybe the odd burger"], ["bourbon burger", 1004362328501096448, "🚨Wednesday Special🚨Our Double Patty Beck’s Burger $7. Drafts $5. Redemption Bourbon or Rye shots $4. 🍔🍔🍔 \n\n#cheeseburger #burger #pickles #royalewithcheese #beckschicago #lincolnpark #wednesday #lincolnparkchicago https://t.co/8dXwQhIcS5"], ["bourbon burger", 2279686626, "Cheers to burger night, any burger, beer &amp; a shot of bourbon for just $15. EVERY WEDNESDAY 🍻\n—————\n📸: @scmphoto\n.\n.\n.\n.\n.\n.\n\n#peckish #peckishpig #brewpub #local #evanston #etown #chicago #chicity #eatlocal #eeeeeats… https://t.co/oHjWy1BOR7"], ["bourbon burger", 1188167570769072129, "RT @SuckMyCrops: I could go for a burger, bourbon and the sex rn"], ["bourbon burger", 1735655604, "Taking my favorite daughter for a burger ! And I might have a bourbon Gretel .... https://t.co/LYyg4KYnXW"], ["bourbon burger", 36495743, "It’s Burger &amp; Bourbon Tuesday, where you can get a different monthly burger special, fries and an old-fashioned for $20! 🍔Pictured here is South Pas’ burger: Spicy Turkey Burger! https://t.co/XKuqGOmcb7"], ["bourbon burger", 89632422, "Check out our new Country Music Night every Wednesday! Live Country music, $5 Buffalo Trace Bourbon, $11.25 Kentucky Mules, Bison Burger, Buffalo Wings. \n#wingwednesday #whiskywednesday #bourbon #bootsandbourbon #gonecountry #bardandbanker #countrynight #countrymusic #yyjevents https://t.co/FBS3QJHSmX"], ["bourbon burger", 1068201034466639879, "When was the last time you enjoyed a burger this much? \n\nDid you make it out to our Burgers &amp; Bourbon event with ironcladdistillery? \nFull album available on our Facebook page!\n\nPhoto by Paul Crisp @MAkustumSS… https://t.co/ERG9HYvLSQ"], ["bourbon burger", 4300701742, "A-1 from Day One! 🍔 Come by today and check out our Triple B Tuesday, featuring our burger topped with A-1 marinated mushrooms, Swiss cheese, roasted pepper medley, drizzle in A-1 sauce. Pair it with a shot of bourbon and your favorite draft beer for just $15! 🥃🍺 https://t.co/nuDMVvvUJu"], ["bourbon burger", 1068636258723868672, "@Katiebrandner @rctruitt Bourbon Street. In front of the Krystal Burger. Saturday night. 10 PM."], ["bourbon burger", 954863441059172363, "I want lo mein, wings, a burger from Shake Shack, bourbon chicken, fried calamari, crab legs and Cajun sauce, corn pudding, cherry cheesecake, peach cobbler, a banana, fruit tray, and pistachio ice cream."], ["bourbon burger", 388108740, "RT @aliceduke: A devoted love letter to the only things that kept me going through 2018: @templeofseitan temple deluxe and @mildredslondon…"], ["bourbon burger", 3575097073, "Happy Monday Hogs! It’s wing night tonight at Training Table!\n\nHoney Bourbon Pork Loin\nGrilled Salmon\nGrilled Chicken Breast\nBeyond Burger\nPaprika Red Potatoes\nSteamed Broccoli\nGrilled Vegetables\nWing Bar\n\n#fuelingthehogs"], ["bourbon burger", 898333123880112128, "Hell's Kitchen Deal Alert: At Bourbon Street Bar &amp; Grille between 11:00AM and 4:00PM, Any Burger on the Menu Only $10  |  Any Po’ Boy on the Menu $12. Find more great NYC deals at https://t.co/X2RwUfdmvy! #nyc #deals"], ["bourbon burger", 513824998, "Everybody wants to taste Duff Beer or the Flaming Moe or a Krusty Burger but imagine having a swig of Col. Kwik-E-Marts bourbon https://t.co/g1YJ10xrF4"], ["bourbon burger", 890981892, "Really really good.  Not to sweet and decent amounts og bourbon flavor. - Drinking a So Happens It’s Tuesday by @thebruery @ Burger King  — https://t.co/8LisWprmS5"], ["bourbon burger", 826678004868800517, "My parlour burger and bourbon smacked last night"], ["bourbon burger", 37725640, "RT @ABC7Chicago: Sip your way through their carefully selected bourbons or an eclectic craft beer collection with the opportunity to specif…"], ["bourbon burger", 17028405, "Sip your way through their carefully selected bourbons or an eclectic craft beer collection with the opportunity to specifically pair your drinks with an all American natural gourmet burger that comes in many different varieties. https://t.co/oCuaUOjdeP"], ["bourbon burger", 89210528, "@BlaccPhoenix We can do burger and bourbon night tomorrow if you’re free. It’s 13 bucks"], ["bourbon burger", 713180918178058240, "Must try: Gourmet burgers, more than 400 types of bourbon at Spears Bourbon, Burgers &amp; Beer in north suburbs https://t.co/rNXKhEsCAB https://t.co/FaoGg3HVNf"], ["bourbon burger", 17028405, "Spears Bourbon, Burgers &amp; Beer chef shares recipe for 'Irishman Burger' https://t.co/ueTh8ZlKnc"], ["bourbon burger", 2921441603, "@southerndivine Yep... took myself to Denny's for a bourbon bacon burger 👍"], ["bourbon burger", 103876508, "RT @Fab_Mommy_: I love it when I get a dm suggesting a video of me eating a burger. \n\nThat’s so hot."], ["bourbon burger", 952023944676151296, "@GarrettHaake @innoutburger You’re an adult eat a cheese burger and drink a bourbon at 8 am if you want."], ["bourbon burger", 1204870018799931392, "The fabulous J Cole is tending bar today. Come warm up with a burger and some bourbon! https://t.co/e2g4OeVNRJ"], ["bourbon burger", 908145973880377345, "RT @amandajpanda: I'm still looking for the baby crying eating a burger gif."], ["bourbon burger", 1174500792906264576, "@Fab_Mommy_ @sip_of_bourbon The burger of course."], ["bourbon burger", 1115330730173902849, "@ebruenig Was it that Krystal Burger with an upstairs right near Bourbon Street?"], ["bourbon burger", 1068201034466639879, "Still deciding what to do for Valentine's? \nWe will be set up at @DuyguToplan for Bourbon &amp; Burgers from noon till 7pm!\n\nBurger and nosh frites combo $10 \n#nosh #noshmmb #foodtruck #becausewecan #vafoodie #ets757… https://t.co/zyGbWjS05G"], ["bourbon burger", 20415967, "@ebruenig Krystal Burger on Bourbon Street?! ❤❤"], ["bourbon burger", 774651566548619264, "RT @SuckMyCrops: I could go for a burger, bourbon and the sex rn"], ["bourbon burger", 495613678, "RT @425suzanne: Welp. Some rando just rebutted my factual statement using a Good Burger clip as their evidence so I’m ready for some bourbo…"], ["bourbon burger", 2284617224, "Welp. Some rando just rebutted my factual statement using a Good Burger clip as their evidence so I’m ready for some bourbon."], ["bourbon burger", 270550645, "@Robwhitt07 Its not a footballers body but from someone who is out of shape from the odd bourbon biscuit at work I can tell you this is not a daily burger and chip body"], ["bourbon burger", 2833217839, "Try one of our signature burgers with some bourbon to drink at a special discounted price every Wednesday 7PM-Close!\n\n#northarlingtonnj #1republik #foodie #drinks #drinksspecials #1republiknortharlington #happyhour #sportsbar #njbars #goodvibesonly #foodspecials #njfoodie #burger https://t.co/pmT2Sowl2k"], ["bourbon burger", 1004362328501096448, "🚨Wednesday Special🚨Our Double Patty Beck’s Burger $7. Drafts $5. Redemption Bourbon or Rye shots $4. 🍔🍔🍔 \n\n#cheeseburger #burger #pickles #royalewithcheese #beckschicago #lincolnpark #wednesday #lincolnparkchicago https://t.co/z3YZ4rGExI"], ["bourbon burger", 748320758, "RT @TheGarrison209: Take a trip to New Orleans with our Bourbon Street Burger!  \nBourbon BBQ sauce on our blended burger patty. Creamy prov…"], ["bourbon burger", 773226848100712448, "Take a trip to New Orleans with our Bourbon Street Burger!  \nBourbon BBQ sauce on our blended burger patty. Creamy provolone cheese, apple wood smoked bacon, crispy lettuce, tomato and pickles. Topped off with onion straws. https://t.co/Er7HFGo2NZ"], ["bourbon burger", 3139346065, "Happy Trivia Tuesday! We are being sponsored by @garrisonbros Bourbon of Texas! Tonight we will have Bourbon Bottle Prizes! $10 Build Your Own Burger Night with #Free Toppings and Fries! 🍔🍟 @Digzonite666… https://t.co/rT9ePm3nTY"]]