[["buffalo chicken pizza", 1034832267171037184, "Parasite (2019)\nI'm here for peaches, buffalo chicken pizza, and ram-dom. Nothing going on weird here."], ["buffalo chicken pizza", 239566013, "Gonna sit down enjoy this Buffalo chicken pizza and watch Part 2 of the Vick 30 for 30 Fwiw"], ["buffalo chicken pizza", 90966455, "RT @midwestern_ope: Most Popular Super Bowl Food in the Midwest\n\n8. Seven layer dip \n7. Rotel + hamburger Queso\n6. Lil smokies \n5. Meatball…"], ["buffalo chicken pizza", 278260127, "@lyndseyfifield @BridgetPhetasy Actually they are both wrong. Pineapple and buffalo chicken pizza is delightful. If you can't properly identify the ingredients necessary to complement and synergize with the pineapple... that isn't the pinapple's fault."], ["buffalo chicken pizza", 967179514877902848, "Chef crush made us a Buffalo chicken pizza to share! https://t.co/71R9cmRhF6"], ["buffalo chicken pizza", 1203324563230212096, "@ohnotthatmimi Requesting a buffalo chicken pizza exemption for Ranch and Blue cheese please."], ["buffalo chicken pizza", 252351486, "@smashleighamd i REALLY want to snuggle and watch youtube and eat a buffalo chicken pizza. me you and charlie"], ["buffalo chicken pizza", 1207016944454557696, "@slaveBadBaby Buffalo chicken pizza is literally sex to my mouth 🐨"], ["buffalo chicken pizza", 2444466795, "Kenny made a pepperoni pizza then cut up chicken on top and buffalo wing sauce 😐😭😭😭😭😭 definitely high shit"], ["buffalo chicken pizza", 3347552631, "@ItsToad_ WHAT DOES SHE EXPECT ME TO DIP MY BUFFALO CHICKEN PIZZA IN???"], ["buffalo chicken pizza", 172781820, "@NJGov Ummmm....I'm going to have to agree with this. Buffalo chicken pizza is a beautiful thing."], ["buffalo chicken pizza", 2602316250, "So happy I ordered buffalo chicken pizza so it could mop up my tears while watching @jojorabbitmovie ✌🏻❤️ https://t.co/nOBvP1zVwH"], ["buffalo chicken pizza", 90295025, "Was eating chips &amp; guac and buffalo chicken dip for dinner and then Emily hits me with the “I have pizza if you’re hungry” \n\nI don’t think I ever moved so fast https://t.co/3ZhiPIlbrT"], ["buffalo chicken pizza", 274725849, "i’ve been eating spinach all week long i couldn’t do it anymore i caved in and  got buffalo chicken pizza 🥺"], ["buffalo chicken pizza", 3043533124, "I want buffalo chicken pizza and spicy ramen 🥴"], ["buffalo chicken pizza", 27295336, "@joeksonyou @acaseofthegolf1 The only pizza huts I know are like run down shit holes in Midwest towns where flies infest the buffet line haha back in the day though...buffalo chicken pizza from the hut was bomb"], ["buffalo chicken pizza", 780202308122673152, "Buffalo Chicken Pizza at the Peppermill South tonight! We have hand-crafted specialty cocktails, plus convenient online ordering for takeout at https://t.co/qmmQ8ChvVc https://t.co/HNXzqEEGOj"], ["buffalo chicken pizza", 2384118118, "I never got my last god damn buffalo chicken pizza from Nop Totch 6yrs ago and I think @420MagicalGirl can understand that pain."], ["buffalo chicken pizza", 1001860746588901376, "@NJGov It's national pizza day here in my house! I'm making (from scratch) traditional and a buffalo chicken white pizza!"], ["buffalo chicken pizza", 1209691398, "FUCKKKKK. I want a buffalo chicken slice from the pizza place in my hometown"], ["buffalo chicken pizza", 1146580941231599624, "y’all really be eating buffalo chicken pizza*?? 🤢🤢🤢"], ["buffalo chicken pizza", 512520281, "It's Back from November! 1-Day Only on Saturday the 8th! $2 for a Huge 1-Pound Slice of Frato's Buffalo Chicken Salad Pizza Pizza, walk-in only special!\n-\nFrato's Culinary Team created, tested this deliciousness and… https://t.co/y8PYcJFXIf"], ["buffalo chicken pizza", 165804259, "@orcrist86 They put the bleu cheese under the regular pizza cheese, and over the chicken and buffalo sauce. https://t.co/TOI2vw7wto"], ["buffalo chicken pizza", 159895256, "2/ U will make it back in extra stuff ppl buy w/it. Put it in a package sale for cheaper too. Invent new pizza toppings, buffalo chicken, Cajun chicken, teriyaki beef! There r so many avenues u r not exploring @pizzahut @yumbrands Go forth &amp; multiply those profits. I give freely!"], ["buffalo chicken pizza", 715259248381464578, "i ordered buffalo chicken pizza and they really gonna put red pizza sauce on here. count your days!!!!!"], ["buffalo chicken pizza", 1071054609140068355, "Line 1-buffalo chicken pizza\nLine 2-chicken &amp; waffles, syrup\nLine 3-chicken &amp; waffles, syrup\nLine 4-chicken Caesar or garden salad\nLine 5-hamburger or spicy chicken sandwich\n\nFresh veggies, corn, peaches, apples, oranges, bananas"]]