[["carrots, peas and potatoes", 25145192, "@madmarchheather Potatoes for their versatility, then peas, carrots and lettuce 😊"], ["carrots, peas and potatoes", 1045742416714715136, "RT @painterley: Yorkshire pudding with roast potatoes, peas, parsnips, sprouts, carrots, mini sausages and beef with gravy. https://t.co/2y…"], ["carrots, peas and potatoes", 903690291256930304, "LUNCH 2-13-20\nCREAM OF MUSHROOM SOUP\nFRESH FRUIT\nGARDEN SALAD\nTRADITIONAL MEATLOAF WITH GRAVY - OR\nLEMON GARLIC SWORDFISH BOTH SERVED WITH ROASTED POTATOES, SWEET PEAS AND BABY CARROTS\nASSORTED DESSERTS"], ["carrots, peas and potatoes", 780917482441674752, "@misdelivered_ It was ok for a small market garden. We easily covered our household for a year and probably another one or two. We grew Zucchinni, Tomato, beetroot, carrot, potatoes, chilli's eggplants cucumbers, watermelon, fennel, peass and beans and peas, carrots, brussel sprouts,tobacco"], ["carrots, peas and potatoes", 128352598, "Then tomorrow for tea Cheese and Onion Crispbakes from Aldi. Perhaps some Boiled Potatoes and Carrots and Peas again. Then maybe on Saturday....Ham, Egg and Chips and Peas. All the excitement from my jetsetting timeline eh."], ["carrots, peas and potatoes", 374010588, "Note on my phone I scroll by every day since I made this 🍲 \n\nKale\nPotatoes\nCarrots\nWhite onion\nRed onion\nCelery\nGarlic\nChick peas\nTomato sauce\nPepper (ground and cracked)\nSea salt\nRed pepper flakes\nTurmeric\nThyme\nVegetable oil\nOlive oil\nThat’s it"], ["carrots, peas and potatoes", 112794611, "Our Vegetable Pot Pie is perfect for a chilly Wednesday - carrots, peas, green beans, potatoes, spinach, and root vegetables in a herb cream sauce with a buttermilk biscuit top. Lemon herb chicken skewer add on available #vegetarian #eatlocal #buylocalyyc #yycfood #yyceats #yyc https://t.co/3xcwX2VTai"], ["carrots, peas and potatoes", 12107822, "@madmarchheather Cauliflower. No, peas. Potatoes, definitely potatoes. And carrots. No, beans. Green beans. White asparagus. Damn, I like more vegetables than I originally thought! https://t.co/aQLW9Et4wd"], ["carrots, peas and potatoes", 384772458, "@madmarchheather We have an allotment and you can’t beat freshly picked carrots. Also a fan of mange tour and sugar snap peas. But if I’m honest potatoes, especially new potatoes picked fresh and eaten, even if they’re not counted as one of your 5 a day."], ["carrots, peas and potatoes", 2105021, "@madmarchheather Potatoes! Best food ever. Also love pumpkin, broccoli, carrots and peas."], ["carrots, peas and potatoes", 1175633919393312768, "Pot roast simmering all day today! A big roast, Diced potatoes, onion, minced garlic, celery, baby carrots, corn, green beans, peas, Lima beans, 3 seasoning packets, and truffle butter on top! Mmmmmm https://t.co/OH0toEgLv9"], ["carrots, peas and potatoes", 57223379, "Next time you're whipping up something in the kitchen, consider adding the following sources of fiber into your diet:\n-Peas\n-Beans\n-Oats\n-Barley\n-Fruits like apples, pears, berries, and citrus\n-Vegetables like sweet potatoes, Brussels sprouts, broccoli, carrots, and beets\n\n#vegan https://t.co/2OCJRHBzTH"], ["carrots, peas and potatoes", 23819976, "Perfect meal for this chilly afternoon. Beef in red wine served with freshly prepared peas, carrots and new potatoes #haylingisland #woodgastonlane #meadowfarmtearoom #beefinredwine @ Meadow Farm Nursery &amp; Tea Room https://t.co/DKDiLDZoVn"], ["carrots, peas and potatoes", 248291389, "@elonmusk Mom caught a small child eating hamster food. \nThe food was taken away and the mouth was rinsed.\nMom reads the composition of the feed:\n- Wheat, millet, peas, carrots, potatoes, vitamins A, C, D, E.\nMother thoughtfully:\n- Can give him more?"], ["carrots, peas and potatoes", 3420148420, "Wednesday 12.02.2020\n Fried smoked sack steak (d, m) malt beer sauce (b) peas and carrots\n Boiled potatoes (b) Apple from the region @ Rotenburg, Niedersachsen, Germany https://t.co/vlgdudk1kB"], ["carrots, peas and potatoes", 120284878, "Really looking forward to the 2020 garden.  Going to take a shot at potatoes, sweet potatoes, eggplant, spinach, and citronella (not for eating :P) while bringing back berries (blue and black), zucchini, cucumbers, sunflowers, peas, tomatoes, peppers, asparagus, kale, carrots"], ["carrots, peas and potatoes", 89031049, "@TheCheshireNat It was this winter vegetable soup so it had potatoes, carrots, parsnip, spinach, peas, beans and then I kinda just went in with a bunch of spices. *chefs kiss*"], ["carrots, peas and potatoes", 231806162, "Beautiful plate from the weekly menu. This week was a grilled salmon with a bourbon brown sugar glazed serve with tarragon seared snap peas, roasted carrots and potatoes.\nIt's a perfect combo.....\nYour body will… https://t.co/OVm6ZJHdAa"], ["carrots, peas and potatoes", 38002688, "Yum! We're getting Wednesday night Family Supper ready for you! February 12 menu: Hamburger steaks with gravy, mashed potatoes, sweet peas and carrots, rolls, ice cream sandwiches\n\nSee you on Wednesday in the Fellowship Center any time between 5-6:30 pm! https://t.co/bn8PzRP66g"], ["carrots, peas and potatoes", 1134029874648104960, "@ToomeyWright We had baked crumbed whitefish with mashed potatoes and steamed peas and carrots.  Right back to childhood. It never fails."], ["carrots, peas and potatoes", 59226205, "Our dinner tonite - Pollock white fish with parsley sauce asparagus french beans peas carrots sweetcorn with sweet potatoes mushrooms and spring onions nice healthy meal tonite https://t.co/5G6MKkFuX8"], ["carrots, peas and potatoes", 128352598, "50p Reduced to Clear Quiche, Boiled Potatoes and Carrots and Peas for tea."], ["carrots, peas and potatoes", 172583086, "@tyler_casper We had a cow for milk and butter, chickens for eggs and meat, hogs for pork and lard, rendered the fat down for lard.  Raised our vegetables, potatoes-yams was stored for winter. Mom canned 200 gallon of each, beans berries peas corn kraut tomatoes carrots &amp; salsa"], ["carrots, peas and potatoes", 2558426220, "Ordered pesto chickin salad\n\nPreview has potatoes and carrots and peas and stuff\n\nActual delivery is a literal lettuce salad with 3 pcs of chikin\n\nMy disappointment is immeasurable and my night is ruined."], ["carrots, peas and potatoes", 397357831, "MVJHS Tuesday Announcements • Date: Tuesday, February 11th, Maroon Day\n\nLunch: Salisbury steak, roll, mashed potatoes, gravy, peas and carrots, fresh fruit, low-fat milk\n\nBreakfast tomorrow:  breakfast sliders or PB and J uncrustable, fr...\nhttps://t.co/wvTgnxloe4"], ["carrots, peas and potatoes", 16708818, "RT @iheartnaptime: This easy beef stew recipe is cooked in the oven for maximum flavor concentration and ultra tender beef. The addition of…"], ["carrots, peas and potatoes", 781185985639960576, "@Nancywaddell18 It's the best! I will put instant potatoes, cream of chicken soup, chicken, peas, carrots and corn all together and then top it with Bisquick. Nom nom nom nom...."], ["carrots, peas and potatoes", 260560234, "@ggrosi1 @jannarden I eat frozen vegetables and your wrong on the integrity carrots are terrible frozen so are potatoes.. I will do peas and corn but that’s about it :) I don’t need tips on veg I’m a pretty good cook thanks.."], ["carrots, peas and potatoes", 954348514049486848, "@GiantVeg @RHSSchools @LtL_News @Bulbs4Kids_UK @PershoreNurs_GC Yes we eat everything! Peas,carrots, cucamelons, carrots all washed and eaten uncooked. We grow potatoes in bags, garlic and of course our giants 🙂"], ["carrots, peas and potatoes", 898005105848365057, "@CameSawShopped It's actually Cottage Pie. People keep correcting me because traditional Shepherds Pie is made with lamb. The recipe I like has rosemary and thyme, carrots and peas, and I put a little cream cheese in the mashed potatoes because yummy!"], ["carrots, peas and potatoes", 1495446511, "So delicious 😋 vegan curry with rice 💚 Curry with coconut milk, sweet potatoes, carrots, peppers, spinach, snow peas, ginger, garlic, onions, red curry paste, chili and parsley 😋💚 #foodporn\n.\n.\n.\n.\n#vegan #curry… https://t.co/nPje1hnzA3"], ["carrots, peas and potatoes", 3341541285, "@Tyson_GB Behold my power\n\n1. Steak on a bed of zucchini spaghetti with home made chimichurri.\n2. Garlic parmesan zucchini linguini with bacon topped with poached eggs.\n3. Smoked pork shoulder, hickory and apple\n4. Sheppard's pie with beef, roasted potatoes, carrots, corn, tomato and peas. https://t.co/KZrvb0zYeI"], ["carrots, peas and potatoes", 620579058, "The Champ says: #foodporn courtesy of ChefBigalow! On the menu; Gourmet Meatloaf, ChefBigalow’s Famous Deep Fried Deviled Eggs, Garlic Smashed Potatoes and Peas and Carrots.\n#the_champ_has_spoken https://t.co/Lnvn6st4Km"], ["carrots, peas and potatoes", 1315354051, "@3sunzzz @kimtopher22 Overthinking it.  Fine dining and elegance that really says \"I love you, baby...\" is the Hungry Man fried chicken, mashed potatoes, peas and carrots TV dinner.  True love at 325 degrees."], ["carrots, peas and potatoes", 43127150, "Prime Rib with Au Jus, Roasted Potatoes, Mushy Minted Peas, Orange Glazed Carrots, Sauteed Mushrooms with Garlic Flowers, and Yorkshire Puddings with Onion Gravy #cooking #chefathome #foodiesofinstagram #foodie #supper #primerib #yorkshirepudding https://t.co/1Y71mSV1XK"], ["carrots, peas and potatoes", 954193648480145408, "@PrayerHarbor At 19 he get home made chicken, white rice, peas, carrots or sweet potatoes, olive oil and Nutra Thrive. https://t.co/tms7EtNq6J"], ["carrots, peas and potatoes", 352437413, "@LesaRobertson20 @Tracy9672 Pot roast, potatoes,carrots and onions, Biscuits and jam, peas and string beans."], ["carrots, peas and potatoes", 16419140, "@Desha7 It's the leftover pot roast from last night, I sauteed it with baby potatoes and carrots and onions, threw some peas in at the end. https://t.co/M55pYgxRTa"], ["carrots, peas and potatoes", 137928346, "RT @painterley: Yorkshire pudding with roast potatoes, peas, parsnips, sprouts, carrots, mini sausages and beef with gravy. https://t.co/2y…"], ["carrots, peas and potatoes", 792589148804743169, "RT @painterley: Yorkshire pudding with roast potatoes, peas, parsnips, sprouts, carrots, mini sausages and beef with gravy. https://t.co/2y…"], ["carrots, peas and potatoes", 1037541544104841216, "@oldivory Beef/floured, garlic, onions, thyme and bay so far. Carrots, celery, potatoes and peas waiting...\n\nI'm wanting Corn Bread too, but I've never made it with stew !"], ["carrots, peas and potatoes", 619493491, "@NYtokenblackguy Pot roast with gravy, potatoes, carrots, peas and yellow rice"], ["carrots, peas and potatoes", 144769155, "@HiddenCash Green tea cake, mashed potatoes with peas and carrots"], ["carrots, peas and potatoes", 844172946335776768, "RT @painterley: Yorkshire pudding with roast potatoes, peas, parsnips, sprouts, carrots, mini sausages and beef with gravy. https://t.co/2y…"], ["carrots, peas and potatoes", 1069478022, "Dinner Sunday Roast\n\nSlow cooked beef roast potatoes&amp;roast vegetables red onion, carrots, parsnips, with mushy peas, mash and syn free gravy. \n*\n*\n*\n*\n#slimmingworld #fitfood #healthylifestyle #swonplan… https://t.co/ySEjdVGCvv"], ["carrots, peas and potatoes", 80528717, "RT @painterley: Yorkshire pudding with roast potatoes, peas, parsnips, sprouts, carrots, mini sausages and beef with gravy. https://t.co/2y…"], ["carrots, peas and potatoes", 162910272, "Dinner: Pork chops, mashed potatoes, buttered peas &amp; carrots, and dinner rolls."], ["carrots, peas and potatoes", 901439552203763712, "RT @painterley: Yorkshire pudding with roast potatoes, peas, parsnips, sprouts, carrots, mini sausages and beef with gravy. https://t.co/2y…"], ["carrots, peas and potatoes", 753945872, "RT @painterley: Yorkshire pudding with roast potatoes, peas, parsnips, sprouts, carrots, mini sausages and beef with gravy. https://t.co/2y…"], ["carrots, peas and potatoes", 2903637923, "RT @painterley: Yorkshire pudding with roast potatoes, peas, parsnips, sprouts, carrots, mini sausages and beef with gravy. https://t.co/2y…"], ["carrots, peas and potatoes", 35802286, "Yorkshire pudding with roast potatoes, peas, parsnips, sprouts, carrots, mini sausages and beef with gravy. https://t.co/2yiD80A6Gv"], ["carrots, peas and potatoes", 128352598, "Having a Rev James bevy. Picked up 2 bottles for £1 each Reduced to Clear....and two Ham and Cheese Quiches for 50p each. Will make them into main meals with Boiled Potatoes and Carrots and Peas. Or even Beans with one."], ["carrots, peas and potatoes", 1030323151295541249, "RT @JakeMoo22377928: @givenchybaylor Looks like it's mashed potatoes, carrots, green peas and baloney at the prison today for lunch.\n\nIf th…"], ["carrots, peas and potatoes", 235643573, "@destroy_robots Oh god no. The peas are just the excuse. It should include onion, celeriac, carrots, optionally potatoes, smoked sausage, bacon (lard even), pork ribs, soup bone, selery leaves. Oh and split peas."], ["carrots, peas and potatoes", 23237735, "@MrsAitchBee Pears, apples, plums, strawberries,  blackberries, raspberries, blueberries, carrots, potatoes, radish, lettuce, peas, beans, leeks, spring onions, normal onions and various herbs grow in our garden we have more than enough each year to supply not just us, but close friends too."], ["carrots, peas and potatoes", 915157542, "@Rachalan Half bag split peas, half bag of lentils, onion, carrots x5, (potatoes for hungry guests) boiled joint of ham keep water and then add strips of ham in the end..veg stock and ham stock...slow cooker x"], ["carrots, peas and potatoes", 2941717985, "@Barkey2baby Potatoes, mushrooms, onions, celery, carrots, green beans, peas, and seasonings. I was going for a beef stew with mushrooms."], ["carrots, peas and potatoes", 1354540867, "Invite your family, friends, and neighbors\nChicken &amp; Biscuits February 15\nTake out or Eat in\n4:30PM-6:30PM\nChicken and biscuits with a choice of 2 out of 4 sides (peas, carrots, coleslaw, or mashed potatoes), and dessert for $10. \nAll proceeds to benefit the ministries at GUMC. https://t.co/k9eEbrWkKd"], ["carrots, peas and potatoes", 1172290743001444352, "@givenchybaylor Looks like it's mashed potatoes, carrots, green peas and baloney at the prison today for lunch.\n\nIf the fear of eating that won't keep a man on the path of righteousness, nothin' will."], ["carrots, peas and potatoes", 128352598, "Got everything without going to the shops today. Having Roast Chicken, Homemade Roast Potatoes, Carrots, Peas and Yorkshire Pudding. Will have Beans on Toast for Lunch I think."], ["carrots, peas and potatoes", 432743200, "@MrGrips Right now Id settle for what I had for dinner: mashed potatoes on whole wheat, with peas and carrots."], ["carrots, peas and potatoes", 133697600, "RT @iheartnaptime: This easy beef stew recipe is cooked in the oven for maximum flavor concentration and ultra tender beef. The addition of…"], ["carrots, peas and potatoes", 1175567903640342528, "@jo_davies10 @Titmousie The raspberries and strawberries disappeared from the garden,when I knew why...we SHARED!The peas and beans...same!So their meals were made by me.Good mince browned with garlic,onions,potatoes,carrots,whatever vegies to hand.Oats,rice,pasta.And a wee bit of gravy.Containers➡️ 1/2"], ["carrots, peas and potatoes", 3981659242, "@hoyavickii Mmmmm mouth watering Sirloin. I’ll give that a 10/10 for good looks and taste! Medium rare coming up. Just need some mash potatoes, peas and carrots. https://t.co/m8O8uzmKYY"], ["carrots, peas and potatoes", 246528472, "@MegaQuack24 My oldest hates em. My youngest likes carrots and sweet potatoes. But peas? Oh HAAAYL no!!! Lol \n\nJust like her old man #ApplesAndTrees"], ["carrots, peas and potatoes", 115095041, "RT @Living_Lou: MUST TRY RECIPE - chicken stew with garlic, wine, thyme, bacon, potatoes, carrots and peas!\n\nPerfect winter food. \n\nFULL RE…"], ["carrots, peas and potatoes", 755908890882179072, "@GaneWhoo It's like, carrots and peas and potatoes with a ton of mayo. and cold. It's like potato salad SORT OF but they call it French Salad and IM-"], ["carrots, peas and potatoes", 169534344, "This easy beef stew recipe is cooked in the oven for maximum flavor concentration and ultra tender beef. The addition of carrots, potatoes and peas make this a hearty one-pot meal. https://t.co/h64yjbm7VD https://t.co/3ZMMGXAYcj"], ["carrots, peas and potatoes", 877364511774134272, "Friday Deli Special!\n\nPot Roast\nHerbed Mashed Potatoes\nCorn Bread with Honey Butter\nPeas and Carrots\n\n@aldrichsmarket #aldrichsdeli"], ["carrots, peas and potatoes", 4728719241, "If a bag of dog food had the same packaging as human food would you buy it and feed it to your dog? \n\nFor you: chocolate pastries, deep fried cheese, whatever Trix are...\n\nFor your dog: chickpeas, chicken, salmon, rice, sweet potatoes, peas, carrots, beef https://t.co/umLh8Pj3VJ"], ["carrots, peas and potatoes", 216818066, "I'm going to sign off now &amp; go try some of my improvised what's in the kitchen stew - potatoes, chick peas, carrots, onion, chives, frozen green beans (a few for color) and curry."], ["carrots, peas and potatoes", 206883675, "Artis Daily Bread Catering &amp; Restaurant's Friday menu:\n\nBBQ turkey wings\nCountry baked chicken and rice w/mushroom gravy\nGrilled baby back ribs\nFried trout\nBBQ pork blade steak\nTurnip greens\nCabbage\nSquash/ zucchini\nPeas and carrots\nPinto beans and northern\nRed potatoes\nCorn https://t.co/a8V3uqXunR"], ["carrots, peas and potatoes", 2654543552, "RT @Living_Lou: MUST TRY RECIPE - chicken stew with garlic, wine, thyme, bacon, potatoes, carrots and peas!\n\nPerfect winter food. \n\nFULL RE…"], ["carrots, peas and potatoes", 1094785046831984641, "Am I the only one who thinks nga lami sha i-dice then i-gisa og onions and garlic? And then maybe put some carrots, green peas and potatoes, some soy sauce, and honey??? Hahahahahaha https://t.co/gG959OBTtT"], ["carrots, peas and potatoes", 1591812865, "RT @Living_Lou: MUST TRY RECIPE - chicken stew with garlic, wine, thyme, bacon, potatoes, carrots and peas!\n\nPerfect winter food. \n\nFULL RE…"], ["carrots, peas and potatoes", 956567131931410434, "RT @Living_Lou: MUST TRY RECIPE - chicken stew with garlic, wine, thyme, bacon, potatoes, carrots and peas!\n\nPerfect winter food. \n\nFULL RE…"], ["carrots, peas and potatoes", 201427111, "MUST TRY RECIPE - chicken stew with garlic, wine, thyme, bacon, potatoes, carrots and peas!\n\nPerfect winter food. \n\nFULL RECIPE -&gt;&gt;https://t.co/Mf0ZdbH2lD\n#ad #HamiltonBeachCA @HamiltonBeachCA https://t.co/Vg1QbT96BE"], ["carrots, peas and potatoes", 67345281, "@rooshv Had 9 above ground 5x10 boxes in our old spread. Had one box each toms, potatoes, lettuce &amp; chard, beets &amp; carrots, beans and peas on a lattice, cabbage, zucchini, peppers etc. Had a truckload of prepared soil brought in. Season? It was Canada so... fall pic. https://t.co/Onqv16NPX5"], ["carrots, peas and potatoes", 1223376494946406400, "@CoronavirusUpd3 Get canned fruit and veg. Peaches in a can are really cheap. Must have some goodness!? I got plenty of canned carrots, potatoes, ;peas, chick peas, sweetcorn etc....Also got porridge oats, lentils et c"], ["carrots, peas and potatoes", 800718270798045185, "@cozay14 Whacked some peas in and cooked it off. Then boiled potatoes and carrots, mashed them up and added salt and some vitalite, put the mince in the dish, topped it with mash and cooked for like ten mins then grilled for another ten to get it crispy and BONE APPLE TEETH (2/2)"], ["carrots, peas and potatoes", 778665136726958080, "RT @lovageherb: sources of beta-carotene (vitamin a) 🌱\n\ncarrots • sweet potatoes • squash • spinach • lettuce • cantaloupe • red and yellow…"], ["carrots, peas and potatoes", 20322819, "made soup today with bacon, jalapenos, carrots, potatoes, peas, garlic and a little bit of pureed sundried tomato. glorious and there's also tons of it for later!!"], ["carrots, peas and potatoes", 2837217769, "Come warm up with our baked to order Chicken Pot Pie — baked chicken breast, potatoes, onions, celery, carrots and peas in a pale ale chicken gravy, and topped with a flaky pie crust. 🥧\n—\n📸: @YelpSTL https://t.co/D4VhafVGaX"], ["carrots, peas and potatoes", 1212171658028437506, "RT @ghosthunterdaz: @Operation_Ghost @Brandon_Kpt Lamb, parsnips, mashed potatoes, carrots, peas, roast potatoes and gravy 😁😁😁"], ["carrots, peas and potatoes", 1225461615329468416, "@Operation_Ghost @Brandon_Kpt Lamb, parsnips, mashed potatoes, carrots, peas, roast potatoes and gravy 😁😁😁"], ["carrots, peas and potatoes", 759032734429831168, "@tyler_casper Last night was...Roast pork with homemade mashed potatoes/gravy. With carrots and  early peas  and a fresh green salad of kale, spinach, romaine and  veggies all fresh from my garden."], ["carrots, peas and potatoes", 1002708339627909121, "Meatloaf, mashed potatoes, peas and carrots. https://t.co/dcbk8BNWgJ"], ["carrots, peas and potatoes", 963972391, "1. Salt a pot of water and bring it to a boil.\n\n2. Add vegetables like okro, tomatoes to the boiling water and cook, or “blanch,” until crisp-tender, about 45 seconds for smaller vegetables (green beans, peas) and about 2 minutes for bigger ones (carrots, potatoes, almonds). https://t.co/hdCKEswa4l"], ["carrots, peas and potatoes", 177199690, "@Barb_Drummond @CodingMonkey @SaintTheJase @paul123pe @WalledGardenHB @Botanygeek @TadLambJr1 Of my home produce I presently have leeks, several kales, cabbage, parsnips, a few carrots left, some potatoes in storage, and dried mushrooms, frozen berries, peas, beans and some odd greens..."], ["carrots, peas and potatoes", 69198593, "@ChiefPapoose You should wait til I cook Friday! I’m making pot roast w/carrots, red skin mashed potatoes, and corn. Maybe peas. Idk yet lol"], ["carrots, peas and potatoes", 976846874710806533, "And then boil some potatoes, carrots and peas; honey and chives on top and it is DELISH"], ["carrots, peas and potatoes", 89393069, "@AliciaATobin balsamic vinegar, ginger, garlic, onion, carrots, frozen peas and corn, cocoa, milk chocolate chips, peanut butter, tomato paste, diced tomatoes. Oh, oats! And eggs and milk. And coconut milk, potatoes, sweet potatoes/squash. Sorry, this is a long list."], ["carrots, peas and potatoes", 62124651, "Please join us in bible study today at 5:30PM.\n\nThe menu for tonight's pre-Bible Study meal at 5:00 PM is:\n\nSmothered Chicken\nPeas and Carrots\nScalloped Potatoes\n\nBible Study begins promptly at 5:30 PM\n\n #MadeWithRipl via https://t.co/M0sPeIMPK5 https://t.co/OtZTslzkhb"], ["carrots, peas and potatoes", 1054862355572625409, "Today’s Soup:\n\nVegetable Minestrone\n(Vegan)\n\nToday’s Special:\n\nFried Pork Cutlet\nWith Cajun Gravy,\nRoasted Potatoes, \nPeas and Carrots\n\nMexican Day at the Steam Table🌮🌮"]]