[["chai tea", 1018998184151076864, "RT @mtlgazette: Chai Lifeline Canada: Support and tea for families affected by illness https://t.co/1POER49edd https://t.co/xhLHUKzjDO"], ["chai tea", 618896267, "i be a thot 4 chai tea w a splash of almond milk n honey"], ["chai tea", 178481815, "Current obsession: @Starbucks iced chai tea lattes 🤤"], ["chai tea", 1666731301, "Trivial things that have made me cry since joining the ship:\n1) The smell of fresh basil\n2) pizza\n3) a hot chai tea latte"], ["chai tea", 1202934817492324353, "All Rashmi fans send some tea to Himesh reshmiya on below address:\n\"Humein iske ghar mai chai chahiye\"\nA/403 Sea Shell Appartment 7, Bungalows Versova, Andheri West, Mumbai, Maharashtra, India,Ph 022-26331433\n#youarenotalonerashami \n#RashmiDesai \n@Rashamified \n@TeamRashmiStans https://t.co/EaPyFQRsnf"], ["chai tea", 547855044, "My Chai tea doesn't have enough Chai in it. It tastes pretty weak. But as a Millennial I will just drink it. Next time I'll ask for an extra shot of Chai."], ["chai tea", 1513105188, "Made my own Chai tea and Im lovin it 😋😍"], ["chai tea", 1224228093390229504, "@reachsj Its something which is we cant hate, but due to health i would suggest tea without milk...\nIn very famous way...cutting chai.\nAfter all Kolkata taught us sharing is carrying"], ["chai tea", 2678533138, "sipping on a chai tea, talking all politely"], ["chai tea", 1143499691751104512, "@Kasper1672 Chai tea with coconut milk"], ["chai tea", 886227531145383938, "hot chai tea lattes always taste wrong when I get them on campus"], ["chai tea", 1114991293560754176, "In a mood. I haven’t bought Starbucks/coffee in 2020 yet (brewing at home to save $) until now.  Needed an afternoon pick-me-up so I hope this chai tea latte blesses my soul"], ["chai tea", 855253820, "@jeanfloyd_ Chai tea latte with almond milk, thx"], ["chai tea", 218021474, "I haven’t missed out on anything. Chai tea missed out on ME! https://t.co/Ldj4niTkMA"], ["chai tea", 218021474, "Ohhhhh I never in my life have had chai tea. https://t.co/xYTVamFZNr"], ["chai tea", 905352529227247617, "@shawajason word on the street is - back in the day, China only sent their very worst tea to Britain... hm... that said... England does today send only their worst tea to the US... can't imagine how either would taste for the first time if you're even passably familiar with proper chai ;)"], ["chai tea", 1038819476, "I am obsessed with chai tea lattes"], ["chai tea", 66160448, "Marfilu 💖\n\n🇲🇽 |🇵🇹 \nLive everyday like it's your last! ✨\nSun in Espresso, ascendant in Gin Tonic and moon in Chai Tea\n♈️ 🔥  \n#MarfiluDiary https://t.co/Gu1FU22YfY"], ["chai tea", 19409079, "RT @anarvirji: Why do @starbucks at US airports regularly run out of English breakfast tea?  It’s often the only place at the airport to ge…"], ["chai tea", 875769083236671488, "Chai Tea does not make sense YOU COLONISERS"], ["chai tea", 630624455, "@FrecklesNFrce oooo thats probably a good idea- however, i chose a \"vanilla chai\" flavored black tea... doesn't have a very strong vanilla chai flavor"], ["chai tea", 2975366888, "RT @yazminshah_: iced chai tea latte from starbucks is my daily dose of crack"], ["chai tea", 1190803317397565441, "Just threw two scoops of protein into my chai tea latte I am ready facefuck this Wednesday."], ["chai tea", 780588266563047424, "@igot7teenbts If you were here I’d make you a migraine cocktail, two shots of espresso and a little bit of chai tea. Works every time."], ["chai tea", 3525593968, "I made spiced chai tea this morning. Forgot to take the bag out of my mug when i poured coffee in about 20 minutes ago. I now have spiced chai coffee and it's pretty good actually"], ["chai tea", 1091309693140557824, "@StarsNSocks Good morning Lulu * Jolts said as she brought her princess a cup of warm chai tea with a doughnut and a muffin-"], ["chai tea", 845610919271038976, "A lifeline is extended to Montreal parents isolated by illness - Montreal Gazette https://t.co/vkksD1gYLy https://t.co/9lSsFsbT3b"], ["chai tea", 534801170, "RT @yazminshah_: iced chai tea latte from starbucks is my daily dose of crack"], ["chai tea", 926869014546124801, "This is a recipe for when you feel ugly : \n ☕chai tea for grit  \n  🥀lavender for sniffles  \n  💜amethyst for bite"], ["chai tea", 738182161191292928, "Chai five! Because we all know the students spill the tea to our school counselors! Bonus of #Day3 of #NSCW2020 is that it's the 100th day of school here @NorthernYorkSD! 🙌 Special thanks to @dunkindonuts for bringing @DearOldNorthern 100 donuts!  @PSCAtweets #TeamNorthern 💜 https://t.co/DAvfRV3hab"]]