[["chickpeas", 434270086, "RT @WFP_MENA: Also known as garbanzo beans, #chickpeas are a great source of fiber and protein. Chickpeas are particularly beneficial at re…"], ["chickpeas", 129832239, "@BrittApplegate I was so shocked that ppl didn’t make their salads like that! I add kale/spinach, peppers, tomatoes, mushrooms, onions, chickpeas, hemp seeds &amp; season it with onion, garlic, oregano, basil, olive and balsamic! Yours sound good!"], ["chickpeas", 262925879, "RT @LeArielleSimone: Foods that help with menstrual cramps:\n\n- apricots\n- artichokes\n- avocados\n- bananas\n- carrots\n- chickpeas\n- dark choc…"], ["chickpeas", 759157273059024896, "@parsonshanged @NeolithicSheep Make it yourself. Just make sure you use chickpeas that you've heated up, and good tahini. It will be better than sabra, I promise."], ["chickpeas", 2165558895, "Made this today but doubled the quantity. I also added a tin of chickpeas at the end and then wizzed it. Truly lovely and filling with chickpeas. Butter beans might be nice as maybe kale or broccoli. What do you think?"], ["chickpeas", 1048876782647169024, "I go to gym then get to work and have PB+J on toast because PB is banging and its quick and easy in canteen and on weekends i make protein pancakes of game changers site. Then have a salad on break with chickpeas beetroot basically whatever you fancy on them keep it interesting"], ["chickpeas", 861794075237695488, "RT @TenSpeedPress: Happy release day, @JoeYonan! #CoolBeans is a fresh, modern look at the diverse world of beans, chickpeas, lentils, puls…"], ["chickpeas", 1012698753013346305, "@TamarHaspel @JoeYonan Love 😍lentils 😍chickpeas😍beans😍legumes."], ["chickpeas", 1073005556, "@PMenonIFPRI Working from home, but it's still a leftover roasted veggie party! Brussel sprouts, beets, rainbow carrots, eggplants + roasted chickpeas + some feta  and purple cabbage.  Eating the 🌈 today!"], ["chickpeas", 595684164, "Who knew rice could be so interesting?! Balducci's Food Lover's Market now carries RightRice--vegetable rice grain that's made from lentils, chickpeas, and peas, and contains more than 2 times the protein and 5 times the fiber of white rice. YUM! https://t.co/q7q9IRM3RJ https://t.co/rPFZpLu2Ei"], ["chickpeas", 278080156, "RT @BattleReady360: Here's a great recipe for Homemade Hummus. \n• 1 can organic chickpeas (½ liquid drained)\n• 2 garlic cloves, peeled, or…"], ["chickpeas", 815297047452667904, "Rushing out the door today and packed half a loaf of bread and a can of chickpeas for lunch. 😭😭 Why am I like this?"], ["chickpeas", 1114279867347079169, "jamming to @davoskdocta and thinking about the chickpeas i'm going to have for lunch"], ["chickpeas", 757658872253444096, "because there is no connection between the variables in this proposition, you can create an infinite number of equally useful formulations by inserting literally any two phrases; e.g., \"just imagine a stoat biting you in the taint, and you see why we need canned chickpeas\" https://t.co/T92rwia17l"], ["chickpeas", 884473528006959104, "@Weebvile chickpeas are great! i like frying till crisp or using my friends recipe for a curry. i can dm the latter to you if you’d like"], ["chickpeas", 2598198978, "R/Ting for seriously good-looking recipes. Fried chickpeas! :) https://t.co/ZY2tix4M3k"], ["chickpeas", 394806642, "RT @BootstrapCook: One of my favourite recipes - and one of the most popular on my site. Just take a can of peaches, a can of tomatoes, a c…"], ["chickpeas", 1187427058135306241, "Have you tried one of our famous Chickpea Salads yet???  These babies are packed full of flavor and protein and 100% #CholesterolFree !  \n.\n.\nPictured: 📸 Curry Chickpea Salad on an organic wrap w/ The Cure juice (beet, lemon, carrot, apple)\n.\n#chickpeas #veganfood #lakelandfl https://t.co/iK2BOVgnPM"], ["chickpeas", 26651535, "RT @Aaronvegan: Posh Sausage &amp; Beans on Toast.\n\nUsing Meatless Farm sausages. A tin of mixed beans (chickpeas, kidney, black, adzuki, pinto…"], ["chickpeas", 358554902, "@hotgirljeon You know I bought those chickpeas and didn’t even eat them because they smelled like Vienna sausages out the van 🥺🥺🥺🥺🥺🥺"], ["chickpeas", 1150308438586433536, "RT @homeecuisine: Chickpeas With Beef\nIt is one of the indispensable flavors of Turkish home cooking. It is also very practical to prepare.…"], ["chickpeas", 51890807, "I've been roasting chickpeas. A yummy snack, not an obscure Spanish saying (though it might also be that). https://t.co/6hhd3B8saO"], ["chickpeas", 760395242, "@ulcahyPaulM @OwensDamien @AngrierWHStaff Hogan reminds me of a full-time Praiser of Ramses I, who sits at a wax tablet magnifying His Corruscating Brilliance all day, then heads to the tavern for a honey mead or four, and a bowl of crunchy chickpeas."], ["chickpeas", 132194606, "@samanthadjb now i'm angry. what kind of monster doesn't put lemon juice in there??\nalso, i use a ladle to scoop the chickpeas into the Vitamix. that's usually almost enough aquafava. i needed to add 1/4 cup after. salt and black pepper to taste as well. za'tar on top.\nand fresh pita!!"], ["chickpeas", 862928878272163840, "RT @SigmaSixQ: 1st February - my week in the peaceful and invigorating environment of #Dayalbagh is coming to a close. Today afternoon’s fi…"], ["chickpeas", 315201855, "RT @BootstrapCook: One of my favourite recipes - and one of the most popular on my site. Just take a can of peaches, a can of tomatoes, a c…"], ["chickpeas", 558903596, "RT @bdaiwi_historia: Probably the earliest extant Hummus recipe dating back to 14th century AD in cookbook written in Cairo: a cold purée o…"]]