[["chicken pasta", 989800270870786048, "@yungkatelynne My sister learnt to make a ‘Chicken Pasta Paprika’ in her first year of Home Ec and I swear if I ever meet her teacher I’ll wallop her for it"], ["chicken pasta", 1706347820, "RT @epicurious: Not your typical pasta bake: https://t.co/OauM03Iocv https://t.co/aPzF4fbBWD"], ["chicken pasta", 1016090107986792448, "First of all. My pasta was https://t.co/u7rxhgTvDX &amp; alfredo chicken wings BUSSIN🤤🤤🤤 they was sooooo good try em &amp; thank me later."], ["chicken pasta", 289527563, "RT @BlueStar_yyc: Buon Thursday, pasta lovers! Ch-check out the special! Chicken &amp; Mushroom Gnocchi with kale, crispy cheddar 🧀, crispy lee…"], ["chicken pasta", 3377377341, "@KashMoneyyE Garlic chicken parm pasta"], ["chicken pasta", 2926249240, "Chicken Parmesan, Pasta Roni, and Broccoli. \n\nThis one wasnt so bad, the brocolli was microwaved from frozen for budget, same with pasta roni. Chicken was an easy cover and cook, only messy part is using your hands and this mix on the left. https://t.co/qC18RBdzut"], ["chicken pasta", 1222917628420874240, "@coronavirus__1 Do you know of any good prepper sites? I bought 55 lb of white rice, 30 lb of dried beans, peanut butter, pasta, canned tuna chicken and peas. Couple other things too and 3 personal water straw filters 1 larger hanging filter. Bought a crossbow for small game, LOL"], ["chicken pasta", 370769539, "Buon Thursday, pasta lovers! Ch-check out the special! Chicken &amp; Mushroom Gnocchi with kale, crispy cheddar 🧀, crispy leeks and toasted focaccia 🥖. Also see: Naps and smiles. #yyc #yycfood #yyceats https://t.co/S4EF6fJJmW"], ["chicken pasta", 15845456, "Chicken sausage, broccoli rabe, chickpea and red lentil rotini. Butter, minced garlic, cheese. #perfection  \n(I’m still adapting to the gluten free pasta, the Italian in me is having a hard time) https://t.co/ljNBoBS6EH"], ["chicken pasta", 256627415, "@SlingsBeer @ShayLizBarker Ok Tuna... BUT THAT'S IT!\n\nOH AND CHICKEN SALAD\n\nSO HELP ME GODS IF YOU SAY PASTA I'M GONNA LOSE IT!!!!"], ["chicken pasta", 55152292, "This jerk chicken pasta im about to make, it finna be fireeeee"], ["chicken pasta", 1225410802989109253, "Dinner = friend chicken pasta baby carrots and Hawaiian rolls 😝"], ["chicken pasta", 14921141, "Whether you're craving pasta, fajitas, roasted salmon, or sauteed chicken, weeknight cooking doesn't get much simpler than this. https://t.co/WoSVFdEZej"], ["chicken pasta", 3232514776, "I want jerk chicken pasta but nobody can cook it in Tallahassee 😒😒"], ["chicken pasta", 55514340, "About me. https://t.co/D4TzbNnQcB Talofa lava My name is Amira, I am a year 5 student at Pt England school. I am 9 years old. My culture is samoan ,niuean and maori .My favourite food is chicken nuggets and pasta. My favourite sports are softball an..."], ["chicken pasta", 999323380494028801, "i’m making creamy pasta w veggies (instead of chicken for the first time lmao) and again for the first time we have all the ingredients present at home i don’t have to substitute anything this is what stanning bts and minding your business does thank you"], ["chicken pasta", 1016801289362182145, "@Ross1874_ Chicken and bacon sub, wee pot of pasta and an oasis, undefeated"], ["chicken pasta", 1178190019099529223, "@UltraBaller Peanut chicken, congee, and some pot stickers"], ["chicken pasta", 3020738187, "A snowy evening in Stowe!  It’s coming down pretty good and we’re supposed to get lots more!!  Gives me all the cozy feels so I immediately came home and started a fire ☺️🔥 We’re having chicken and pasta tonight for… https://t.co/dPdcKipwOw"], ["chicken pasta", 1351499340, "height           : 5'6\"\nage               : 23\nshoe size      : 8 UK\nzodiac           : Libra\ntattoos          : 8\npiercings      : Nada\nfav drink       : Monster/Tea\nfav food        : Chicken Pasta Bake\nfav animal     : Wolf https://t.co/98OpJ0mkRA"], ["chicken pasta", 1213305914289053697, "RT @SharonnRosee: A lunch time order: buffalo chicken wings with fried wings &amp; a homemade blue cheese dip (also ordered a creamy Cajun chic…"], ["chicken pasta", 3751863701, "@DCGMS lunch menu for   2/7 - chicken alfredo w/ pasta &amp; breadstick; or cheeseburger &amp; french fries; or yogurt pack; or deli sub sandwich; or pizza parlor pizza; or Creation Station made to order walking taco; fruit &amp; vegetable bar; &amp; choice of milk. #NationalFettucineAlfredoDay https://t.co/ozk8yirmTr"], ["chicken pasta", 136516514, "I’m making chicken and shrimp pasta tonight 👀"], ["chicken pasta", 175788020, "Ibrahims in Birmingham used to do a banging chicken parmesan and their kebabish was 10/10. And that off-the-menu parmesan pasta. Mate. A shame they closed down"], ["chicken pasta", 81285743, "@_DearDIV I want Alfredo pasta with like chicken or shrimp xD"], ["chicken pasta", 240915410, "RT @KitchenSanc2ary: Chicken and Red Pepper Pasta - A lightened-up chicken and spaghetti meal with bags of flavour! \nhttps://t.co/7OfOsaPQP…"], ["chicken pasta", 1172237554717995009, "@TheRealMeAshley Eating chicken Alfredo pasta with broccoli what you doing https://t.co/W2oqSpY386"], ["chicken pasta", 2173950653, "Idk if i want pasta , a chicken quesadilla or chicken and loaded baked potato 🤔🤔"], ["chicken pasta", 467182644, "RT @KitchenSanc2ary: Chicken and Red Pepper Pasta - A lightened-up chicken and spaghetti meal with bags of flavour! \nhttps://t.co/7OfOsaPQP…"], ["chicken pasta", 1213119353110982656, "for the record, this is the 4 cheese mac with honey pepper chicken from applebee’s! i take off the chicken and divide the pasta in half to get this 500 cal serving! it was 520 for me bc i added 2 tsp of grated parmesan"], ["chicken pasta", 2755334117, "Cajun chicken and shrimp pasta from Friday’s go crazy 🗣 https://t.co/eA8cCQUHc9"], ["chicken pasta", 1190580830072000512, "RT @tasty: Chicken Pesto and Zucchini \"Pasta\"\nShop this recipe in our Tasty iOS app: https://t.co/HEJdma21Pz https://t.co/GMFpm2mjlY"], ["chicken pasta", 407843676, "@izzyw58 Man it’s the worst! I’m so tired of making nachos, chicken, and pasta!! I’ve had to mince veggies into a pasta before just to get him to try it😂 if it’s not sweet or meat he won’t eat 😭😂"], ["chicken pasta", 792759167949926404, "Im craving Rasta Pasta with jerk chicken from Footprints in Brooklyn"], ["chicken pasta", 1119706693594644482, "Pasta, rice, chicken, oat, burgers, puddings, plantains, fries, seafood, chinese, there are varieties 🤲🏿 https://t.co/QPOM880unu"], ["chicken pasta", 999099593051787264, "Chicken Parmesan over angel hair pasta sounds like the plan for dinner tonight 😋🤤🤤"], ["chicken pasta", 173970155, "RT @BiggieSnuggs: I want some Cajun chicken pasta from Beck 😋"], ["chicken pasta", 46805748, "In need of some comfort food this evening? Pasta always does the trick! Try these Easy Gluten-Free Parmesan Noodles. Ideal as a side dish but you can add a little protein like tuna, bacon, or chicken to make it a main dish if you like. #glutenfree #pasta https://t.co/VGV4Z0YBzP https://t.co/Hq3hyy4nix"], ["chicken pasta", 428800091, "I wish I didn’t like pasta and breaded chicken so much, I would easily be 15 pounds skinnier"], ["chicken pasta", 727269261215961088, "Need to get back to making more pasta meals 🥺\n\nLook at this turkey bacon + spinach + mushroom + chicken + all this creamy goodness\n\n#TheedeesKitchen https://t.co/MJCagEl4yn"], ["chicken pasta", 246398986, "Try our deliciously creamy alfredo pasta with your choice of crab, chicken, or shrimp. 🍝😁\n\n📸 : David L https://t.co/J4plN2NWQw"], ["chicken pasta", 204736152, "RT @Aaronvegan: Mediterranean 'Chicken' &amp; Gigli Rigati Spelt Pasta with Garlic Panini Bread.\n\nI'm so pleased my local @coopuk is now sellin…"], ["chicken pasta", 22154136, "RT @Aaronvegan: Mediterranean 'Chicken' &amp; Gigli Rigati Spelt Pasta with Garlic Panini Bread.\n\nI'm so pleased my local @coopuk is now sellin…"], ["chicken pasta", 353370608, "i literally eat: tacos, chicken tenders, burritos, pasta, wings, fajitas, pizza, and chicken tenders throughout the week."], ["chicken pasta", 2583574865, "For someone who eats chicken breast all the damn time I always freakin under cook it, I can NEVER get it right. I brought a yummy chicken pasta and I looked at one of my bites and it had a freakin PINK line in it. I am disgusted. My lunch is ruined."], ["chicken pasta", 4312339943, "might do a recipe thread on this it’s potentially the best pasta chicken broccoli based dish i’ve ever made"], ["chicken pasta", 957665220683550721, "RT @Jvsoonn: So I made chicken &amp; shrimp pasta and decided to have fun with it https://t.co/hWYZOrFYO1"], ["chicken pasta", 180066380, "\"AWESOME! No changes! Going to try with chicken.\" https://t.co/CT3MfZwR24"], ["chicken pasta", 340955233, "I love how happy and proud he is telling everyone that he's cooking for Ben and what he's cooking he's so adorable can't wait for the day we actually get to see them eat the chicken pasta https://t.co/oV8nZJ74eG"], ["chicken pasta", 553406849, "@alittleleader Chipotle chicken pasta, miso salmon or if they have the asparagus and egg appetizer I will get that."], ["chicken pasta", 771261538686541824, "RT @chefbellamari: Pasta carbonara , griller chicken and  griller tomatoes!\nQuick healthy meal!🍝❤️ https://t.co/lceIdYW0a6"], ["chicken pasta", 17846734, "New photo: A rather spicy chicken and pasta dish from a roadhouse hidden near the Boston line. https://t.co/RyQln6h5J2 https://t.co/NczVQeCxhk"], ["chicken pasta", 302858712, "Specials today are Vegan Broccoli Tofu in Peanut Ginger Sauce, Moroccan Curry, Vegetable Barley Soup, Pasta Salad garnish. Neatloaf Dinner or Sandwich with vegan option, ditto Chicken Pesto Wrap, Portobello Quesadilla, Mexican Bowl or Salad!"], ["chicken pasta", 2410907861, "Gonna make myself a chicken pasta bake 🤤"], ["chicken pasta", 2401016788, "I want some extra cheesy pasta with crispy chicken Parmesan but idk where to go"], ["chicken pasta", 2435574234, "@zDiced Some pasta and chicken breast. Some sauce my mom makes too. She learned it from her sister “family recipe” you can say. Also can be made with shrimp (originally was)"], ["chicken pasta", 4919085077, "I was literally in the middle of cooking. My pasta was finished and the chicken was halfway and they decided to have unscheduled loadshedding"], ["chicken pasta", 20755902, "Why does the universe keep tormenting me? I buy some tuna pasta, it has sweetcorn in it! Chicken noodle soup, sweetcorn! Perri perri chicken, sweetcorn! Little yellow pieces of hell itself! Fuck off sweetcorn! #notosweetcorn"], ["chicken pasta", 2613060810, "On today’s episode of bizarre roommate behavior, the stove chicken\n\nOn Monday, roommate cooked some chicken breasts and pasta on the stove. Instead of refrigerating they ones he didn’t finish, he’s just left them sitting on the stove for three days, eating more each night"], ["chicken pasta", 454958058, "I was on the phone w my mom yesterday and she got mad at me because all I eat is pasta and fake chicken burgers."], ["chicken pasta", 159936068, "@VeezTales Pasta ? Shrimp ? Chicken ? Lol"], ["chicken pasta", 125783222, "RT @VapianoUK: Trialling from today in Vapiano Bankside only - THIS plant based chicken and bacon. (Honestly the first time we tried it we…"], ["chicken pasta", 1110541382450663426, "RT @chefbellamari: Pasta carbonara , griller chicken and  griller tomatoes!\nQuick healthy meal!🍝❤️ https://t.co/lceIdYW0a6"], ["chicken pasta", 19339342, "Managed to eat all but one chunk of chicken and a single penne pasta before I got called away from my break 🙃 on the plus side it was a tasty tea, on the negative, pretty sure I served a queue full with pesto in my teeth https://t.co/AqwE61kMXX"], ["chicken pasta", 4746882313, "Chipotle chicken pasta\nLouisiana chicken pasta\nMiso &amp; the lemon herb salmon\nChicken Madeira \nFucking everything !!! https://t.co/j9sOy1GXDA"], ["chicken pasta", 1134917944276901888, "its rainy today and it has that sad vibe to it but my grandma made me all I love for lunch, she made me roasted chicken, she made me banana farofa, and she made me pasta, which is one of those things that makes me realize everything I've been taking for granted"], ["chicken pasta", 390095241, "Trialling from today in Vapiano Bankside only - THIS plant based chicken and bacon. (Honestly the first time we tried it we were like 😲🤯😍😍😍) \n\nTotally vegan 🌱 \nAdd to any pasta dish or salad. https://t.co/UuAI8LJ8sw"], ["chicken pasta", 1085174162610704384, "Chicken Broccoli Alfredo - Chicken tenders with fresh broccoli &amp; ziti tossed with Alfredo sauce, garlic &amp; Romano cheese. Order online @ https://t.co/AhdZoKkRRb and get 10% OFF!!!\n\n#alfredo #chicken #broccoli #ziti #linguini #pasta #lunch #foodies #foodporn #southie #southboston https://t.co/XY3Q1b2ZSf"], ["chicken pasta", 138089184, "Spicy chicken'n'veg pasta.....\n\nAnd a RSA Pinotage - lekker...smaaklike! https://t.co/aBX08VCbyY"], ["chicken pasta", 30983139, "Good Morning All!!!! \nPlz make your order 4 Tomorro Delivery\n$15 (1lb) Seafood Salad or $12 Jerk Chicken Pasta Each Order Comes W/ Choice of Ice Cold ❄️ Bottle Water or Soda 🥤 (Sprit, Ginger Ale, Ice Tea, Orange,… https://t.co/AhfTApVDxd"], ["chicken pasta", 2428366926, "@pinkfIame I’ve made shrimp scallop &amp; broccoli pasta w/ white sauce (clam juice, olive oil, wine, butter... I have a whole recipe). I made him Mexican enchiladas w/ rice. I gotta make him the spicy chicken &amp; sausage jambalaya I’ve cooked a few times"], ["chicken pasta", 1034772002777776128, "First proper meal back at Uni /0/ made chicken broccoli cream pasta and a mini parfait with strawberries, meringues, sponge cake and pudding 🍓 https://t.co/8QUbUu9xkX"], ["chicken pasta", 919218318522834944, "RT @KitchenFlavour1: Not yet decided on what to have for dinner? How about this really quick and tasty chicken stroganoff, my kids like it…"], ["chicken pasta", 460431777, "Menu Adjustment for today, February 6th. Pasta with Meatballs, Peas ( No grinder today) or Toasted Cheese with Chicken Noodle or Tomato Soup Tater Tots"], ["chicken pasta", 1209219149089705994, "RT @KitchenSanc2ary: Chicken and Red Pepper Pasta - A lightened-up chicken and spaghetti meal with bags of flavour! \nhttps://t.co/7OfOsaPQP…"]]