[["chicken makhani", 927939132566966272, "Tandoori chicken biryani with a makhani curry sauce.\n\nSorry, was too hungry for pictures on the plate. https://t.co/0hCUVhRwZl"], ["chicken makhani", 1187347047520727044, "The Chicken Kofta is the flavor-packed Chicken curry simmered in a Tomato Makhani gravy and simmer along Chicken Kofta Balls https://t.co/xEVVrRxJDW"], ["chicken makhani", 1379008968, "@SimplyCookcom Chicken Makhani - delicious and so easy to prepare and cook. Really authentic. Thanks guys."], ["chicken makhani", 165821026, "Chicken Makhani - Our Popular Butter Chicken! Cooked with cashew paste, cream and home made butter.\n\n#delhigrill #food #lovefood https://t.co/P9OaDd0wB9"], ["chicken makhani", 567470318, "My Dinner Plate Certainly Better Than Yours. . This Super Amazing Chicken Biryani Served With Raita, Chicken and Dal Makhani Is Something Unforgettable On Your Mouth Palate \n\n.\n.\n.\nFOLLOW @harshmeet7 \nFOLLOW… https://t.co/HRQ0kEveak"], ["chicken makhani", 1038701546999934977, "@Reem14 The gravy that I have prepared for Paneer Angara recipe is a basic rich and creamy Indian gravy which is also used in many other recipes, it is also called Makhani gravy, so you can use this gravy in butter chicken😊"], ["chicken makhani", 206523117, "@joybhattacharj A Punjabi family ordering daal makhani and chicken lababdar at Sanadige and the waiter whispers gently in their ears - Shouldn’t you order their coastal specialities instead?"], ["chicken makhani", 29094252, "@SikhProf @vchhibber I made saag, korma, and makhani; chicken adobo; and drunken noodles all in the past week.\n\nI am so grateful for all the immigrant-Americans who share their cuisine!❤️🌏"], ["chicken makhani", 44422581, "RT @LeftIsRightInNE: Over the past week, I have made chicken makhani, saag, and korma (Indian); chicken adobo (Filipino); and drunken noodl…"], ["chicken makhani", 29094252, "Over the past week, I have made chicken makhani, saag, and korma (Indian); chicken adobo (Filipino); and drunken noodles (Thai).\n\nNot bad for a white mom in Nebraska. \n\n(My kids had Mac and cheese for supper)."], ["chicken makhani", 1054441624921563137, "RT @GreenZebraMenu: hotbar@#gzglloyd\nChutney Chicken,\nDahl Makhani,\nAloo Matar,\nAloo gobi,\nBasmati Rice,\nRoasted Veggies"], ["chicken makhani", 1011727897, "hotbar@#gzglloyd\nChutney Chicken,\nDahl Makhani,\nAloo Matar,\nAloo gobi,\nBasmati Rice,\nRoasted Veggies"], ["chicken makhani", 14778803, "Butter chicken pizza tonight! Made the makhani sauce from scratch and picked up some pre-marinated tandoori chicken from an Indian Butcher down the street. https://t.co/NwA3lmfFUj"], ["chicken makhani", 44110903, "While we wait for #DelhiAssemblyElections result, here’s the pecking order for leftover food: 1. Chinese 2. Butter chicken/Dal Makhani/Saag/sambhar 3. 🍕"], ["chicken makhani", 3299426858, "@machinegunkelly try chicken butter makhani or shit"], ["chicken makhani", 1049486982336917505, "RT @wheezyefbaby: coconut shrimp masala is the number one desi food, above biryani and chicken makhani. \n\nSouth Indians firmly grasp this W"], ["chicken makhani", 2478592622, "height: 5'3\" \nage: 28\nshoe size: 6.5\nzodiac: cap \ntattoos: 7 \npiercings: 5? eyebrow, nose, and 3 in my ears \nfav drink: COCA COLA i love to consume battery acid\nfav food: chicken makhani\nfav animal: my cats would surely kill me in my sleep if i dared to choose https://t.co/U8Q9m0BdxC"], ["chicken makhani", 1191152670414950400, "BUTTER CHICKEN/MURGH MAKHANI#260# https://t.co/P4ObqLXwRR via @YouTube"], ["chicken makhani", 2938281031, "@CrypticKush i think he's more of a chicken makhani type of guy"], ["chicken makhani", 17273529, "RT @plant2plateuk: Its the fabulous #caerphilly #FarmersMarket tomorrow at the Twyn. Loads of local produce, I'll have my famous chicken ma…"], ["chicken makhani", 2434038770, "Its the fabulous #caerphilly #FarmersMarket tomorrow at the Twyn. Loads of local produce, I'll have my famous chicken makhani and lots more #handmademeals Penrhiw farm will be there with plenty of their #local… https://t.co/reurYP8bKO"], ["chicken makhani", 1196559822524747776, "@likemindedfree1 makhani chicken - Rich, creamy, earthy and spicy! \nOr biryani. Both my favourites"], ["chicken makhani", 1079375809826021376, "@justvoot makhani chicken\n\n#RashamiKeAsliFans\n#AsliFans\n#BB13OnVoot"], ["chicken makhani", 1015617247, "@ebruenig Chicken korma! alternatively dal makhani if you’re vegetarian!"], ["chicken makhani", 840383632481038336, "@sumiandnoir @ebruenig CHICKEN MAKHANI/BUTTER CHICKEN."], ["chicken makhani", 711091795959029760, "RT @NeophyteCook: Making a rough attempt at making butter chicken (murgh makhani) with homemade ingredients and chicken stock. https://t.co…"], ["chicken makhani", 711091795959029760, "RT @NeophyteCook: Making a rough attempt at making butter chicken (murgh makhani) with homemade ingredients and chicken stock. https://t.co…"], ["chicken makhani", 45808825, "Dinner Carmichael: Grilled Beef Tips Citrus Chipotle BBQ, Indian Chicken Vindaloo, Baked Manicotti (V), Dal Makhani, VG Roasted Red Curry Coconut Tofu, Balanced Plate: Blackened Redfish w/Mashed Yucca+Corn Salad w/Queso, VG Indian Samosa, Large Round Raviolis, Broccoli al Forno"], ["chicken makhani", 162354890, "How does butter chicken curry \n(murgh makhani)\nsound to folk? It’s basically made of spiced yogurt marinade and mildly spiced tomato sauce."], ["chicken makhani", 1205809025209815040, "@JimmyJazzEsq @Guinnessta @bsgorrie @Andy_Sargent Had a marvellous Chicken Tikka with a Makhani Daal for tea last night, with 4 pints. Yes, I still have credit in my current account for a few more days. After that, my go too would be beans because Spaghetti Hoops are for people under the age of 10"], ["chicken makhani", 752275730139086848, "@faegonometry Dhal makhani, biryani, chicken masala, when you're right you're right"], ["chicken makhani", 1188036951942844417, "if you don’t like chicken makhani we can’t be friends"], ["chicken makhani", 1103225006, "Try The Original Chicken Makhani #motimahal #bahrain #Dubai #UAE #India #uk #indianfood #mydubai #manama #dxb #dubaifashion #dubai_restaurants #dubaifood #AbuDhabi #myabudhabi #tasty #Food #SaudiArabia #oman #kuwait #instagram #biryani #Saudi #ksa #Muharraq #riffa #dubaifashion https://t.co/uKcgiZ8Jw7"], ["chicken makhani", 157625378, "RT @tomtomatoe: Overall, the most loved dishes in 2019 were chicken biryani, masala dosa, paneer butter masala, chicken fried rice, mutton…"]]