[["chicken vindaloo", 371265185, "@k_b0mpad Chicken Vindaloo (extra hot) with garlic naan"], ["chicken vindaloo", 312032550, "@banditelli Chicken Vindaloo with roti, string beans and lemon rice."], ["chicken vindaloo", 65363177, "@geehaf Depends where I am - if I am in Nahar it has to be a chicken vindaloo or a kochi, both of which are excellent there. In Ginger I usually have jalfrezi, maharajah, channa or a vindaloo depending on what I fancy. Calibration curry for a new place is always chicken vindaloo."], ["chicken vindaloo", 912934727056736256, "@Jack_Septic_Eye Happy birthday dude :) hope you have a nice relaxing day, I know you old folks like that shit. Have a ginger ale and put your barkin’ dogs up. Maybe have a nice chicken vindaloo to wrap it all together"], ["chicken vindaloo", 1193406134872354816, "@justvoot Chicken vindaloo\n#RashamiKeAsliFans \n#AsliFans\n #BB13OnVoot"], ["chicken vindaloo", 496187933, "Chicken Vindaloo (BIR) Restaurant Style @ Latifs Indian https://t.co/laYfqN0TY6 via @YouTube Check And Follow !!!"], ["chicken vindaloo", 1137284023, "Sandwiches, Salads &amp; Hot Bar in Rochester today!  Soups: Ham &amp; Bean, Bountiful Vegetable, Clam Chowder, Mushroom Barley. HOT BAR FEATURES: Thai Chicken, Thai Eggplant, Sesame Rice, Thai Vegetable Linguini, Moroccan Cous Cous, Chicken Vindaloo, Channa Masala.  @DowntownRochMN https://t.co/oV0Wf6u09Q"], ["chicken vindaloo", 1117781750074281984, "Calling all foodies! Winterlicious 2020 is on now until February 13 at more than 200 restaurants.  We recommend Goa Indian Farm Kitchen located in Bayview Village Shopping Centre, their chicken vindaloo will have your tastebuds watering! https://t.co/dgWIZDJxnj"], ["chicken vindaloo", 1116341322695217157, "@MisterAntiBully OOOOh my Chicken vindaloo 😱"], ["chicken vindaloo", 547104208, "Chicken Vindaloo - not much UMPF in this recipe, but it was good anyway 🐔❤️ https://t.co/xOb8GjgVx0"], ["chicken vindaloo", 43932065, "Today's Thali Special is Chicken Vindaloo/ Served with basmati rice, soup, salad, pakora, vegetable &amp; naan $11.95!"], ["chicken vindaloo", 729045464021127168, "@FarandWidecom Chicken vindaloo, next!"], ["chicken vindaloo", 1499383375, "On tomorrow's specials list:\nGoan Lamb Vindaloo,\nMedium-Hot Parsee Chicken Curry Mumbai,\nChicken Cordon Bleu with Smoked Ham, Gruyere Cheese and Tomato Sauce,\nLamb Burger With Goats Cheese,\nNorth Atlantic Cod Suprerme,\nRolled Chorizo &amp; Sage Pork Belly,\n\nhttps://t.co/tbH806OcuC https://t.co/qXjWobRcMB"], ["chicken vindaloo", 45808825, "Dinner Carmichael: Grilled Beef Tips Citrus Chipotle BBQ, Indian Chicken Vindaloo, Baked Manicotti (V), Dal Makhani, VG Roasted Red Curry Coconut Tofu, Balanced Plate: Blackened Redfish w/Mashed Yucca+Corn Salad w/Queso, VG Indian Samosa, Large Round Raviolis, Broccoli al Forno"], ["chicken vindaloo", 2806767949, "@bbypooch Chicken vindaloo fire if you like meat"], ["chicken vindaloo", 1082278439032246272, "RT @ebslmbwn: I try to make a chicken vindaloo. https://t.co/n9kGICLfK8"], ["chicken vindaloo", 527640646, "I try to make a chicken vindaloo. https://t.co/n9kGICLfK8"], ["chicken vindaloo", 1356628364, "RT @redlionpub: This weather is right on time! It's Curry and a Pint Wednesday at the pub! Just $24 all day for your choice of house-made c…"], ["chicken vindaloo", 48785931, "HotBarFresh: local rstd 🍋pepper 🐔, chicken or tofu vindaloo, rice, garlic bread, sauteed local mushrooms, rstd squash #hotbar 11am-2pm &amp; 4:30-7pm for here or to go, made from scratch with organic and local ingredients. What's on hotbar tomorrow https://t.co/TeRTE48ml5 https://t.co/KT5jyAKv4L"], ["chicken vindaloo", 146795567, "RT @chefsalvinu: Spicy pork and chorizo \nCurried cauliflower \nYellow split pea \nChicken Florentine \nEgyptian lentil \nChicken noodle \nSeafoo…"]]