[["chicken with apples", 1116307066694451200, "At this party and they stuffed this chicken with apples and cranberries, white ppl gotta chill"], ["chicken with apples", 2296130183, "@AploveStudio @GhostBlastGame @nacho_chicken with delicious design comes delicious apples"], ["chicken with apples", 325534475, "I entered Ebeano Supermarket and I saw people leaving with Val things; chocolates, gifts, cards and shit. Even secondary school pupils dey power. 💪🏻 \nMeanwhile I left with apples, chicken and orijin bitters 🤡 https://t.co/WVOHbTD4HW"], ["chicken with apples", 19726147, "Curry chicken with apples mango beets and carrots with a side of peanut butter sauce https://t.co/E8zkwYCfAb"], ["chicken with apples", 1207790973918597122, "Apples and Cheddar Chicken Salad By @diethood@diethood . Full recipe with direct… https://t.co/O5ZijUcvoT https://t.co/AXj6dEgO74"], ["chicken with apples", 261362325, "Our \"Apple II\" salad! A delicious combination of a spring mix salad, grilled chicken, sliced apples, candied walnuts, bacon, smothered with a delicious Balsamic dressing on the side! https://t.co/V3BieTUORb"], ["chicken with apples", 972236811043880961, "Base of Kale with curry chicken, house pita chip, raisins, granny smith apples, grape tomatoes, corn, and horseradish dressing #SimplySalad #RandomSalad"], ["chicken with apples", 83719390, "@Day_Bo24 Bruh the apples with the toffee dip are BEYOND GOOD!  And them chicken tenders with the right sauce?! WHEW! And the seasonal banana pudding cheesecake milkshake?! https://t.co/C0fZTRFKSD"], ["chicken with apples", 196170860, "Bacon Wrapped Chicken (Breast), Stuffed With Apples &amp; Aged Ontario Cheddar, Red Pepper Jelly, Wild Rice Pilaf GF, Serves 2: $21.95 https://t.co/GE8XHJEdGa"], ["chicken with apples", 29029413, "@jfuknt No those were two sep. meals for us, PB&amp;J with like apples/carrot sticks or pretzels and chicken noodle was always served with ritz knock offs or saltines."], ["chicken with apples", 1176119760318357505, "@iamdaishaaj girlll i hate ranch but a lot of greens help with movement. when u make a salad add stuff to it like baked chicken, apples, nuts, cranberries, allat...it makes it sooo good!!!"], ["chicken with apples", 94421821, "@bzdarling this is so good with arugula cranberries walnuts green apples and chicken https://t.co/1fwMhTGC5v"], ["chicken with apples", 17990397, "Important basis for any debate is a level playing field (or as we learn at school, compare apples with apples) Let's compare chemical additives in plants &amp; meat products. Let's compare nutritional value between plant-based products &amp; chicken nuggets. Otherwise point is irrelevant https://t.co/LbFjC2u2jN"], ["chicken with apples", 402213882, "Chicken Stew with Apples and Dried Apricots (Khoresh-e Morgh ba Seeb o Zardaloo) https://t.co/ChiL8j4hKE https://t.co/lRqV6G0yAF"], ["chicken with apples", 1222965985491275778, "Lemon 🍋 chicken, with mushrooms 🍄 and apples 🍎 on a bed of spinach. Potato 🥔 fans. https://t.co/oFPuJ89XxJ"], ["chicken with apples", 791598319759941633, "RT @StFaithsKitchen: Our regional dish today is Somerset Chicken from.....Somerset! This tasty dish is made with cider, mushrooms, apples a…"], ["chicken with apples", 2723924432, "Dinner last night was AMAZING! Baked organic gluten-free chicken cutlets, organic sweet potatoes and..the best part..shredded organic brussel sprouts with chopped apples and sun flower seeds in a homemade oil/honey… https://t.co/gAu8QwPeKX"], ["chicken with apples", 2405405501, "Nudges Soft Bakes with Chicken, Peanut Butter and Apples, 10 oz https://t.co/VmKibyT6Oh https://t.co/rz5C8v3MAP"], ["chicken with apples", 1122874420182376448, "What's cooking at Violet Springs!\nOnly the best of course! \nTeriyaki chicken, cilantro coconut rice and sugar snap peas. \nCrab cakes with red pepper aioli , potato pancakes and garlic green beans \nCider poached apples, with butter pecan ice cream! \nEat well #TrilogyLiving https://t.co/T4KpjUbtA6"], ["chicken with apples", 798541455308558336, "Our regional dish today is Somerset Chicken from.....Somerset! This tasty dish is made with cider, mushrooms, apples and topped with Cheddar Cheese @St_Faiths @ChartwellsInd #somerset #somersetchicken https://t.co/mejLilOILk"], ["chicken with apples", 76211817, "Cast Iron Whole Roasted Chicken with gala apples 🍎 &amp; collard greens 🥬 https://t.co/voRJP75rrq"], ["chicken with apples", 1186918593491066880, "@bipbopbap I'm hungry all the time lol\n\nToday I ate a bagel with 4 eggs and 4 sausages, 1 litre of milk, protein shake, a box of coconut macaroons, a bag of chocolate peanuts 3 apples a tuna mayo wrap, a chicken burrito and that entire bag of fried chicken, still hungry tho"], ["chicken with apples", 1052195248422576128, "maybe my stomach is just upset with me switching from a pretty good diet (compared to my usual eating habits) that was filled with regular meals consisting of salad, fruit, chicken breast, vegetables... to eating nothing but sandwiches, apples, noodle cups and pizza :/"], ["chicken with apples", 15801000, "@rachsyme This has been me with salads this winter! Apples, walnuts, cranberries, and crumbled blue cheese salad; marinated artichokes, marinated eggplant, pitted olives, and feta salad; buffalo chicken, avocado, and blue cheese dressing salad.\n\nBut oh do I love a good sandwich!"], ["chicken with apples", 1007118161345253376, "A BUTT ON MY IN THE SHAPE MAZDA PICKLE, PICKLE YOUR MY FRIENDS SAY SO. APPLES JUST LIKE YOUR FEET AND DOG POO. CHICKEN IN HOME HEALTH BELOW SIGNPOSTED OR TRANSIT HAVE HAD SOME UNDERWEAR RED WINE RACK POO SOUR CELERY DAY AT PONZI WE OF TOILET BRUSHES. FART DUMP WITH"], ["chicken with apples", 774694565848686593, "I’ve had 2 apples, a banana with peanut butter and some chicken 😔😔😔"], ["chicken with apples", 28234842, "@poliscibitches I'm a pretty traditional hire with no personal food restrictions, but at one of my interviews I ordered salad (it looked great, it had apples and beets), then deliberately ordered chicken on top to signal \"not vegetarian\"."], ["chicken with apples", 1138576810759794688, "Best case scenario meals currently:\n\nBreakfast: ice coffee and quinoa/oatmeal with blueberries or grapes.\n\nLunch: protein shake and Carby fruits (few bananas, apples)\n\nDinner: Chicken thighs and quinoa/brown rice\n\nSnacks: strawberries, nuts , oranges, peaches, nectarines."], ["chicken with apples", 70285539, "I’ve been so obsessed with fig butter.  I have been putting it on everything. New fav snack with cheese and apples.  Also - another current snack favorite celery sticks with chicken buffalo dip. Yes, I did get everything from Trader Joes.🤓"], ["chicken with apples", 501744148, "(Homemade Mackenzie River) Apple &amp; Chicken Bacon Flatbread: Brown sugar roasted Pink Lady apples and caramelized onions, topped with mozzarella, chicken, and hickory bacon.\n\nSo my good friend Nicole got this at… https://t.co/J7vVEdAu9H"], ["chicken with apples", 1105482757197553664, "Doing some meal prep for Larena. This way she can keep her energy up. The past 2 weeks have been kicking her ass because of the chemo and her body fighting as hard as it is. Doing chicken, with white rice and vegetables. Apples and grafefruit for dessert."], ["chicken with apples", 3113314233, "@FXMC1957 Had surgery in 2019. Eat nothing fried (no oils), or fat (dairy, yogurt, cheese). Before surgery I ate rice cooked in broth with chicken (also cooked in broth), bananas, apples, applesauce. Best wishes for a speedy resolution."], ["chicken with apples", 781318719872139264, "Puree the chestnuts and place it on(to) the chicken. Complete the dish by sprinkling parsley on(to) the side. Eat with apples."], ["chicken with apples", 829282508, "Post workout chicken salad! Packed with protein and veggies.\n#cleaneating #workout #mealprep #yummy #bf4l #apples #chicken #avocado https://t.co/uiKHIgglUQ"], ["chicken with apples", 1171976658204667904, "@lazyfreaks Eat anything light. Like bread, apples, eggs, chicken soup. Don't eat anything acidic it'll make it worse. Ginger Ale, Sprite, or Pepsi will always help with upset stomachs."], ["chicken with apples", 1021054939, "Happy Sunday!  Today’s special is a Stuffed French Toast with Chicken Apple Sausage and Brie. Topped with-Roasted Georgia Apples. #sunday #brunch #crookedtreecafe #marietta https://t.co/bg19D1C6WM https://t.co/kQN1ZjRnpU"], ["chicken with apples", 1709395921, "@TheNewEuropean 3 apples?!  That’s a bit weird. And all that protein!  We just don’t need it. Western humans with protein deficiency are very rare indeed. And besides, nuts are better protein than chicken because you get fibre too. 3 apples?!"], ["chicken with apples", 8753762, "Chicken cutlet, potato salad (with apples) and sauerkraut. I’m gonna sleep so good. https://t.co/KOfJiuUnn5"], ["chicken with apples", 211879251, "Menu 2/11-14. Mushroom Barley Soup. Basil-White Bean Salad.  Sandwiches: Veggie Banh Mi; Tuscan Tuna Salad; Grilled Chicken. Entrées: Honey-Lime Quinoa-Stuffed Sweet Potatoes; Greek Cod; Chicken + Garbanzos; Golden Beets &amp; Apples; Collards with Feta; Dilled Brown Rice &amp; Peas;"], ["chicken with apples", 144257495, "Cold and rainy again today. Trying a new recipe my kids asked for: Buffalo Chicken Casserole. The recipe they showed me has canned biscuits on top, but I'm replacing it with a homemade cornbread topping. Salad on the side. Apples with homemade caramel sauce for dessert.\n\nY'all?"], ["chicken with apples", 522807187, "dulce de Leche. I promptly pulled a bag of orzo out and shredded the chicken then added lots of olive oil and cup up an entire bag of apples to go with caramel. My mom brought a salad &amp; it was a simple feast! Glad they came over even last minute bec I got to watch my dad play"], ["chicken with apples", 23187600, "Grab a hot cup of Roos Roast coffee and shop with us this morning. we have greens, bread, kielbasa, bacon, chicken, soap, artwork, carrots, cider, apples, cheese, micro greens, and more. free parking in the market lot. https://t.co/o2LWuszwTA"], ["chicken with apples", 963007243821223936, "RT @HomesteadWish: This is a wonderful curried chicken soup with granny smith apples. It’s creamy and delicious! There’s nothing like a goo…"], ["chicken with apples", 2796026526, "RT @HomesteadWish: This is a wonderful curried chicken soup with granny smith apples. It’s creamy and delicious! There’s nothing like a goo…"], ["chicken with apples", 937977728, "This is a wonderful curried chicken soup with granny smith apples. It’s creamy and delicious! There’s nothing like a good curry soup on a cold winter’s day.  | #soup #curriedrecipes #curry #wintersoup\n\nhttps://t.co/3jF0pQixg0 https://t.co/8epMAa38Qy"], ["chicken with apples", 1895019776, "Whole Roasted Chicken with Sweet Potatoes, Fennel, and Apple \n\nIngredients\n2 cups shiitake mushrooms, cleaned and stemmed 2 medium sweet potatoes, cut into 1- to 2-inch cubes 2 large apples (such as Honeycrisp),… https://t.co/bAL6wujgUv"], ["chicken with apples", 772964444301209600, "Miles LOVES his Chicken &amp; Couscous. He knows about the real human grade chicken thigh meat that we use. What he doesn’t know is that it’s loaded with apples, spinach, carrots, and blueberries for optimum nutrition… https://t.co/uuUIG0Ju2U"], ["chicken with apples", 3207661133, "🌯 Curry Chicken Wrap 100% Organic 🌯 : All White Meat Chicken, Diced Grannysmith Apples, Celery, Spinach with Curried Sour Cream Dressing.\n\n.\n📸farmerspalette\n.\n.\n#Flavorism #myflavorism #wrap #sandwich #currychicken… https://t.co/35EQRnpWPX"], ["chicken with apples", 177199690, "@skedone ...and they won't let me back into the garden with berries from the plot or picked wild without paying chicken tax. Same with apples, just cut into quarters and dropped in. Proper layers pellets form the backbone of their diet of course but fresh fruit and veg are always a fave"], ["chicken with apples", 311444630, "@GurdeepAUHE @andyoakes What's wrong with apples on trains. Burgers or fried chicken completely unacceptable."], ["chicken with apples", 2181283395, "RT @ChapelHaven: Delicious dinners are possible! Last night for dinner, Jess made chicken breast with sautéed apples and cinnamon with a si…"], ["chicken with apples", 2468390273, "Chris Skogsberg , AP at Cherokee Bluff High.  I like chicken salad with lots of grapes and pecans... maybe apples... and a pinch of ginger!\n#forsythpln"], ["chicken with apples", 3453336916, "RT @cafe_wildcat: Lunch Menu for February 7th\nSpicy Chicken Tenders/Roll\nMickey's Cheese Pizza\nItalian Stuffed Shells\nAsian Orange Chicken…"], ["chicken with apples", 1019599412752986116, "RT @cafe_wildcat: Lunch Menu for February 7th\nSpicy Chicken Tenders/Roll\nMickey's Cheese Pizza\nItalian Stuffed Shells\nAsian Orange Chicken…"], ["chicken with apples", 372992840, "Dinner:\nTuna salad, chicken fried steak with cream gravy, smashed potatoes, corn, The Hawaiian, maple chile glazed pork loin, sweet potatoes, cinnamon chipotle sauteed apples, garden vegetable soup, chicken noodle soup, turkey reuben melt, cheese quesadilla"], ["chicken with apples", 1039153636381786112, "Lunch Menu for February 7th\nSpicy Chicken Tenders/Roll\nMickey's Cheese Pizza\nItalian Stuffed Shells\nAsian Orange Chicken with Rice\nPB&amp;J Munchable\nMixed Vegetables\nFresh Broccoli Bites\nPineapple\nCrisp Fresh Apples\nHomemade Apple Crisp"], ["chicken with apples", 1893500400, "RT @Cluckmuckcook: Fruity chicken #curry, with apples, banana and raisins in it. My dads original creation that I have cooked for years. A…"], ["chicken with apples", 544915886, "My job legit BBQ’d some briskets &amp; chicken with a whole mess of other food with our GM cooking it all... 🥺💞MBO is the bestest"], ["chicken with apples", 3253907130, "RT @slotworldcc: Betsy's Big Kitchen serves up delicious options for Lunch and Dinner like our Grilled Chicken &amp; Apple Salad. It features b…"], ["chicken with apples", 159763043, "Wtf 没知识也得有常识 right. Why would you wash the apples with soap before eating 🙄🙄🙄 how about washing chicken and meat with soap first then"], ["chicken with apples", 3018427337, "Delicious dinners are possible! Last night for dinner, Jess made chicken breast with sautéed apples and cinnamon with a side of Brussels sprouts. Jim made baked lemon pepper fish with brown rice and veggies. #gettingfit #wellness https://t.co/vXdp3O2zuF"], ["chicken with apples", 908883936918495232, "Creamy Ketchup layered with Shredded Chicken, smothered in a mound of Grandpa Smith Apples and Deez Nuts"], ["chicken with apples", 607077736, "Chicken stuffed with diced apples, chopped cranberries and shredded gouda! \n#fresh #chicken #castironcooking #icanteachyou https://t.co/oW6umN2GLw"], ["chicken with apples", 2182773505, "@McDonalds My 5 year old likes a plain cheeseburger kids meal with apples, fries and a sprite. Plus 4 piece chicken nuggets and a plain quarter pounder meal with a large chocolate shake and large fries. Plus two apple pies"], ["chicken with apples", 1604324834, "RT @Cluckmuckcook: Fruity chicken #curry, with apples, banana and raisins in it. My dads original creation that I have cooked for years. A…"], ["chicken with apples", 2562416193, "Fruity chicken #curry, with apples, banana and raisins in it. My dads original creation that I have cooked for years. A family fav and pretty healthy as it is a tomato base. https://t.co/ndDYSfXPZm"], ["chicken with apples", 156384483, "Sure, the world is a mess. But I just had a delicious salad with chicken and apples and a delightful poppyseed dressing.\nI took my kids to lunch. They're just happy to be eating healthy food and spending time with me.\nEnjoy the little things."], ["chicken with apples", 1332712909, "Bistro 61 - a four course chefs tasting; raw oysters with cocktail sauce, spring salad with cherry tomatoes walnuts and apples with a pear vinnegrette, herb roasted chicken with pan sauce over mushroom pilaf and… https://t.co/JXW91SNQ8M"]]