[["chicken with cilantro", 1976818399, "I love avocado tacos with cilantro shredded lettuce tomatoes chicken and sour cream with a little cheese sprinkled on the top 🥺😍"], ["chicken with cilantro", 279699171, "Slow Cooker Mexican Shredded Chicken with Cilantro Lime Rice https://t.co/tmh29Omt23"], ["chicken with cilantro", 12356582, "A trio of taco tastings. Shrimp taco with marinated cabbages and tropical salsa, Bahn mi taco with Vietnamese chicken with pickled vegetables, and the chimichurri steak taco with cilantro cream. #IceBarOrlando https://t.co/Nr1wFpaxt7"], ["chicken with cilantro", 1207706341114089472, "#Tb to this Indonesian chicken salad with cilantro, carrots, pineapple, peanuts,… https://t.co/4p8cmaBv7y https://t.co/pWsDCqWCnj"], ["chicken with cilantro", 951544214, "My first time making stuffed peppers- I went with shredded buffalo chicken breast, black beans, jalapeño, onion, and cilantro! Gonna drizzle with Mexican crema to finish it off! #faty @ 4 Forty Flagler https://t.co/lp71bFGXAG"], ["chicken with cilantro", 750057061300383744, "FRIDAYS are Street Taco Day ( Due to Popular Demand)‼️ $7.95🌮😍❤️\n1. STREET Tacos: Topped with red onions and cilantro.\n2. QUESADILLA Tacos: Asadero cheese two with chicken two with steak.\nStreet and Quesadilla tacos served with Whole Beans. ALL SPECIALS are limited. DINE IN … https://t.co/UR3CpteVLn"], ["chicken with cilantro", 112794611, "Today’s entree sized Vietnamese Chicken Salad is made with rice noodles, Sunworks Farm chicken, peppers, carrots, peas, cilantro, mixed greens, and a ginger lime vinaigrette- it is fresh, flavourful, and filling! #glutenfree #eatlocal #mardaloop #yycfood #yyceats #yyc #calgary https://t.co/XnwsfBcB9H"], ["chicken with cilantro", 1962026282, "I made some bomb chicken breast with cilantro pesto sauce today 🥴 proud of the way it came out"], ["chicken with cilantro", 18021820, "Tonight’s $5 dinner is an Austin favorite. We are cooking up Cuban Chicken or tofu simmered in a citrusy Cuban mojo sauce served with mango black bean salad and cilantro lime rice. All items made without gluten ingredients. https://t.co/c26zqj0OxX"], ["chicken with cilantro", 2282238205, "RT @TheTacoSlayers: Day 210: street sized grilled chicken tacos with a side of elote. Crammed on top of the tortilla and pollo is some red…"], ["chicken with cilantro", 52952771, "Do you have those days when you really want something fresh and tasty but you don’t have a ton of time on your hands?\n🥙\nI’ve got a fun new recipe that does just that! You’ve got to try these Orange Chicken Bowls With Cilantro Lime Rice this week!\n🍊\nI… https://t.co/4wlzGe2hAN https://t.co/bWfqfyXpxy"], ["chicken with cilantro", 816382951231365120, "Our food special today is: Chicken Curry Rice Bowl\nChicken breast, dry rubbed in our house curry rub, and slowed cooked. Served over brown rice, topped with tomato and cilantro.\nPerfect for this blustery day! https://t.co/1NUlBIk0sL"], ["chicken with cilantro", 52952771, "Do you have those days when you really want something fresh and tasty but you don’t have a ton of time on your hands?\n🥙\nI’ve got a fun new recipe that does just that! You’ve got to try these Orange Chicken Bowls With Cilantro Lime Rice this week!\n🍊\nI… https://t.co/4wlzGe2hAN https://t.co/JdnEw0zKuu"], ["chicken with cilantro", 253128789, "@stripey2121 I began eating them 2 years ago; they are satisfying. Orinally from Japan/Hawaii. A bown, a first layer of rice(I usually choose brown rice) then you can choose spicy or not, sea food or chicken, vegetables, etc. , I had one today with salmon, crabmeat, cilantro, cucumber, (next)"], ["chicken with cilantro", 923928022775840768, "Day 210: street sized grilled chicken tacos with a side of elote. Crammed on top of the tortilla and pollo is some red cabbage, onion, cilantro, cotija, and @yatescomedy 's hahahotsauce .....… https://t.co/5LGa7ChK2G"], ["chicken with cilantro", 544832240, "RT @StopSmackn: We don’t mind you being greedy, order a lamb chop on the side with our lemon butter grilled chicken, asparagus &amp; white cila…"], ["chicken with cilantro", 941821937243906048, "The Best of Two Worlds!! Cilantro marinated chicken breast tacos topped with Pico de Gallo and cilantro creme fraische. Pair with Chef’s sweet and sour Oriental chicken and shrimp soup over white rice!!!!! Available until 2 PM today! https://t.co/jOIkLGdB3D"], ["chicken with cilantro", 2762879243, "This Shredded Chicken Tacos recipe is so easy and requires NO COOKING! Warmed corn tortillas are loaded with juicy, shredded rotisserie chicken then topped with a cilantro coleslaw.  https://t.co/12uG8IPGBH via @Eats_Essentials"], ["chicken with cilantro", 2495102900, "RT @StopSmackn: We don’t mind you being greedy, order a lamb chop on the side with our lemon butter grilled chicken, asparagus &amp; white cila…"], ["chicken with cilantro", 240010599, "RT @StopSmackn: We don’t mind you being greedy, order a lamb chop on the side with our lemon butter grilled chicken, asparagus &amp; white cila…"], ["chicken with cilantro", 174920083, "RT @StopSmackn: We don’t mind you being greedy, order a lamb chop on the side with our lemon butter grilled chicken, asparagus &amp; white cila…"], ["chicken with cilantro", 1158789876004859905, "We don’t mind you being greedy, order a lamb chop on the side with our lemon butter grilled chicken, asparagus &amp; white cilantro rice! #StopSmackn 😋 https://t.co/olMtDrnpYa"], ["chicken with cilantro", 250713204, "A chimichanga filled with  chipotle chicken, queso chihuahua, black beans, cilantro, lettuce, raw onions, and salsa verde with mexican potatoes on the side"], ["chicken with cilantro", 233619397, "RT @MyChaos: This Southwest Grilled Chicken Salad recipe is light, healthy and fresh - full of vegetables and topped with warm spicy chicke…"], ["chicken with cilantro", 250713204, "3 tacos, each with  pulled chicken, queso chihuahua, lettuce, cilantro, and super hot taco sauce with a side of mexican potatoes"], ["chicken with cilantro", 250713204, "2 enchiladas stuffed with  chipotle chicken, queso fresco, black beans, cilantro, tomatoes, lettuce, and tex-mex chimichurri served with rice and beans"], ["chicken with cilantro", 250713204, "2 tacos, both with  chipotle chicken, queso blanco, raw onions, black beans, cilantro, lettuce, and salsa verde with a side of guacamole"], ["chicken with cilantro", 2646570144, "The fried chicken bao are just chicken fingers in bao buns with pickled onions and cilantro which seems too easy."], ["chicken with cilantro", 250713204, "2 enchiladas stuffed with  chipotle chicken, vegan cheddar, black beans, cilantro, raw onions, tomatoes, and chipotle crema served with a side of guacamole"], ["chicken with cilantro", 250713204, "A chimichanga with  pulled chicken, queso chihuahua, cilantro, raw onions, black beans, tomatoes, and Mango BBQ sauce served with rice and beans"], ["chicken with cilantro", 137062667, "RT @MyChaos: This Southwest Grilled Chicken Salad recipe is light, healthy and fresh - full of vegetables and topped with warm spicy chicke…"], ["chicken with cilantro", 1079219406155206656, "My dinner this evening is:\n\nChicken wraps with spinach ad tomato and a cilantro lime dressing along with some tortilla chips. \n\nBONE APPLE TEA! 😋✨ https://t.co/f6jacEbELZ"], ["chicken with cilantro", 250713204, "A burrito stuffed with  chipotle chicken, manchego, tomatoes, raw onions, cilantro, and tex-mex chimichurri served with a side of guacamole"], ["chicken with cilantro", 917056284024852480, "I made fish tacos for dinner tonight. (Hunny had chicken nuggets 😌) Grilled tilapis with cilantro lime seasoning and placed in flour tortilla with some cheeae and taco sauce. #ww #itrackbites @ Richmond, Virginia https://t.co/uSGQEUWDvV"], ["chicken with cilantro", 2794535653, "Spicy black bean,  wild rice and quinoa soup with chicken. Top with a dollop of plain yogurt to cool the spice a bit,  shredded cheddar,  avocado and cilantro. Diced tomatoes add yumminess. https://t.co/0NeXi8Qof9"], ["chicken with cilantro", 102673526, "RT @newwaveburritos: Snack attack! Tonight we have Sopes! Griddled corn cake with your choice of beef, chicken, or pork, refried beans, sal…"], ["chicken with cilantro", 1215476027448840193, "Grilled Cilantro Lime Chicken with Chunky Guacamole : ketorecipes https://t.co/tL7M2xjGoI https://t.co/ckeI2vNpmh"], ["chicken with cilantro", 86014484, "RT @marketofchoice: “On the Menu” this month is The Bon Bahn #sandwich. Made with lemongrass chicken, it's piled between a toasted demi bag…"], ["chicken with cilantro", 18064126, "“On the Menu” this month is The Bon Bahn #sandwich. Made with lemongrass chicken, it's piled between a toasted demi baguette with flavorful rice vinegar-pickled carrots and cucumbers, green onions, jalapeño and fresh cilantro, served with Sriracha mayo. Bahn Appetit! https://t.co/N5Ud0iRQ5F"], ["chicken with cilantro", 2895862134, "Snack attack! Tonight we have Sopes! Griddled corn cake with your choice of beef, chicken, or pork, refried beans, salsa verde, cilantro, lettuce, and sour cream! We’ve also got Hopslam in cans and you can get BOTH delivered to your door! https://t.co/sby93CsuXd"], ["chicken with cilantro", 250713204, "A quesadilla with  chipotle chicken, manchego, cilantro, tomatoes, black beans, raw onions, and tex-mex chimichurri with a side of mexican slaw"], ["chicken with cilantro", 3816931272, "Cilantro Lime Chicken with Black Beans and Peppers and Brown Rice! https://t.co/ynQujpfysB https://t.co/IrmYgTdhY2"], ["chicken with cilantro", 64789066, "RT @MyChaos: This Southwest Grilled Chicken Salad recipe is light, healthy and fresh - full of vegetables and topped with warm spicy chicke…"], ["chicken with cilantro", 8792802, "This Southwest Grilled Chicken Salad recipe is light, healthy and fresh - full of vegetables and topped with warm spicy chicken, avocado and a creamy cilantro dressing. YUM! https://t.co/UBZPCXENic https://t.co/DA9mcau3cS"], ["chicken with cilantro", 372992840, "Dinner;\nGreek chicken wrap, General Tso's chicken, white rice, steamed broccoli, Korean stir-fried vegetables with tofu, antipasto pizza with turkey ham, cilantro lime chicken thigh, cilantro lime rice, spinach with garlic &amp; onions, Cajun chicken bisque, garden vegetable soup"], ["chicken with cilantro", 250713204, "2 enchiladas, each with  chipotle chicken, oaxaca cheese, raw onions, tomatoes, lettuce, cilantro, and spicy mole sauce with a side of rice and beans"], ["chicken with cilantro", 250713204, "A torta filled with  chipotle chicken, manchego, cilantro, raw onions, lettuce, tomatoes, and  sweet pinapple salsa with a side of mexican potatoes"], ["chicken with cilantro", 960738171561549824, "Looking forward to the summer already when I can remake this fantastic sandwich, Peruvian grilled chicken with roasted jalapeno cilantro sauce and pickled red onions. You can find the recipe on my blog and start planning out your summer https://t.co/jG2rO5zxat https://t.co/ufn5KMP8wS"], ["chicken with cilantro", 702173368716382209, "We're taking fajitas to the next level with our February Pizza of the Month! It's our Chicken Fajita Pizza! \n\nSpecial red sauce, mozzarella &amp; pepper jack cheese, onions &amp; bell peppers, and seasoned chicken all finished with a cilantro sour cream and topped with fresh cilantro! https://t.co/qwfrYg5QWh"], ["chicken with cilantro", 169975493, "We have #khaosoi today! One-of-a-kind Northern Thai style curry with egg noodles topped with aromatic chicken in a coconut cream sauce made of roasted herbs and spices including golden turmeric topped with crispy noodles, pickled mustard greens, crispy shallots, and cilantro. https://t.co/iKVSK4Bj69"], ["chicken with cilantro", 3875669652, "SHROOM Burger 🍄 Double PepperJack &amp; Swiss Burger with Bacon, sautéed shiitakes, pickle, onion, and mayo.\nhttps://t.co/ttnKTBOiH7\nSTIR CRAZY Burrito 😜 smoked &amp; pulled chicken with stir fry veggies, ginger rice, cilantro, and teriyaki sauce wrapped in a flour tortilla. https://t.co/UU2xeHtqCY"], ["chicken with cilantro", 20275912, "Aria’s Enchi-Holla Special is back in Oakland and Berkeley! Free range chicken marinated in green enchilada sauce, corn, cilantro, black olives, Monterey Jack and cheddar cheese, topped with a swirl of sour cream. Comes stuffed or thin &amp; a veggie option is available! 🍕🤗 #holla https://t.co/mkblJvj7wB"], ["chicken with cilantro", 1136708597549850624, "$7.99 Burrito Wednesday Large flour tortilla stuffed with your choice of meat (Chicken, Carnitas, Al Pastor) refried beans, Mexican rice, lettuce, onion, cilantro. Topped with green tomatillo salsa, melted Monterrey Jack cheese. Served with guacamole, fresh Pico de Gallo &amp; drink. https://t.co/hanxGKVQlS"], ["chicken with cilantro", 250713204, "2 enchiladas, each with  chipotle chicken, oaxaca cheese, raw onions, tomatoes, cilantro, black beans, and  sweet pinapple salsa plated with mexican corn salad"], ["chicken with cilantro", 1057671301081587713, "RT @DansBarNewTrier: SMILE! The ☀️ is shining and we got 🌮🌮🌮 out here today!\nRoasted Chicken Taco Trio with slow roasted chicken topped wit…"], ["chicken with cilantro", 1029219494, "@TheHappyPriest 1 cup uncooked quinoa\n1 bag frozen sweet corn\n1 bunch cilantro\n1/2 red onion\n1 bunch green onions\n1 jalapeño\nOptional: 1 bell pepper\n2 fresh limes\n2 tbsp Olive oil\nSalt &amp; pepper\n\nCook quinoa, chop everything else, mix together, and serve cold with chicken or tortilla chips"], ["chicken with cilantro", 707318616321073152, "@adorkabanned Cook and shred.  Heat a little oil in a non stick skillet.  Todd in a tortilla. Fill half the tortilla with chicken, sweet baby rays, diced red onion, cilantro, cheese, lime juice and either pineapple or mango small chunks. Fold tortilla and cover.  Flip tortillla after a few."], ["chicken with cilantro", 3003936999, "SMILE! The ☀️ is shining and we got 🌮🌮🌮 out here today!\nRoasted Chicken Taco Trio with slow roasted chicken topped with house salsa verde, radish, onion, cilantro and cojita cheese! Come and get 'em! https://t.co/DGwKHwS4dM"], ["chicken with cilantro", 91162962, "@TheHappyPriest Also- chicken tacos \nSkinless chicken thighs diced really small like you would celery. Sprinkle generously with taco seasoning. Use non stick skillet and a little cooking spray. Cook until well done. Don’t add salt! \nUse whole wheat tortillas and fresh salsa, cilantro, etc"], ["chicken with cilantro", 562610261, "Wednesday Special \nChicken in Arbol Sauce \n\nChicken simmered in spicy arbol salsa, served over rice, topped with cilantro and sour cream. Tortillas available upon request"], ["chicken with cilantro", 250713204, "A chimichanga filled with  chipotle chicken, smoked cheddar, cilantro, tomatoes, lettuce, black beans, and  sweet pinapple salsa served with rice and beans"], ["chicken with cilantro", 425412082, "Today's #lunch special is Vietnamese Congee - Traditional rice porridge with choice of chicken or tofu served topped with crispy roasted shallot and fresh cilantro and a side of goi (traditional Vietnamese slaw) #vegan option #glutenfree https://t.co/JNJA0CmyMI #bamboozlecafe https://t.co/wNQ4hmvEor"], ["chicken with cilantro", 250713204, "A quesadilla with  pulled chicken, smoked cheddar, cilantro, raw onions, black beans, tomatoes, and  sweet pinapple salsa served with mexican slaw"], ["chicken with cilantro", 250713204, "A chimichanga with  pulled chicken, manchego, black beans, lettuce, cilantro, and cilantro-lime aioli with a side of guacamole"], ["chicken with cilantro", 1397507671, "Thanks to KaleMeKatie_ for this delicious sandwich with our Greek Lifestyle Flatbread: grilled chicken, cherry tomatoes, avocado, cilantro, red onion &amp; sriracha. Learn more about Greek Lifestyle, which has 15 GRAMS OF PROTEIN! 💪 https://t.co/9W5NFXW0mg\n📸: KaleMeKatie_ https://t.co/t3usJov8tT"], ["chicken with cilantro", 934909851955748865, "RT @JULMOT94: 😊Easy Chicken Fajita Rice Bowls made in ONE PAN!\n\nIt’s made with tender brown rice, lean protein-rich chicken, mildly sweet b…"], ["chicken with cilantro", 250713204, "A quesadilla with  chipotle chicken, oaxaca cheese, tomatoes, cilantro, lettuce, black beans, and cilantro-lime aioli plated with mexican corn salad"], ["chicken with cilantro", 2192802140, "This Shredded Chicken Tacos recipe is so easy and requires NO COOKING! Warmed corn tortillas are loaded with juicy, shredded rotisserie chicken then topped with a cilantro coleslaw.  https://t.co/BwldQ7DnRk via @Eats_Essentials"], ["chicken with cilantro", 239287214, "Crispy Baked Chicken Wings on a Platter on the White Background.... https://t.co/WhcmNtaC2H https://t.co/hBCicEuUXC"], ["chicken with cilantro", 859187854530007041, "Have you tried our delicious Chief Rolón Bowl yet? Made with Roasted Chicken, Jasmine Rice, Black Beans, Mixed Greens, Guacamole, Baked Plantains, topped w/ Cilantro and our Chimichurri Sauce\n.\n.\n.\n\n#orlandofoodie… https://t.co/dVmtfwTYvp"], ["chicken with cilantro", 250713204, "A chimichanga filled with  chipotle chicken, cotija cheese, cilantro, tomatoes, raw onions, lettuce, and Mango BBQ sauce with a side of rice and beans"], ["chicken with cilantro", 262082841, "Come to ITT today to receive your $1.00 off coupon for today's lunch special at the Stukeley Inn.  Today's lunch special is Chipotle style carnitas with either pork or shredded chicken served with cilantro and lime, along with Spanish rice.  Lunch is from 11am to 1pm. https://t.co/gCLMIaKUTP"], ["chicken with cilantro", 250713204, "2 enchiladas stuffed with  pulled chicken, queso fresco, black beans, raw onions, lettuce, cilantro, and super hot taco sauce with a side of guacamole"], ["chicken with cilantro", 221652786, "I accidentally bought two bunches of parsley at the store instead of getting cilantro bc a person was standing right in front of the herbs loudly arguing on the phone with someone and I hate conflict\n\nI would like a moment of silence for my Cuban chicken tomorrow 😔"], ["chicken with cilantro", 2884312712, "Some of my fav things I’ve made\n-beef fajitas with roasted pepper cilantro cream sauce\n-loaded avocado toast\n-chicken lettuce wraps\n-red curry chicken tacos https://t.co/gSDmXA0Nu1"]]