[["chicken saag", 3314791911, "Only a couple more days to have a #CurryandChaat at one of the cafes this week. Today we are serving curry specials in the hope of raising money for @MentalHealth. Try Drake's chicken tikka masala or masoor dhal for lunch or Portland's saag aloo and onion bhaji #pizza.😋@PlymUni https://t.co/URufYfbv6e"], ["chicken saag", 197448979, "Now this is a chicken saag you simply have to make. So good and good for your too. https://t.co/wSTFqmdqsq https://t.co/pfdYVWVP31"], ["chicken saag", 1227651760812019712, "RT @KhanaKhazana: Sarson Saag Chicken - Sarson ka saag, typically a favourite from Punjab, gets its non-vegetarian version! Try it with #Ga…"], ["chicken saag", 907211025564553216, "@LongTallPaulG @Almo27102318 I do tonight. Just had the left over curry, saag aloo, chicken saag, keema peas."], ["chicken saag", 7693002, "@ryanknott \"reasonable\" is a construct. Plus you have chicken saag in the fridge."], ["chicken saag", 816550267, "I have been secretly going to a different Indian restaurant 5x a week for 2 and a half weeks in search of the best chicken tika masala and saag paneer on the westside. Ive ordered those same two dishes everywhere. I have not yet found the best but I think I am getting close...!"], ["chicken saag", 360002161, "Ok ok this is actually Nepalese food but pretty similar. \n\nJust mixed in a lamb curry, a chicken appetizer, and saag paneer into one pot. Verdict: somehow more delicious than at the restaurant! https://t.co/94IOv6Vho1"], ["chicken saag", 148386845, "Butter chicken and saag paneer pizzas are coming to Tufnell Park with 50% off TOMORROW https://t.co/it2928mnAq https://t.co/3zC1zhgzS3"], ["chicken saag", 29094252, "@SikhProf @vchhibber I made saag, korma, and makhani; chicken adobo; and drunken noodles all in the past week.\n\nI am so grateful for all the immigrant-Americans who share their cuisine!❤️🌏"], ["chicken saag", 44422581, "RT @LeftIsRightInNE: Over the past week, I have made chicken makhani, saag, and korma (Indian); chicken adobo (Filipino); and drunken noodl…"], ["chicken saag", 29094252, "Over the past week, I have made chicken makhani, saag, and korma (Indian); chicken adobo (Filipino); and drunken noodles (Thai).\n\nNot bad for a white mom in Nebraska. \n\n(My kids had Mac and cheese for supper)."], ["chicken saag", 302208122, "Chicken saag is really top 5 one of my fave dishes"], ["chicken saag", 766286160, "@TamMannKler @revjoeybside I am incredibly excited to be asked this.\nStarter: chicken pakoras with all the sauces\nMain: lamb rogan Josh, mushroom rice\nSides: onion bhajis, poppadoms with mango chutney, mint onions and spicy red sauce, saag aloo if we’re feeling fancy.\nDrink: we’re having a ruby so lager🍻"], ["chicken saag", 3124213594, "Microwaved me chicken saag in the office for dinner and you can smell it up the stairs, in the loo and from outside🙂🙂"], ["chicken saag", 894271620226961408, "RT @PeteBrissenden: Weather is properly grim. Luckily, all I’ve got to do today is light the fire, make a massive batch of chicken curry, s…"], ["chicken saag", 1340055920, "@biologistimo Chicken karahi, saag, mutton quorma, rice, chapati. Looking very tasty 😋 and spicy 🌶. Hope fully you enjoyed this weekend."], ["chicken saag", 80549721, "@oGototheS And very tasty. Goes lovely with the chicken saag"], ["chicken saag", 255194500, "Sunday tea.\n\nHomemade glazed chicken\nHonemade mashed potato\nHomemade saag bhaji\nHomemade aubergine fritters.\n\nNot bad at all. https://t.co/DjeYCP2t7j"], ["chicken saag", 44110903, "While we wait for #DelhiAssemblyElections result, here’s the pecking order for leftover food: 1. Chinese 2. Butter chicken/Dal Makhani/Saag/sambhar 3. 🍕"], ["chicken saag", 567450630, "RT @PeteBrissenden: Weather is properly grim. Luckily, all I’ve got to do today is light the fire, make a massive batch of chicken curry, s…"], ["chicken saag", 45165432, "Weather is properly grim. Luckily, all I’ve got to do today is light the fire, make a massive batch of chicken curry, some naan breads and saag paneer. I will then consume as much curry as possible in front of aforementioned fire."], ["chicken saag", 946595893490470919, "Took the Goth King to an Indian cooking class 🥘☠️🖤 we learned how to make samosas, saag paneer, fish curry, chicken tikka masala &amp; rice, dirty chai martinis &amp; MANGO SORBET 🥭 @ Hipcooks Portland https://t.co/HcCYcMXgQW"], ["chicken saag", 583017489, "I also love a well made saag chicken dish"], ["chicken saag", 29094252, "I need some help, friends. \n\nI’ve been fighting off a bad cold for the past 2  weeks and the only thing that makes me feel good are homemade “curry” sauces, specifically, butter chicken, saag, and korma which I made for the first time this week. \n\nIs “curries” the right term?"], ["chicken saag", 968124242654056450, "RT @ScranAcademy: Exploring cultures as well as cuisine today! Chicken Korma, Lentil Dahl, Saag Paneer, naans and rice. Impressive and deli…"], ["chicken saag", 1160145820739657731, "Mrs cooked a v tasty tea tonight Saag Masala and Butter chicken, the kitchen still smells amazing from all the spices."], ["chicken saag", 48296092, "I am a Punjabi and I don’t have relatives in Punjab. Nor can I speak Punjabi (can only understand) 🤷‍♀️\nAlso I don’t like Chicken, Makke ki roti &amp; sarso ka saag. https://t.co/qNc2zPRfG8"], ["chicken saag", 473012759, "@gauravpramanik Do you know what's weird? I had chicken with lai saag like YESTERDAY. Not pork, CHICKEN with lai saag! :O"], ["chicken saag", 749443986478227457, "@sumiandnoir @ebruenig chicken saag is a spinach curry and it whips ass, saag aloo is spinach and potatoes, also in ass whipping territory. jalfrezi is a curry that's all about the peppers. does it whip ass? you'd better believe it."], ["chicken saag", 862812617173340160, "RT @ScranAcademy: Exploring cultures as well as cuisine today! Chicken Korma, Lentil Dahl, Saag Paneer, naans and rice. Impressive and deli…"], ["chicken saag", 144950444, "@gauravpramanik I love saag wala chicken...\n\nI had Delhi's favourite Rajma Chawal 😍"], ["chicken saag", 1619546252, "RT @SanjeevKapoor: Sarson Saag Chicken - Sarson ka saag, typically a favourite from Punjab, gets its non-vegetarian version! Try it with #G…"], ["chicken saag", 36427373, "I made chicken with mustard greens (raai ko saag) today. It is usually made with pork but the grandmother doesn’t eat pork so I replaced it with chicken. What are y’all eating? https://t.co/CXo9WEUgGO"], ["chicken saag", 148386845, "Butter chicken and saag paneer pizzas are coming to Tufnell Park https://t.co/it2928mnAq https://t.co/rDgCPeGF2E"], ["chicken saag", 717709427713970176, "So the other day mum cooked nali fata with gual mass and nali saag, this made me realise how these types of Bangali dishes will cease to exist (outside of BD) bc how many of you coconuts eat this type of Bengali food? All you lot know is aloo with meat and chicken curry 🙄 sad"], ["chicken saag", 20822604, "RT @ScranAcademy: Exploring cultures as well as cuisine today! Chicken Korma, Lentil Dahl, Saag Paneer, naans and rice. Impressive and deli…"], ["chicken saag", 862812617173340160, "Exploring cultures as well as cuisine today! Chicken Korma, Lentil Dahl, Saag Paneer, naans and rice. Impressive and delicious #dyw https://t.co/rGX7GmUqVJ"], ["chicken saag", 2231061848, "RT @SanjeevKapoor: Sarson Saag Chicken - Sarson ka saag, typically a favourite from Punjab, gets its non-vegetarian version! Try it with #G…"], ["chicken saag", 1584453378, "RT @SanjeevKapoor: Sarson Saag Chicken - Sarson ka saag, typically a favourite from Punjab, gets its non-vegetarian version! Try it with #G…"], ["chicken saag", 56363343, "Sarson Saag Chicken - Sarson ka saag, typically a favourite from Punjab, gets its non-vegetarian version! Try it with #GarmaGaram makki di roti, a dollop of desi makkhan &amp; you're in for a heavenly bliss!\n\nRecipe Link:https://t.co/8NL8qI71Fp\n#WhatsInSeason https://t.co/2W9aB4piXT"], ["chicken saag", 413055374, "Sarson Saag Chicken - Sarson ka saag, typically a favourite from Punjab, gets its non-vegetarian version! Try it with #GarmaGaram makki di roti, a dollop of desi makkhan &amp; you're in for a heavenly bliss! \nRecipe Link:https://t.co/93uHEE3eQY #WhatsInSeason https://t.co/ygrMLTGid9"], ["chicken saag", 2878497576, "RT @gauravpramanik: Lunch today was: gobi mattar, raai ko saag ra jara (mustard greens and squash or chowchow roots), chicken cooked in bot…"], ["chicken saag", 770994735766962176, "Join us and @CornellDining for Rose House Dinner tonight featuring Potato &amp; Chickpea Red Curry, Chicken Butter Masala, Turmeric Rice, Saag Paneer, and Stir-Fry Green Beans! #housedinner #rosehouse #westcampus https://t.co/w52iCve9vy"], ["chicken saag", 249912717, "@kenzroams if im gonna drive to jersey to go to aldis i might as well just drive .2 miles from my house to pick up the chicken tikka saag lol might have to go get it soon"], ["chicken saag", 37449155, "This slow cooker chicken saag curry is delicious, frugal and flavoursome: https://t.co/gN6c1uqQjT"], ["chicken saag", 36427373, "Lunch today was: gobi mattar, raai ko saag ra jara (mustard greens and squash or chowchow roots), chicken cooked in bottled Schezwan chutney (yes, Ching’s) and churpi ra mula ko achchar. What are y’all eating? https://t.co/OiCjrgMQPB"]]