[["chicken and onions", 297732100, "Gonna bake some chicken thighs then shred them off the bone and then fry it and make fried chicken Texas melts with onions and tomatoes and cheese."], ["chicken and onions", 16477189, "@TheseDeadPens Vegetables are acceptable but not required (apart from onions and red peppers, which are mandatory)\nAlso honorable food mentions to bbq venison, chicken fried rice, and anything with garlic and cheese"], ["chicken and onions", 86014484, "RT @marketofchoice: “On the Menu” this month is The Bon Bahn #sandwich. Made with lemongrass chicken, it's piled between a toasted demi bag…"], ["chicken and onions", 22269052, "@_juLiebean Pinterest! A little tomato/chicken broth base with sautéed onions, ground beef and garlic. Italian seasonings and lasagna noodles broken up! Smells so good! Top with ricotta and parm cheese for excellence!"], ["chicken and onions", 1212618982785605632, "Improvised this pizza, and I think I stumbled upon something special: \n\ncarmelized onions, burst cherry tomatoes, chicken Italian sausage crumbles, &amp; wilted spinach https://t.co/fpHXjL4TgZ"], ["chicken and onions", 836733337532248068, "@canoegirrl $67 on fast food? Holy crap.\nYa but when you're on a limited budget, $3 for a pepper adds up. Cauliflower is $5 to $6. Carrots, potatoes and onions are about it. Even celery is stupid expensive. For me, a good stirfry is easily $8 - 10 before I add chicken. Mostly I eat frozen"], ["chicken and onions", 117558070, "@LoveHomeEc @DietitianGen What about a Chicken arrabbiata 3 tbsp olive oil, 2 onions chopped , garlic\n\n2 red chillies deseeded and sliced\n\n600g tomato finely chopped\n\n3 tbsp tomato purée\n\n2 tsp chopped thyme\n\n6 skinless chicken legs\n\npasta or mash to serve ?"], ["chicken and onions", 18064126, "“On the Menu” this month is The Bon Bahn #sandwich. Made with lemongrass chicken, it's piled between a toasted demi baguette with flavorful rice vinegar-pickled carrots and cucumbers, green onions, jalapeño and fresh cilantro, served with Sriracha mayo. Bahn Appetit! https://t.co/N5Ud0iRQ5F"], ["chicken and onions", 250713204, "A quesadilla with  chipotle chicken, manchego, cilantro, tomatoes, black beans, raw onions, and tex-mex chimichurri with a side of mexican slaw"], ["chicken and onions", 1291880382, "@Wawa I never had a problem with Wawa portions, but this is embarrassing! A chicken salad with 1/2 the amount that I normally got in the past! You gave me a shorty amount of chicken salad on a classic roll. There were more tomatoes and onions on it then chicken salad. https://t.co/VwGu4w8oLy"], ["chicken and onions", 795478112733659136, "[homemade] Chicken with grilled onions and loaded baked potatoes https://t.co/GcOMrqvSWo https://t.co/gKnN0zgTyT"], ["chicken and onions", 1221881394462367749, "I made this sandwich with chicken and called it 'Wow kaka  Happy Peanut Meal' because it has brie and onions between slices of peanut white bread."], ["chicken and onions", 1461564697, "@MrGoodBeard__ If you don’t like the taste of Hennessy you probably also don’t like onions or mushrooms, and chicken tenders are your go-to at any restaurant"], ["chicken and onions", 242959386, "Even tho I burned my onions and forgot to season my peppers bc I was on a business call while I was cooking my stew chicken came out good"], ["chicken and onions", 1222295268714012672, "@DeservesTheBest She knows he likes meat.  Meat.  Meat, and more meat.  But Blisse has sent up other foods, too.  She likes roasted chicken and bread on a plate for him, and fills a bowl with vegetables, too.\nShe'll see if she can persuade him to eat any.  The roasted potatoes and onions and-"], ["chicken and onions", 473383603, "@FrMatthewLC @TheHappyPriest Italian sausage, potatoes, and spinach soup. Brown the sausage, set aside. Sauté onions, garlic, add the sausage back and chicken stock and chopped potatoes, spinach at the end. Add heavy cream to taste (1/2 cup). Italian seasoning, salt, pepper, parm cheese on top. Yummy."], ["chicken and onions", 884687161, "@Whataburger Your Chicken Fajita Tacos are the bomb! 🌯💣 Will you please make a Beef Fajita Taco with sliced beef patties, grilled peppers and onions, cheese, and a side a jalapeño ranch? I will sell a kidney to taste this in my mouth! Pretty Prease 🙏🏼👼🏻 #Dallas #foodie #tacos"], ["chicken and onions", 1219560498330578944, "I made this roast with chicken Tikka and called it 'Maharaja's Emperor' because it also has red onions on Thai Chili sauce."], ["chicken and onions", 62936841, "For lunch: Ichiban ramen with leftover chicken, scrambled eggs, and green onions. https://t.co/EPfIdBTMqG"], ["chicken and onions", 197131674, "Maui Wowie Chicken Cheesesteak!!!@LooseChangeCU Marinated grilled chicken, caramelized onions, pineapple, teriyaki sauce and melted Swiss on a toasted sub roll!! Served with your choice of hand cut fries or pub chips!! https://t.co/NwbxhriqUz"], ["chicken and onions", 3133525156, "@cee4cat @jimnarlene @scarycath @Grouse_Beater @HearachBets @mrjamesob I haven't made it in yonks but used slowly cooked white onions until very soft, chicken stock, cheese, blitz together. I do a nice roasted tomato and Feta soup, the blue would probably work quite well in that as a substitute for Feta"], ["chicken and onions", 250713204, "A torta filled with  chipotle chicken, manchego, cilantro, raw onions, lettuce, tomatoes, and  sweet pinapple salsa with a side of mexican potatoes"], ["chicken and onions", 960738171561549824, "Looking forward to the summer already when I can remake this fantastic sandwich, Peruvian grilled chicken with roasted jalapeno cilantro sauce and pickled red onions. You can find the recipe on my blog and start planning out your summer https://t.co/jG2rO5zxat https://t.co/ufn5KMP8wS"], ["chicken and onions", 955366241870413824, "@AthleticArriola Some spicy chicken with peppers, chilies and onions. Gonna throw in some spinach a little later too"], ["chicken and onions", 1046880796336906240, "@iNabber69 They had to get a G from somewhere. What else could be a substitute G lettered ingredient? (Grilled Chicken? Green onions? Garlic Sausage? All these seem too boring for a rainbow deluxe \"look-at-me\" ingredient sandwich. This needs to be hip and cool with the youth of today.)"], ["chicken and onions", 250713204, "2 enchiladas, each with  chipotle chicken, oaxaca cheese, raw onions, tomatoes, cilantro, black beans, and  sweet pinapple salsa plated with mexican corn salad"], ["chicken and onions", 356468763, "MSU puts onions in way too many food items that don’t need them (I.e their chicken nggets????) and as someone who is allergic to onions I am not a fan"], ["chicken and onions", 1029219494, "@TheHappyPriest 1 cup uncooked quinoa\n1 bag frozen sweet corn\n1 bunch cilantro\n1/2 red onion\n1 bunch green onions\n1 jalapeño\nOptional: 1 bell pepper\n2 fresh limes\n2 tbsp Olive oil\nSalt &amp; pepper\n\nCook quinoa, chop everything else, mix together, and serve cold with chicken or tortilla chips"], ["chicken and onions", 107090979, "RT @BigEasyLondon: This isn't just your average chicken sandwich... this is our Bird in a Bun 🐔🐔 Smoked BBQ pulled chicken, piled high and…"]]