[["chicken and lime soup", 1161379834045632512, "@footyv11 these girlies are SO slept on.... the left is khao piak a.k.a. pho and chicken noodle soup’s laotian lovechild, the one on the right is nam khao, a crunchy coconut-lime rice salad🥵🥵"], ["chicken and lime soup", 324113286, "Almost Vegan Coconut Gorbanzo bean sweet potato and Kale Soup.\n\nGarlic \nGinger \nOnion\nSaute with olive oil\nAdd Beans \nChicken stock and coconut milk\nAdd Tumeric\nSweet potato \nKale\nSeason with salt and pepper\nLime… https://t.co/2Bzff61G4d"], ["chicken and lime soup", 2842012786, "#homemade Masala #khichdi - apparently this is equivalent to chicken noodle soup when you are sick. In India you can only eat this while sick, and it's frowned upon if you make this for guest. It's so flavorful, and healthy! Also my first time eating lime rinds, caradmon pod… https://t.co/YvkN1lohCN"], ["chicken and lime soup", 2451874951, "Need dinner inspiration? This lime and chicken soup with avocado is delicious and heart healthy. Get the recipe at https://t.co/dre1OTtjju. https://t.co/ufIl481z9w"], ["chicken and lime soup", 1102189049337597953, "@bonnishka My author likes chicken-and-onion soup. From a bird, not a powder; the skin and bones contain a lot of nutrients.\nBonus points: Fry up the onions with sambal badjak and kaffer lime leaves before adding the chicken and water. \nThen serve in a bowl with cooked rice and a boiled egg"], ["chicken and lime soup", 1163718425048317952, "RT @cleaneatscarrie: This @InstantPot Coconut Chicken recipe is a 30-minute meal with only six ingredients: chicken, onion, celery, coconut…"], ["chicken and lime soup", 2310195481, "Need a bonafide, soul warming, bowl of amazing-ness to melt the snow off?! Get in the ZONE for our chicken and white bean tortilla soup! Topped with our tortilla strips, cilantro and served with lime wedges, pickled… https://t.co/zt5Szhs4yj"], ["chicken and lime soup", 963007243821223936, "RT @TomYamThai: Tom Yam Gai - #Thai hot and sour chicken #soup with mushroom, tomato, coriander, chilli, lemongrass and lime leaves.\nhttps:…"], ["chicken and lime soup", 1530406644, "Tom Yam Gai - #Thai hot and sour chicken #soup with mushroom, tomato, coriander, chilli, lemongrass and lime leaves.\nhttps://t.co/20FJys7Jgz 01625 879577\n#Poynton #Stockport #Cheshire #Thaifood https://t.co/izSpTES9V2"], ["chicken and lime soup", 120620364, "This @InstantPot Coconut Chicken recipe is a 30-minute meal with only six ingredients: chicken, onion, celery, coconut milk, lime juice, and broth! It’s a low-carb, healthy meal that everyone will love. 🥥😋 https://t.co/PfcIe9TW51 https://t.co/sq8GMPbUPA"], ["chicken and lime soup", 24198697, "TUESDAY LUNCH SPECIALS\nSOUP- Chicken tortilla. Topped with lime sour cream and tortilla strips\nVEGGIE- Broccoli\nSANDWICH- Crispy chicken sandwich\nFLATBREAD- Blackened Chicken"], ["chicken and lime soup", 41065173, "@azhamv @sherrierd @fareezkd Worth the trip, all ginger goodness, chilli sauce has the chicken stock and lime zest, rice is toasted in chicken fat, quality steamed chicken, soup is solid. Its the chicken rice mum's make with love, fat and not so much salt."], ["chicken and lime soup", 59820775, "@revoluchine Tom saeb - Isaan style sour and spicy soup.\nEasy version is kampong chicken boiled with lemongrass, kaffir lime leaves, green chilli, red onion, lime juice."], ["chicken and lime soup", 1005989639465906176, "Arroz Caldo. #filipino rice congee. Lots of fish sauce, garlic and lime juice. Topped w/ fried shallot, garlic, and green onion\nVia @seriouseats\nhttps://t.co/0EqXYhFcev https://t.co/ZZ23GdbMtW"], ["chicken and lime soup", 22042587, "@xsunbather Water. Lemon tea. A lot of sleep. Chicken soup or broth and a lot of lime. Hot showers."], ["chicken and lime soup", 172477667, "Monday, February 10:\n\nHOT BAR: Balsamic Chicken; Balsamic Tofu; Lime Cilantro Rice; A Cheesy Situation; Maple &amp; Brown Sugar Brussels Sprouts\n\nSOUP: Lentil; Carrot Ginger\n\nDon’t forget about our salad bar, deli case and bakery items! https://t.co/dgKY69zU52"], ["chicken and lime soup", 70815689, "Tonight's foods:\n\nCorn and potato soup\nMole chicken (thanks @MeganAmyH) with cilantro lime rice\nBuffalo chicken mac and cheese\n\n#JamJamsKitchen"], ["chicken and lime soup", 2922001066, "A wonderfully warming Thai chicken noodle, aroma soup, with crushed roasted cashew nuts, lime, chilli and fragrant spices is a must try noodle recipe. Perfect for a cold, winter and wet day like today. Hope you all… https://t.co/GpzFcNvozd"], ["chicken and lime soup", 777794322880077824, "RT @NateJamesMMA: Chicken tortilla soup with queso fresco and lime @SunBasketMeals \n#sunbasket #glutenfree #organicfood https://t.co/9NJmIw…"], ["chicken and lime soup", 24940115, "Chicken tortilla soup with queso fresco and lime @SunBasketMeals \n#sunbasket #glutenfree #organicfood https://t.co/9NJmIwus1o"], ["chicken and lime soup", 886807980, "@EvanAKilgore 1 shot tequila followed by one shot pure lime juice and a diet of green chile chicken soup."], ["chicken and lime soup", 1134698984365105157, "@EvanAKilgore Home made chicken soup with juice of half a lime, lots of water, and rest!"], ["chicken and lime soup", 2430580252, "@Kingbraswell I hope you had chicken soup with vegetables and some lime inside it for lunch ✊🏿 The idea is to not to take drugs 🤦🏿‍♀️ Are you hydrating? Are you eating lots of fruits?🤔"], ["chicken and lime soup", 313514076, "Sauteed  beef w/ green pepper and onion on toasted garlic bread w/ mozzarella. Comes with soup or fries.\n\nPlease indicate which soup or fries you would prefer in special instructions.\n\nToday's Soup's- French Onion, Cream of Jalapeno &amp; Cheddar, Lime Chicken Avocado, Seafood Gumbo"], ["chicken and lime soup", 20190989, "A great soup is nothing without a garnish! While this flavorful, naturally gluten free soup is delicious, the lime juice, cilantro, creamy avocado, and minced onion garnishes make this dish great! #Soup #EasyDinners\n\nhttps://t.co/QEM6Tz1zBN https://t.co/sxNa6W8D65"], ["chicken and lime soup", 2944390694, "RT @ConfuzzledSheep: Just had homemade chicken noodle soup with lime and fellas? I've cracked the code"], ["chicken and lime soup", 974814637710389248, "Just had homemade chicken noodle soup with lime and fellas? I've cracked the code"], ["chicken and lime soup", 726949924412084224, "Today’s soup is Dill Pickle. Today we’ve also got a Caribbean Jerk Chicken quesadilla as our feature quesadilla. Jerk spiced chicken, avocado, mango, Havarti, cilantro, and lime in a tomato tortilla. #dvcobblestone… https://t.co/ZAUBfG36Ye"], ["chicken and lime soup", 1031621462715772930, "RT @truthpunny32: @LouiseCort1 Yes!!! That's what's up!! Chicken Taco Soup!! Omg THANK YOU for the suggestion!! I can make that .. I mean l…"], ["chicken and lime soup", 1151481434567086080, "@LouiseCort1 Yes!!! That's what's up!! Chicken Taco Soup!! Omg THANK YOU for the suggestion!! I can make that .. I mean like it matches my skill set in the kitchen it's easy to make plus tastes great with a shot of lime and a slice of Avocado"], ["chicken and lime soup", 372992840, "Lunch:\nChicken salad on kaiser, turkey sloppy joes, wedge cut fries, green beans, Vietnamese fried rice, sausage pizza, pulled turkey carnitas, cilantro lime rice, black beans, creamy cheddar and broccoli soup, garden vegetable soup, Monte Cristo sandwich, plant bar"]]