[["chicken biriyani", 2764282224, "@fayedsouza Home made Chicken Biriyani.. Cooked by my Mom.."], ["chicken biriyani", 97980507, "So i make a vegan biriyani ... I’m eating it and something is missing... i end up eating chicken with it... i tried"], ["chicken biriyani", 827046918786260992, "@fayedsouza I don’t know about all those Biriyanies I am not trying it, but I know that Biriyani I tried it that is CHICKEN BRIYANI 😋"], ["chicken biriyani", 1466761476, "@fayedsouza Kolkata biriyani, for all the aalu &amp; eggs besides the chicken/lamb!"], ["chicken biriyani", 1222585902054006785, "@fayedsouza My Favorite is Mom made Nati koli (Country Chicken) Bangalore style Biriyani (No Basmati Rice) when I walks home after friday prayer I can smell from very far off"], ["chicken biriyani", 1160153104836251649, "@TheGoodfella70 Biryani is my favourite dish. But I can afford it. Unlike all those poor Shaheen bagh protestors who are protesting just to get free biryani. 😭.\nChicken, mutton biriyani I have tried.\nI haven't sold my religion yet to try beef."], ["chicken biriyani", 1195991205546360832, "@fayedsouza I never tried special ones. Only spicy chicken ones. Even yet to taste mutton biriyani. Since not available In area 😔😛"], ["chicken biriyani", 2509917452, "@MukulAgarwal66 Usually they will convert for even 5kg rice. If u give chicken Biriyani, they may consider to convert for another religion."], ["chicken biriyani", 122577781, "@SreeBasu84 @fayedsouza Mutton biriyani and chicken chaap."], ["chicken biriyani", 1037883350453821440, "@swiggy_in\n I m pure veg and today I ordered veg paneer biriyani but they deliver me chicken biriyani.When called to CC for replacement they told me currently not possible for replacement we provide you175 cupon. Payment is 119 but the delivery boy took160 .What a service guys."], ["chicken biriyani", 1433799019, "RT @caa_nrc_best: I love chicken biriyani no doubt in dat and dat too cooked by myself only\nNot the kudrati one\nNot dat #biriyani which is…"], ["chicken biriyani", 964729610251378688, "@fayedsouza Fried chicken Biriyani"], ["chicken biriyani", 867595175383646213, "@binuaravind @fayedsouza Chicken biriyani..which I made today!!😀"], ["chicken biriyani", 748460428401868800, "@RantingDosa First milk then veg biriyani. The distance to paneer &amp; butter chicken is diminishing ."], ["chicken biriyani", 70317453, "@LilacRestaurent Hello I paid for 2 chicken biriyani and 1 beef biriyani today.. when I opened parcel back home I could see 2 beef and 1 chicken.. my wife don't eat beef and it's hard to travel back to change. When I called to the no in bill one is switch of and another invalid"], ["chicken biriyani", 842587116693569536, "RT @caa_nrc_best: I love chicken biriyani no doubt in dat and dat too cooked by myself only\nNot the kudrati one\nNot dat #biriyani which is…"], ["chicken biriyani", 2862419383, "RT @caa_nrc_best: I love chicken biriyani no doubt in dat and dat too cooked by myself only\nNot the kudrati one\nNot dat #biriyani which is…"], ["chicken biriyani", 2480047106, "RT @caa_nrc_best: I love chicken biriyani no doubt in dat and dat too cooked by myself only\nNot the kudrati one\nNot dat #biriyani which is…"], ["chicken biriyani", 3319801836, "RT @caa_nrc_best: I love chicken biriyani no doubt in dat and dat too cooked by myself only\nNot the kudrati one\nNot dat #biriyani which is…"], ["chicken biriyani", 1198917239606366208, "RT @caa_nrc_best: I love chicken biriyani no doubt in dat and dat too cooked by myself only\nNot the kudrati one\nNot dat #biriyani which is…"], ["chicken biriyani", 100454683, "RT @caa_nrc_best: I love chicken biriyani no doubt in dat and dat too cooked by myself only\nNot the kudrati one\nNot dat #biriyani which is…"], ["chicken biriyani", 1384626162, "RT @caa_nrc_best: I love chicken biriyani no doubt in dat and dat too cooked by myself only\nNot the kudrati one\nNot dat #biriyani which is…"], ["chicken biriyani", 1104478427770281984, "I love chicken biriyani no doubt in dat and dat too cooked by myself only\nNot the kudrati one\nNot dat #biriyani which is cooked by anti nationals https://t.co/UluflMTokw"], ["chicken biriyani", 93899500, "@AkkaGo @fayedsouza Of course I have! The biriyani is doused with oil and the chicken is bland\n\nAlso - Rasagulla is from Odisha"], ["chicken biriyani", 53728344, "@fayedsouza Kerala Chicken &amp; mutton biriyani. If possible calicut biriyani"], ["chicken biriyani", 827336635, "@fayedsouza Boneless chicken biriyani any day😀😍\n\n#ChickenBiryani"], ["chicken biriyani", 56582353, "@fayedsouza Malabar dum biriyani is the best ever with mutton version slightly ahead of chicken/beef."], ["chicken biriyani", 1177956183010709505, "@fayedsouza Thalassery chicken biriyani"], ["chicken biriyani", 73608943, "@fayedsouza Chicken Tikka Biriyani from Bangalore's Aroma Hyderabad House chain. Spicy and zabardast."], ["chicken biriyani", 579067596, "@fayedsouza Mom's special Malabar Chicken Biriyani on the day of Eid 😍"], ["chicken biriyani", 1100795731449970688, "Come here's your Chicken biriyani 💟 https://t.co/kGxBXZ0BLu"], ["chicken biriyani", 3178853888, "@taslimanasreen I have seen many hypocrites lecturing on same subjects on stages and then go for lunch and finish few dishes called MUTTON BIRIYANI, FISH CURRY, CHICKEN HANDI etc and then they move for next lecture. And yes, they proudly call them ANIMAL LOVING PEOPLE, amazing. @PetaIndia"], ["chicken biriyani", 1092118197992599552, "@tweetsOfEl Biriyani is anti-national, pro-Muslim, Nehru used to love it, eating this will bring back Mughal era, chicken mat khao coronavirus pakad lega, etc etc"], ["chicken biriyani", 130807416, "@deputygrocott Chicken biriyani (Emma style) and a rather nice French Sauvignon that appeared in the wine fridge - provenance unknown! https://t.co/FAeSJdk6DJ"], ["chicken biriyani", 114148661, "@virsanghvi @sruthijith Any given day of the week!! Vir, nxt time u r in Calicut, try this place called Kutichira Biriyani Center if u haven’t.. The Chicken Biriyani is to die for.. 🙂🙂"], ["chicken biriyani", 1137556321568468992, "Delhites will prepare Biriyani with chicken neck. https://t.co/wjeUA0fQKy"], ["chicken biriyani", 3041678328, "The people decided.\n@sambitswaraj Ji, whenever I get sad, my mom gets me amazing biriyani. Pls send me your address , I’ll sponsor one for you so that you sleep happily. Bas boldena chicken ya mutton. https://t.co/hPlM8yokfD"], ["chicken biriyani", 4176577137, "I’ll tell you fucking amazes me is how can you nurses and doctors deal with blood,pus,vomit, wee and shit and still have an appetite for a chicken biriyani after 😬"], ["chicken biriyani", 1674675962, "@RailwaySeva @IRCTC_News @PiyushGoyal @RailMinIndia @RailwaySeva just watch this menu chart of renowned restaurant of Kolkata. They served chicken biriyani @ Rs 120/- where your taking Rs110 https://t.co/gwdMw3Ci2a"], ["chicken biriyani", 1674675962, "This is @IRCTCofficial 's biriyani which actually rice with chicken curry. Served @ Rs 110/- https://t.co/p9lFi77ZLc"], ["chicken biriyani", 1207894437403058176, "RT @MeatRk: Celebrate🥳 this 31st evening\nHaving delicious😋 chicken🍗 &amp; mutton🍖 biriyani🥘🥘\nOrder now through 💰Google-pay (Or) Phone-pay💵\nAnd…"], ["chicken biriyani", 1207894437403058176, "RT @MeatRk: To light💥 up 31st night🤩\nTo have a blasting😎 sight\nThe best taste😋 in food🍲\nProvides you the best happy😊 mood\nWith limited offe…"], ["chicken biriyani", 27963262, "@RanaAyyub Bring ur papers and wait for that crow meat biriyani....😂🤣😂🤣 because they have ran out of mutton and chicken....🤣😂🤣😂🤣😂"], ["chicken biriyani", 2598198109, "@deepigoyal @Zomato @zomatocare \n*Item not available (then why they show )\n*Wrong item delivered (egg biriyani instead chicken biryani )\n*Item quantity missing (dosa without chetni )\n*Tracking and some lag issues in app.\nLot of issues from your service."], ["chicken biriyani", 945887173903077376, "@tweetsOfEl @QutqutG I guess the original would have been mutton biriyani? The rest like chicken, beef, prawn etc are derivatives."], ["chicken biriyani", 1134765761396846593, "RT @dirty_policy: It seems next time when you ride @Uber you will be given instructions\n\n1. If you burp and will find biriyani will be drag…"], ["chicken biriyani", 1193406134872354816, "@justvoot Chettinad chicken biriyani\n#RashamiKeAsliFans \n#AsliFans\n #BB13OnVoot"], ["chicken biriyani", 132472668, "bruh if it’s not biriyani, chicken tikka, and shami kebab i don’t want it https://t.co/iAMIEaWNQx"], ["chicken biriyani", 612013931, "@kerrylynn21 For me, the butter chicken, monkfish, and biriyani were incredible"], ["chicken biriyani", 281520153, "My 20 month old told me yesterday that my chicken biriyani looked like the litter tray #savage"], ["chicken biriyani", 1173683231486545920, "@haqsmusings Me and my Indian Hindu friends abroad loved to have Chicken Biriyani together.. Specially on Friday.."], ["chicken biriyani", 4910104238, "It seems next time when you ride @Uber you will be given instructions\n\n1. If you burp and will find biriyani will be dragged to the lab for test whether beef or chicken.\n\n2. If you talk about valentines day will be dragged to nearest rss centre.\n\nLooking forward #Uber"], ["chicken biriyani", 937338511744688128, "@ANI And that too after eating chicken biriyani. They are insulting our religion. It is blasphemy. I humbly request honble @Swamy39 ji to kindly look into this. Becos the matter is coming up on SC on monday for child rights violations. VHP also must plead for this devious havan"], ["chicken biriyani", 1109496718872195073, "@nothaikyu I LOVE CHICKEN BIRIYANI LETS GO RISH LETS GOOO"], ["chicken biriyani", 1146348722541846528, "@izayagf how about chicken biriyani?"], ["chicken biriyani", 1037395043726680064, "@deepikareema Am a little specific so chicken biriyani, chilli garlic noodles and dahi maach"], ["chicken biriyani", 172307205, "@rightofcentre52 @kesar_akankasha But Biriyani origin is not from Mughals, nor any Islamic invaders. In South, there r some inscriptions which mentions of rice item with chicken."], ["chicken biriyani", 17754650, "@vivekagnihotri a lot of BHAKTS from shahinbaag too.. chicken biriyani in dinner and Havana for 5 elements of nature in morning..  what a combination.. and they think this havan will give results.. 😜😜😂"], ["chicken biriyani", 796211926543929345, "Universal law of motherhood says tht even if she puts chicken pieces in biriyani and calls it veg biriyani it is veg biriyani."], ["chicken biriyani", 929595421810311169, "#FallonAsksBTS  ask them do they know biriyani do they know butter chicken or kheer"]]