[["chili paneer", 3724478671, "The JD!! Inspired by jobandeep Singh, blackened paneer layered with roasted peppers, pickles, honey Mustard and a chili red hots served on whole wheat toast! #devsamericancafe… https://t.co/35EnWscgmq"], ["chili paneer", 1103920668674994178, "@aesthethicclou @defenceIous ENOUGH MAHI YOU CAN'T DISRESPECT PANEER CHILI LIKE THAT"], ["chili paneer", 467756441, "@swarajk224 @_SidVerma @teasri have you guys actually had Indian Dominoes? Its fcking amazing. Paneer tikka pizza? Chili chicken pizza? ACHARI GOBHI pizza?!"], ["chili paneer", 935160681610878976, "@ZomatoIN  @zomatocare \nI ordered chili paneer from SHREE MITHAS restaurant Kota.\nThe quality was worst and quantity was even more worse.\nChili paneer price was INR 160.\nNow kindly see the quality and quantity in the attached picture.\nI want my money back.\nDon't cheat with us. https://t.co/wGlOp0eMgc"], ["chili paneer", 1171997851154448385, "Some of my cooking skills \n\n:)\n.\n.\n.\n#indianfood \n(chili paneer, sambhar vada and idlys) https://t.co/mPsH7G79BA"], ["chili paneer", 1045065712190910466, "My health is rapidly declining &amp; everything hurts. Trying to focus on self-care, so I made dal tadka (lentils cooked a garlic, onion, chili, cilantro + my secret masala blend) &amp; saag (spinach) paneer. I’m not a vegetarian by any means but this is my fav comfort dinner🤤 https://t.co/LQMRU0l1lv"], ["chili paneer", 1212975285206781952, "@harmanoid_ Yeah well someone promised me all that and never can through so now it’s stuck in my head. So if you got some chili paneer let me know"], ["chili paneer", 1212975285206781952, "@harmanoid_ Chili paneer with garam naan. Then afterwards ik cha da cup"], ["chili paneer", 1191280537526095872, "RT @thequickwok: #𝐏𝐚𝐧𝐞𝐞𝐫𝐜𝐡𝐢𝐥𝐢𝐰𝐢𝐭𝐡𝐇𝐚𝐤𝐤𝐚𝐧𝐨𝐨𝐝𝐥𝐞𝐬\nWinter is here😍!!\nEnjoy a rustic winter date with some authentic Chinese dishes🍟🥣🍹🍜 with Theq…"]]