[["chocolate chai coffee", 40161284, "@arallan78 Chai for me. I don’t like chocolate so not an issue. I can give up coffee too. But without tea, life is pointless 😫"], ["chocolate chai coffee", 2206061481, "Good morning! Home fries, avocado toast, LOVE BLEND, vanilla scones, our fabulous muffins, bagels, sausage and home fries frittata (we know!!) start off this Saturday. Hot chocolate, chai, and the best darned coffee in town! Join us! https://t.co/qAGSOcRRfz"], ["chocolate chai coffee", 749211703, "5 drinks to get to know me ☕\n\n1. Milk Tea / Boba\n2. Tradition Indian Chai\n3. Thai Milk Tea/ Vietnamese Iced Coffee\n4. Green Tea\n5. Chocolate Milk/ Filter Coffee https://t.co/kuvPjMliqa"], ["chocolate chai coffee", 1136608741506375680, "5 drinks to get to know me\n\n1) any fizzy drink \n2) chai\n3) any frappe \n4) iced coffee \n5) milk, but usually when it’s got nesquik powder in it, E.g. chocolate, strawberry, banana etc https://t.co/Pu4zGZeraj"], ["chocolate chai coffee", 32776127, "5 Drinks!\n\n(0. WATER! Because yum, hydration!)\n\n1. Builders’ Tea (Yorkshire Gold)\n2. Vietnamese Drip Coffee w/condensed milk, as God intended.\n3. Masala Chai.\n4. Young coconut water.\n5. Basically any other tea/herbal infusion: rooibos, matcha, peppermint, chocolate cake etc etc https://t.co/M00B9l0GG7"], ["chocolate chai coffee", 291142189, "5 Drinks to get to know me ☕🍸🍻\n\n▪︎ Rootbeer (Mug or Sarsi)\n▪︎ CBTL Iced Chai Tea Latte\n▪︎ CBTL Hot Double Chocolate\n▪︎ CBTL Iced African Sunrise Tea Latte\n▪︎ Dunkin Donur Iced Coffee https://t.co/m8HDq8KvFx"], ["chocolate chai coffee", 413121789, "It's freezing outside.  I can't do coffee, but I today was full of hot drinks.  I'm having hot chocolate and chai lattes.  What's your favorite drink for this cold weather. @ Mackey, Indiana https://t.co/30x98E4u4c"], ["chocolate chai coffee", 1216097203304980481, "@Mythical_Chai gets. . . A small cup of coffee! Actually, it's just a chocolate cup."], ["chocolate chai coffee", 1220898957376671744, "@genzmashfan i used to do this at work when i was lazy i would pour a cup of coffee and use the chocolate chips we put in frappuchinos and let em melt. tastes good in chai too"], ["chocolate chai coffee", 391693159, "@pixel39 Chai with chocolate. I get it from Adagio; you can also try chai with one scoop or pump of chocolate at most coffee places that have chai. Oregon Chai makes a pre-mixed concentrate. And so forth."], ["chocolate chai coffee", 994756769141358592, "RT @samanthabitch9: pure dark chocolate + coffee or a chai tea latte 🤤🤤🤤 milk chocolate just make me feel like i gotta go to the dentist 🥴"], ["chocolate chai coffee", 1146658303587622914, "pure dark chocolate + coffee or a chai tea latte 🤤🤤🤤 milk chocolate just make me feel like i gotta go to the dentist 🥴 https://t.co/0StQ2NoYEm"], ["chocolate chai coffee", 1216305026265600001, "@CocoNPops They're beautiful &amp; full of love! \nTheir coffee and chocolate colouring is a lovely aesthetic for the morning when I most need milky chai masala tea, or caffee latte to function."], ["chocolate chai coffee", 1036251874884759553, "Thanks to @LycaonpictusG 😊\n\nHeight: 1,73m\nAge: 35, but 24 in spirit\nShoe size : 40\nZodiac: Libra\nTattoos: None\nPiercings : Incl. ears, 3\nFav drink: Iced coffee / chai latte / cinnamon coke\nFav snack: Anything chocolate\nFav animal: Alpaca\n\nNot tagging, just do it if you want 😊 https://t.co/76Fj7DpX70"], ["chocolate chai coffee", 3151997881, "So I spent $230 on a espresso, blender, coffee machine thing. Hands down the best purchase of my life. I can make a blended chai with chocolate milk or make piping hot cappuccino. 10/10 recommend."], ["chocolate chai coffee", 368910785, "@DawnaMughalPhD @SMahashur Chai tastes delicious in steel-cut oats too. I sometimes add chocolate, chai, or coffee for extra flavor."], ["chocolate chai coffee", 260376590, "I forgot the changed chai latte at Costa tasted disgusting but as I'm off coffee this week it was the alternative to hot chocolate which I didn't want or tea which is always shit and always too hot to drink"], ["chocolate chai coffee", 1303151606, "RT @LSEcatering: Need that coffee fix? Come and visit us at the Fawcett Café and try our new White Chocolate with Beetroot Chai. Full of fl…"], ["chocolate chai coffee", 1193649376100532228, "Egg: hard boiled, sunny side up 🍳\nSteak: medium rare \nMilk: chocolate milk, soy milk and with Chai tea\nWarm drinks: herbal teas (mint, hibiscus, chamomile), black, green, &amp; Chai teas, coffee \nAlcohol: -- https://t.co/CCz1Dw65Ub"], ["chocolate chai coffee", 2586492739, "Iced chai.....americano/hot chocolate back to back.............black iced coffee.......no scoop berries......this is a feel good post"], ["chocolate chai coffee", 2811637219, "@brtzzv Think it was white Chocolate French vanillas latte.. I’ve only had it once and it was the best coffee I’ve had to date! ( I’m not a big fan in general) plus their chicken sandwich is halal! Sometimes lowkey the small coffee branches can be really good"], ["chocolate chai coffee", 1147314400425938945, "@illvmi i have a keurig with chai tea and hot chocolate but if u want coffee u have to bring ur own pods"], ["chocolate chai coffee", 1104258981445468160, "RT @Z_o_ya: I can make chai, coffee,  green tea, cake, spaghetti, molten lava, naan khatai, juices, omelette, chicken karaahi, fries, banof…"], ["chocolate chai coffee", 2858735211, "Need that coffee fix? Come and visit us at the Fawcett Café and try our new White Chocolate with Beetroot Chai. Full of flavour and super indulgent! ☕☕\n#partofLSE #Keepcup #chailatte #barista #Holborn #lsecatering #oatmilk #dairymilk  #Fawcettcafe https://t.co/3DNrhFzjN5"], ["chocolate chai coffee", 1263414344, "OH. MY. LANTA!!!!! \ninfo RELEASED MINUTES AGO in our HAPPY company!!!! \n\n🤩VANILLA CHAI TEA🤩\n\nAll of the same benefits of our coffee, hot chocolate and lemonade!!!! Limited time only!!!! Releasing this month!!!\n#HappinessIsCloserThanYouThink #WeGotTeaNow #OneDoseAtATime https://t.co/MoOQiIrBtZ"], ["chocolate chai coffee", 152486804, "Chocolate covered peanut butter pretzels with coffee or chai is damn good!"], ["chocolate chai coffee", 3277736077, "I can make chai, coffee,  green tea, cake, spaghetti, molten lava, naan khatai, juices, omelette, chicken karaahi, fries, banoffee, chocolate delight, kabab, pakorey, biryani, dahi bhaley, fruit chat and every kind of roti...\n\nWBY... ??"], ["chocolate chai coffee", 976605566729535488, "reduce caffeine: I dont drink tea or coffee. Sometimes, like rarely hot chocolate chai khanchhu, tara tesma hunchha ra? or just a little probably"], ["chocolate chai coffee", 1222376127236169728, "2. One of my favorite eateries on campus is Stellar Coffee. My go-to thing to order is a Chai Latte and a chocolate croissant. #FDOM20 #TXST https://t.co/0SPbDqovYX"], ["chocolate chai coffee", 1909524176, "i will never be good at ordering at indie coffee shops. i don’t know what a vanilla honey infused frozen chai mocha latte is. Why dont you have hot chocolate"], ["chocolate chai coffee", 50720300, "@coffee_cove \"Hubb Life\" x 4. And I'd like those delivered, please. Oh yeah, also an iced chai and chocolate chip cookie."], ["chocolate chai coffee", 379377832, "@brennatully @notlizziemae @Starbucks Snickerdoodle hot chocolate, chai frappucino with coffee base and one espresso shot and no whip, lemonade with 3 pumps raspberry and strawberry pieces"], ["chocolate chai coffee", 840311914332839937, "@megabbadbitch Omg my dad used to work next door and I would always get a chocolate croissant w tea, a chai, or mocha. My favorite little coffee spot ever, I would wait for him to get off of work and do my homework there’s the memories 🥰🥺"], ["chocolate chai coffee", 32898338, "@ManuelJunior_ I don’t drink coffee at all, so when I do it’s like a hot chocolate or maybe a chai tea 😂😂"], ["chocolate chai coffee", 589917808, "RT @CoffeeBikeWorcs: Looking to impress clients, customers, staff or friends ?  Why not hire Coffee-Bike (Worcester) for your private or co…"], ["chocolate chai coffee", 762540908961234944, "Looking to impress clients, customers, staff or friends ?  Why not hire Coffee-Bike (Worcester) for your private or corporate event?\nGREAT Coffee, Hot Chocolate, Chai &amp; Tea served the way YOU like it 😊  \n#coffee #coffeecatering #coffeebike #corporatecatering https://t.co/53u2TIGH6d"]]