[["cilantro relish", 20782250, "With every great comedy show you need great food!  Come out this weekend for Bryan Callen and try Chef Leo’s weekend special! \nChurrasco Steak: grilled skirt steak |  coconut jasmine rice | cilantro black beans | avocado serrano relish | pickled red onions https://t.co/8vLpVhLlJc"], ["cilantro relish", 500494637, "Fried Halloumi for all the lovebirds 🦢 tomorrow with an rich tomato relish with smoky eggplant, cilantro &amp; lots of lemon! 🍋 #halloumi #welovecheese @ Crazyweed Kitchen https://t.co/RPbnZtFvCZ"], ["cilantro relish", 1902535346, "Special: Green Chile Pork Stew $10– Pulled pork, chorizo, roasted poblano, green chile, cumin-cilantro broth, sliced avocado, pickled jalapeño relish, manchego cheese, citrus sour cream, &amp; grilled flour tortilla.… https://t.co/qXZfHiIPKS"], ["cilantro relish", 715290814000144384, "Start the romantic weekend early with our AguaChile Ceviche Tostaditas! This Happy Hour special offers Ahi, shrimp and halibut, marinated in aguachile, finished with chipotle aioli avocado salsa, habanero and red onion relish, avocado, cilantro and radish! https://t.co/Luq89l5xlA"], ["cilantro relish", 38049960, "@Oilerule Just realized I forgot to mention the fresh cilantro that is in the \"relish\" with the onion and lime juice! Some people don't like it but I'm a big fan!"], ["cilantro relish", 37813103, "Sneak peek at just one of the four dishes Bamboo Sushi NW Portland is releasing this Valentine’s Day. Available all weekend long Feb. 14-16. \n\n*Shown- Shima No Mori Box with @orakingsalmon, sushi rice, house crab, cilantro, yuzu pickle relish, cilantro, ground goma &amp; fried onion. https://t.co/HW7e1683Q6"], ["cilantro relish", 29339277, "Cilantro tomatillo pulled chicken tacos. Borracho (as usual) style black beans. Cauliflower rice (with extra veg) Avocado relish (very different than guac!!!!), homemade salsa, and margs for dinner tonight. Get in my friggin belly."]]