[["coconut chutney", 1059443718988558337, "@PphoenixK I have dosa batter in my fridge now. !! Wanna drop here babe  ? I can do fresh coconut chutney..  may be a lil spicier than in Restaurabts   😋👍"], ["coconut chutney", 1069639538513854464, "@Jst2twt4VnBTS Omgggggg you are killing me. My fav is those crispy big roll ones. My favorite Indian food of all time, with that coconut chutney"], ["coconut chutney", 164411696, "RT @SowMe18: How much vodka goes in coconut chutney? People are saying I added less. 🤷🏼‍♀️"], ["coconut chutney", 960764462113480704, "@Rowdyskull It will become \"peena coconut chutney\" then 🤔"], ["coconut chutney", 815909000336195584, "@chunkyfila That coconut chutney hit different tho"], ["coconut chutney", 960764462113480704, "How much vodka goes in coconut chutney? People are saying I added less. 🤷🏼‍♀️"], ["coconut chutney", 1688450846, "@FarziCricketer Idli with coconut chutney is trillion times better than this oil well"], ["coconut chutney", 407646772, "@nimish4fk Dude why? Could've gotten yourself nice paper masala with nice coconut chutney for next 5 days of lunch instead."], ["coconut chutney", 851515297878167555, "RT @thambislondon: Some of our flavoursome and delicious chutneys featured at our Supper Club 👉 From the top Ginger Chutney, Coriander Chut…"], ["coconut chutney", 1012793360577425408, "@chunkyfila that coconut chutney b hittin’"], ["coconut chutney", 179527173, "@Achari_Nimboo Idli without sambar and coconut chutney is blasphemy 😂"], ["coconut chutney", 975249988870524928, "Day was good but then I ordered masala dosa from udipis and got two coconut chutneys along instead of one sambar and one coconut chutney, outrageous"], ["coconut chutney", 410640579, "@jsaideepak I like their white coconut chutney. You dont need a sweet dish 😊"], ["coconut chutney", 1176766275470516228, "@Mukesh786jsp tablet vesuko coconut water thaagu n idly thinu with out chutney or drink only juices"], ["coconut chutney", 1218094547613470720, "Jogi Pop’s #FishFriday treat today from the beautiful island of Sri Lanka. \n\nYou can get these delectable Fish Cutlets from roadside eateries in every town!\nDeliciously and Delightfully accompanied by a smooth Coconut Chutney.🥥\n\nMmmmm!!👌\n#brighton #shorteats #visitbrighton https://t.co/tsXsgv1F1u"], ["coconut chutney", 1115910297368313856, "Full of nutrition, dosa is the best for every weight watcher. Enjoy munching on your all-time favourite soft and crispy dosa dipped in hot sambhar and coconut chutney with a 50% flat at Dosa Festival presented by Sugar N Spice Vapi.\n\nContact us at 07777886621 https://t.co/BUOLzm6qOc"], ["coconut chutney", 2473023680, "Tonight's menu for @SurplusMCR is sounding A-MA-ZING 😁 Chef Laurence is promising... Bang Bang Cauliflower, slow cooked poutine gravy with chicken &amp; bacon, &amp; super creamy coconut cauliflower curry with spicy herb chutney.... AND, hot gooey brownies!! 😍"], ["coconut chutney", 1225734876877541376, "How to make Simple Masala dosa with coconut chutney l Vegan -l South Indian https://t.co/Ksb7b65ETW via @YouTube"], ["coconut chutney", 138934997, "RT @EdibleSB: Pulled Masala Chicken Taco Bowls with Fresh Mango Peach Relish\nhttps://t.co/suREcpzaza  (via @CambriaWines ) \n\ntender, juicy…"], ["coconut chutney", 87989672, "RT @EdibleSB: Pulled Masala Chicken Taco Bowls with Fresh Mango Peach Relish\nhttps://t.co/suREcpzaza  (via @CambriaWines ) \n\ntender, juicy…"], ["coconut chutney", 897692369788784640, "@Royalprakash @coolfunnytshirt I am a Tamil.\nBut a Kannadiga of 2 decades.\n\nAddicted to,\n1) Red hot bisibele bath + boondhi + coconut chutney.\n2) Benne (Butter) Masala dosa\n3) Filter coffee.\n\nDon't know whether I am a Tamil or Kannadiga.\nBut yes, we do exist."], ["coconut chutney", 1223370184808730624, "@ebruenig Honestly IMO the easiest place to start is to ask them if they like spicy food. If they say yes go with Mumbai Pav Bhaji. If they say no go with a ghee roast dosa with coconut chutney and sambar. That butter-y, bread-y, savor-y stuff is the easiest for Americans."], ["coconut chutney", 147091061, "@YRDeshmukh Apna simple hai Dada ! Sanjay bhai likes a Sambhar dipped bada and I prefer it with Coconut chutney. But we have agreed to disagree...\n\nDil VADA hona chahiye 😀 https://t.co/BGFie5zNKa"], ["coconut chutney", 401963073, "South Indian breakfast. With samba curry sauce, coconut chutney and masala dosa. https://t.co/FUv9tDrIbB"], ["coconut chutney", 928850041623609344, "Instant Coconut Chutney and Idli Recipe\nhttps://t.co/Nja4zZv3dL\n\nHey Guys\nMe @ammakithaali uploaded a new video on YouTube and Facebook which is very special in very session go and watch now.\nFull Recipe -… https://t.co/Y6GR0ixABv"], ["coconut chutney", 1112672547491840000, "i think im addicted to coconut chutney"], ["coconut chutney", 18083869, "With you, I am home ❤️ \n.\nThe best breakfast ⚡️🌱 🤤Hot, fluffy, soft Idlis with coconut 🥥&amp; curry leaf 🌿 chutney. Swipe through 📷 for scenes from every South Indian home during breakfast time💚\n.\n💫 My Chutney recipe is… https://t.co/dfE0HomfBi"], ["coconut chutney", 111531337, "Trying to break coconut for chutney, my husband: https://t.co/BSGxUTURzd"], ["coconut chutney", 862821999902572544, "Physician food chronicles cont'd\n\nLove this lounge!\n\nIsland curry chicken, Haitian shrimp creole, mango coconut rice, callaloo, okra and tomatoes, mango chutney\n\nDessert is undecided... Plantains? Flan? Tres leches?\n\n#somedocs\n#medtwitter https://t.co/exnmxFUQ7Q"], ["coconut chutney", 261155798, "@melindafarrell Aappam is difference with Uththappam Aappam Made with rice flour in mild thickness served with Kuruma and coconut milk \nUththappam with heavy thickness served with variety's of chutney (coconut, onion, pudhina) along with sambhar"], ["coconut chutney", 257339683, "@IdliVadeBeka Start with me. With lots of coconut chutney"], ["coconut chutney", 1129059942571208704, "@Iyervval Have you tried bajjis with sambar/coconut chutney?"], ["coconut chutney", 38421855, "@ObiomaUgoala Seven Vegan Friendly Suppers for January by Anna Jones has a good list! I want to try the dhal with crispy sweet potato and coconut chutney 😍"], ["coconut chutney", 294039426, "@melindafarrell Ask for coconut chutney."], ["coconut chutney", 1576797006, "@Iyervval How can one have Idli without coconut chutney."], ["coconut chutney", 1191284002570686464, "RT @Vjkaminaninja: Finally i guess the wait will b soon over ... For all of you who have been waiting to see us together... @CharanBangaram…"], ["coconut chutney", 1217346591603884033, "@dipunair @ranjona @amitmalviya Coconut 🥥 chutney dry as side"], ["coconut chutney", 1205009385170202625, "@the_hindu To counter all these, I am soon starting an authentic Thalassery biriyani outlet in heart of Hyderabad. Biriyani with pineapple as one of the ingredient, with dates pickle, papaddam and coconut chutney. @virsanghvi"], ["coconut chutney", 112970919, "@Purba_Ray And coconut chutney is a must with each one of them!"], ["coconut chutney", 366575283, "Oh, please. Kaara chutney&gt;&gt;&gt; Coconut Chutney. https://t.co/T8RDRE8ZoP"], ["coconut chutney", 276085643, "Such a cold, dreary day. Made the perfect hearty, delicious dinner: potatoes, garbanzos, kale &amp; onions sautéed with Indian spices, on coconut rice, topped with cranberry chutney."], ["coconut chutney", 607642686, "@tavian_21 The mascots were a cat named coconut chutney and a dude named Reg. Reg was a former messiah/ Bodhisattva and coconut chutney was an immortal cat who could play the tabla. They used to go on adventures to learn about other cultures and religions"]]