[["coconut curry chicken", 175378976, "@crookedreviews 3-4 chicken breasts, cut into 1” wide strips/chunks\n3-4 red potatoes, peeled, cut into 1” cubes\n1/2 lb of carrots, cut to bite size\n2 baby bok choi, cut into 1” wide strips, separate leaves from stems\nDiced Thai chilies to taste\n1 can coconut cream\n1 can coconut milk\nCurry paste"], ["coconut curry chicken", 917151622735826944, "@6MusicStudio loving the tunes. Cooking a banging coconut Balinese chicken curry. Craig Charles is helping no end. Loving the tunes Craig! https://t.co/GSG8saN1xq"], ["coconut curry chicken", 34353824, "We are now selling containers of our muffaletta mix to take home — exciting!! We also have one quart of Hungarian mushroom and one quart of coconut chicken curry soup left in stock! https://t.co/PTxNSkxTmY"], ["coconut curry chicken", 36742425, "Coconut and peanut butter make for a #delicious chicken curry #recipe.  https://t.co/NI1xIapwXw https://t.co/GFNNSl2A2V"], ["coconut curry chicken", 93763540, "Soup du Jour *Red Curry Coconut Chicken* *Cheddar Baked Potato* *Tomato Parmesan* *Mediterranean Chicken* https://t.co/KLbKLaZT3g"], ["coconut curry chicken", 858923168, "2/8 Daily Special\nItalian Crusher\nRosemary Bread smeared with pesto ranch topped chicken and Provolone oven warmed finished with basil, tomato wheels, and banana peppers.\n\nSoup\nM) Chicken Coconut Curry \nV) Ravioli Italiano\n\nHave you tried the Pho?!"], ["coconut curry chicken", 155754319, "Tasty Green Curry 🤤 \n\nChicken • King Prawns • Veg &amp; Tofu\n\nCoconut curry with green chillies, mixed peppers, Thai basil, bamboo shoots, coriander and lime leaves https://t.co/ik95pv5ZeP"], ["coconut curry chicken", 2557013239, "RT @eating_ideas: Did you know that @BangKokBelfast won the Best Newcomer (Ulster) category in @irishcurryaward ?  Beautiful food with no a…"], ["coconut curry chicken", 195365329, "Tonight I am making a Sri Lankan coconut chicken curry, &amp; I had to start by making my own toasted Sri Lankan curry powder ✨🖤 my apartment smells amazing 🤤 https://t.co/PPptrtgG5Y"], ["coconut curry chicken", 1035224593882144768, "RT @eating_ideas: Did you know that @BangKokBelfast won the Best Newcomer (Ulster) category in @irishcurryaward ?  Beautiful food with no a…"], ["coconut curry chicken", 1573267086, "RT @eating_ideas: Did you know that @BangKokBelfast won the Best Newcomer (Ulster) category in @irishcurryaward ?  Beautiful food with no a…"], ["coconut curry chicken", 406279078, "Did you know that @BangKokBelfast won the Best Newcomer (Ulster) category in @irishcurryaward ?  Beautiful food with no additives and totally tasty!\nWe shared Dynamite Chicken, Duck Spring Rolls, Beef Massaman, Red Chicken Curry &amp; coconut rice.\n#Irishcurryawards2019 https://t.co/JZLsG6WELL"], ["coconut curry chicken", 725360973406699523, "... Red wines, posh crisps (!), coconut oil, jumbo porridge oats, chopped dates, chopped apricots, fruit nut &amp; seed mix, parsnip soup, chicken breasts, korma curry paste, cherry juice, a Terry's Chocolate Orange and Siren's Call Caribbean spiced rum... 😊"], ["coconut curry chicken", 3183651545, "RT @curryjackscaf: We always love welcoming all the potential new students and their families to #LincolnUK But remember it’s an open campu…"], ["coconut curry chicken", 2986139739, "I’ve not posted for a few days as believe it or not I’ve not cooked anything 🤷‍♂️\nFriday night curry night.\nMalvani sukka chicken, spicy 🌶 with hints of cardamom and coconut.\nI’m not pointing to the book as the recipe didn’t work as described nor those the result look anything l… https://t.co/p4vpg4d7uX"], ["coconut curry chicken", 938029652588851202, "We always love welcoming all the potential new students and their families to #LincolnUK But remember it’s an open campus so you’re welcome too! 🌶🔥Chicken Tikka Masala, Spicy Beef Madras or #vegan Broccoli, Chickpea and Green Pea Coconut Curry @unilincoln @LincolnOpenDay https://t.co/jDvolWfuNQ"], ["coconut curry chicken", 1006513282516054017, "@chuntibeyonce Me too henny spicy coconut curry bootz with chicken and wontons"], ["coconut curry chicken", 547501155, "RT @taphouse_pub: Chicken Coconut Curry Bowl, Honey Mustard Wings and our Root Beer Braised Pork Ribs (full rack) https://t.co/WdJlyUszJ7"], ["coconut curry chicken", 2835634518, "Chicken Coconut Curry Bowl, Honey Mustard Wings and our Root Beer Braised Pork Ribs (full rack) https://t.co/WdJlyUszJ7"], ["coconut curry chicken", 4285031534, "One my of fav dinners; slow cooker Thai chicken curry! I think most people who have been in my house have probably been served this at one point or another! \nRecipe (as best I can remember as it somewhat differs every time!): 1 can coconut milk mixed wit… https://t.co/7VlXRlyUg8 https://t.co/wdIe9kHvRa"], ["coconut curry chicken", 28499296, "Khao Soi Gai (Northern Thai Coconut-Curry Noodles With Chicken) Recipe - NYT Cooking https://t.co/XJEJNlMlwr"], ["coconut curry chicken", 921179433238761472, "anyways im about to make some curry chicken w/ coconut rice + plantains bc what else is there to do on a gloomy Friday like this?"], ["coconut curry chicken", 878469367, "Callin' all coconut lovers! Come through this weekend for our monthly special COCONUGS made with #coconut breaded chicken nuggets and served with a Thai Curry Sauce and sprinkled shredded coconut 🥥\n\n#TheNuggetSpot #EatmoreNUGS https://t.co/6z2RkahDBa"], ["coconut curry chicken", 2817285630, "RT @painterley: Thai green chicken curry with Coconut and lemon grass rice, Thai sweet chilli crackers and spring rolls. https://t.co/5q2ZI…"], ["coconut curry chicken", 4451684901, "If you haven’t been to kalayaphilly yet you are truly missing out.\n.\nChicken curry 🌶, coconut rice, cabbage @ Kalaya Philadelphia https://t.co/b09j0vg5UP"], ["coconut curry chicken", 30776112, "Thai Coconut curry chicken soup underway 🥥 #TestKitchen"], ["coconut curry chicken", 1190722890871791617, "Coconut Curry Chicken: A Keto Low Carb Curry Recipe | Wholesome Yum https://t.co/zjkvGsVNSo https://t.co/aCsI3Tve5G"], ["coconut curry chicken", 1710198668, "RT @ErinsDemonJeep: Amazing Dragon Master Noodles. Rob made it perfectly! Coconut chicken curry with fresh veg! #JeepsAndEats #ErinsDemonDi…"], ["coconut curry chicken", 275630725, "#FoodieFriday - if you like Thai curries, try this tasty Coconut Curry Chicken. The sauce is coconut milk &amp; chopped tomatoes, and it's sweet, tangy and very, very tasty. I add some peppers for extra veg, and it's become one of my and my OH's favourites 🙂\n\nhttps://t.co/eqzncMYX3H"], ["coconut curry chicken", 172477667, "Friday, February 7:\n\nHOT BAR: Coconut Curry Chicken; Tofu &amp; Baby Bok Choy; Basmati Rice With Leeks; Zucchini &amp; Squash; Roasted Brussels Sprouts\n\nSOUP: White Bean &amp; Vegetable; Chicken Noodle\n\nDon’t forget about our salad bar, deli case and bakery items! https://t.co/YiVwOdAXNp"], ["coconut curry chicken", 2473023680, "Tonight's menu for @SurplusMCR is sounding A-MA-ZING 😁 Chef Laurence is promising... Bang Bang Cauliflower, slow cooked poutine gravy with chicken &amp; bacon, &amp; super creamy coconut cauliflower curry with spicy herb chutney.... AND, hot gooey brownies!! 😍"], ["coconut curry chicken", 477076362, "A slight #fb to my 1st home cooked meal of the year. \n\nCoconut curry chicken, veg rice and dhal puri (didn't make the skin but food slap so hard it ask me what is Chefette)\n\n#foodie #catering @DIsBakeryCater https://t.co/mEfqJ10vHh"], ["coconut curry chicken", 138934997, "RT @EdibleSB: Pulled Masala Chicken Taco Bowls with Fresh Mango Peach Relish\nhttps://t.co/suREcpzaza  (via @CambriaWines ) \n\ntender, juicy…"], ["coconut curry chicken", 363718842, "Meet the world famous cook 😋 coconut rice with chicken curry https://t.co/j0HAlINeb2"], ["coconut curry chicken", 87989672, "RT @EdibleSB: Pulled Masala Chicken Taco Bowls with Fresh Mango Peach Relish\nhttps://t.co/suREcpzaza  (via @CambriaWines ) \n\ntender, juicy…"], ["coconut curry chicken", 58081751, "RT @goddesscallie3: @DirkHooper This is one of the best Keto receptors when you are craving a take out https://t.co/qJH4XVwvuz"], ["coconut curry chicken", 8065592, "Taken from the Rasika cookbook, this green curry chicken has many virtues, of which its balance between fiery cilantro paste and creamy coconut milk with ground cardamom, cinnamon, and cloves ranks highest. But I’m… https://t.co/WHVUuiKOI7"], ["coconut curry chicken", 151874368, "Dinner was yummy. I used a turkey broth reduction and one can of low fat coconut milk as a substitute for a can of full fat coconut milk. https://t.co/1IUBIStmyd"], ["coconut curry chicken", 2968659898, "@MrMake1tHappen should do a creamy coconut curry chicken recipe"], ["coconut curry chicken", 808435945, "Just spent 2 hours making coconut curry chicken, ate 3 bites and I’m full. I miss my mom"], ["coconut curry chicken", 261456825, "@brianthehuman https://t.co/CVnzfUiXmW real good but I've only made w/ instapot so if you don't have one no guarantees"], ["coconut curry chicken", 4740042001, "RT @everydaypewpew: People who watch BA are thinking coconut chicken curry is somali food smh...this is why representation does NOT bang"], ["coconut curry chicken", 4732127055, "I made !!! \nCoconut Curry with rice noodles and chicken. https://t.co/sH13iVHCx5"], ["coconut curry chicken", 1224042594172329986, "@DirkHooper This is one of the best Keto receptors when you are craving a take out https://t.co/qJH4XVwvuz"], ["coconut curry chicken", 1976977880, "What dinner looks like beef soup for me (aka comfort food) and garlic mashed potatoes with coconut curry chicken for bae https://t.co/WDUuzq6crs"], ["coconut curry chicken", 392394871, "@ashiashay @littleblueyes2 I’ll often make an easy satay sauce by mixing cashew butter or peanut butter, adding in soy sauce or coconut aminos, and few shakes of curry powder and mix it with rice and top with chicken and veggies 😋"], ["coconut curry chicken", 40851610, "RT @everydaypewpew: People who watch BA are thinking coconut chicken curry is somali food smh...this is why representation does NOT bang"], ["coconut curry chicken", 160551793, "#glutenfree #dairyfree - Chicken Madras \nCooked in hot coconut curry with mustard seeds, ginger and curry leaf (med spicy)\nOur #restaurant is the prime choice for those with #specialdietary needs, featuring menu with… https://t.co/3AOLIGHvlx"], ["coconut curry chicken", 45808825, "Dinner Carmichael: Grilled Beef Tips Citrus Chipotle BBQ, Indian Chicken Vindaloo, Baked Manicotti (V), Dal Makhani, VG Roasted Red Curry Coconut Tofu, Balanced Plate: Blackened Redfish w/Mashed Yucca+Corn Salad w/Queso, VG Indian Samosa, Large Round Raviolis, Broccoli al Forno"], ["coconut curry chicken", 39055265, "Just a weird FYI, Saffrom Roads coconut chicken curry and Grillos pickles go together really amazingly."], ["coconut curry chicken", 2424145308, "People who watch BA are thinking coconut chicken curry is somali food smh...this is why representation does NOT bang"], ["coconut curry chicken", 3418770965, "Dinner was banging tonight!! 💚💥 I turned some leftover #coriander stalks, #prawns, #chicken and homemade #Basa #Gede #Indonesian curry paste into some Balinese inspired coconut curried noodles 💥💚✨ YASS!! ❤️ https://t.co/sXvu2a6xDK"], ["coconut curry chicken", 76245147, "I did a California twist on the already incredibly tasty Thai coconut yellow curry. Chicken plus roasted eggplant, red bell peppers, and black beans will have you wanting more. I served it with fluffed basmati rice and a boiled egg. https://t.co/KijIJEok9P"], ["coconut curry chicken", 1040167632, "\"Khao Soi Gai (Northern Thai Coconut-Curry Noodles With Chicken)\" by Daniela Galarza via NYT https://t.co/AK1S2rTnly"], ["coconut curry chicken", 1979213142, "@Arc19792 I didn't really use one haha just gathered chicken and vegetables, cooked them up, and then you can buy panang curry paste in any grocery store! and grab some coconut milk and fish sauce and you are set for an easy curry meal :3"], ["coconut curry chicken", 862821999902572544, "Physician food chronicles cont'd\n\nLove this lounge!\n\nIsland curry chicken, Haitian shrimp creole, mango coconut rice, callaloo, okra and tomatoes, mango chutney\n\nDessert is undecided... Plantains? Flan? Tres leches?\n\n#somedocs\n#medtwitter https://t.co/exnmxFUQ7Q"], ["coconut curry chicken", 1149639789932613632, "@tyler_casper Coconut curry chicken with cauliflower rice."], ["coconut curry chicken", 959469388968574976, "RT @urbanfoxesjxn: Just like Mary Chapin Carpenter, we feel lucky. \n\nchoc chip scones \nham and parm scones\nblueberry scones (veg)\ntres lech…"], ["coconut curry chicken", 405811027, "RT @urbanfoxesjxn: Just like Mary Chapin Carpenter, we feel lucky. \n\nchoc chip scones \nham and parm scones\nblueberry scones (veg)\ntres lech…"], ["coconut curry chicken", 1125960338166439937, "Just like Mary Chapin Carpenter, we feel lucky. \n\nchoc chip scones \nham and parm scones\nblueberry scones (veg)\ntres leches poundcake \nsausage rolls \npecan pie \ncoconut pie \nlemon icebox pie \ngood grief PB pie \nchicken curry pie\ntea cakes\ndbl choc cookies \noatmeal currant cookies"], ["coconut curry chicken", 272059169, "@MadamePrez Chicken Thai curry: sautee  chcicken, add paste, add veg and coconut milk and fish sauce and lime juice and some chix stock. Chile sauce on side"], ["coconut curry chicken", 822439129925451776, "Our Sri Lankan chicken mango and coconut curry with sticky rice and wok fried seasonal greens \n#mealprep #fitness #food #foodie #nutrition #chef https://t.co/fBRIL4jLiX"], ["coconut curry chicken", 65495016, "I hope it's coconut chicken curry 🤤🤤🤤 https://t.co/cMv1B40Yws"], ["coconut curry chicken", 965686885, "I am watching grills grocery games a lady who made a complicated Jamaican coconut curry dish lost to a lady who made chicken enchiladas! Are you kidding me!? Because 1 guy said there was not enough salt! People have different preferences on how much salt should be in a dish."], ["coconut curry chicken", 2610117558, "We're so excited to introduce this new dish in next week's delivery. Our Thai Red Coconut Curry Chicken is packed with fresh veggies and just the right amount of heat. Get your order in today by 5PM at https://t.co/9EWMmtoIwQ. #EatSmartRVA #healthyeating https://t.co/HGkvizitPT"], ["coconut curry chicken", 199550630, "Lentil brown rice, broccolini, grilled chicken and coconut curry sauce https://t.co/tD2MXQjStP"], ["coconut curry chicken", 394286884, "Amazing Dragon Master Noodles. Rob made it perfectly! Coconut chicken curry with fresh veg! #JeepsAndEats #ErinsDemonDishes https://t.co/lDXTuFbh62"], ["coconut curry chicken", 733432147214635008, "Thai red curry finished. \n\nBase: Chicken stock, lemongrass, roasted garlic, roasted ginger, gochujang \n\nAdded in: Lime, Scallions, Seasoned Chicken Breast, Coconut milk, red pepper, roasted red curry paste https://t.co/bKi6p8LeSQ"]]