[["cod curry", 27393275, "Why is all cooks who come from India only cook curry ...\nI want to go to India on indian TV and only cook cod &amp; chips . .see how they like it"], ["cod curry", 1293836893, "@sumostevenson 1. Bluff oysters (what else?!) 2. Fresh blue cod. 3. Paua fritters. 4. Homemade curry roll. Forget the rest, even the chips dont count."], ["cod curry", 938143960031211520, "@ConchaArgie This is fried cod fish with potatoes, and curry sauce with mushed peas :)"], ["cod curry", 19526903, "@Nariokotomeboy I used to like Hanbury's in Babbacombe but it's been 15 years since my last cod and large. It could have burned down for all I know. Or become a trendy wine bar. Worse.\nWhat's your curry recommendation?  I've tried the Ganges already."], ["cod curry", 2960344252, "@AlasdairStuart Lol I usually eat the cod first. The hollow batter becomes a scoop for the curry sauce. 😂😂 Best bit!"], ["cod curry", 357908524, "@TheACCnz If the wicket is going to break up on the 5th day, the first one in is a Curry Roll. A non-factory-processed Corn Pattie would add an element of surprise they wouldn’t expect. Middle order must comprise of Snapper, Groper, Blue Cod. Would open with a sausage."], ["cod curry", 2398581415, "I need a new curry this blend not quite it"], ["cod curry", 3367797575, "I made red Thai curry with cod, bok choy and zucchini and it was amazing"], ["cod curry", 2398581415, "This curry chicken finna slap"], ["cod curry", 760876486157033473, "RT @Menstriebhoy: Nice lunch today @houseoftides snacks were a good a good start to the meal. Flrst up was a Baba Ganoush with a nice curry…"], ["cod curry", 701491647742234625, "RT @golatschen: Hosting someone from an alpine republic so it’s matzo ball soup with dill, tandoori samosas with potato and peas, cod curry…"], ["cod curry", 5618162, "RT @golatschen: Hosting someone from an alpine republic so it’s matzo ball soup with dill, tandoori samosas with potato and peas, cod curry…"], ["cod curry", 301689799, "RT @golatschen: Hosting someone from an alpine republic so it’s matzo ball soup with dill, tandoori samosas with potato and peas, cod curry…"], ["cod curry", 1894628912, "RT @Menstriebhoy: Nice lunch today @houseoftides snacks were a good a good start to the meal. Flrst up was a Baba Ganoush with a nice curry…"], ["cod curry", 228395083, "Nice lunch today @houseoftides snacks were a good a good start to the meal. Flrst up was a Baba Ganoush with a nice curry flavour, cod roe with compressed apple and a fatty tasting but flavourful beef tartare https://t.co/Ym6X3SM23G"], ["cod curry", 1192883985967386625, "Absolutely sublime and synergistic with cod and coconut curry, red rice and sauce vierge. Not that anybody who reads this is interested! https://t.co/7Tg2RcbAIb"], ["cod curry", 2414105232, "#Repost nikkigreg123 with @get_repost\n・・・\nWorking on fish courses for next week \"chip shop curry cod \" chip shop curry (chicken based) cauliflower, mussels , scraps made with mussel puree and vinegar powder,  onion… https://t.co/G6ZlIOjGGa"], ["cod curry", 55502576, "@Marwood1987 I’ve just eaten exactly the same thing! Cod, chips and curry sauce! #FuckBrexit 😂"], ["cod curry", 894015733, "@Barrymore_Jones Was unreal mate cheap aswell. Massive cod chips and curry can a Dr Pepper to wash it down. 10/10"], ["cod curry", 961293703, "Coconut Green Curry Mussels today! \n\nTomato Soup w. Goat Cheese, Croutons &amp; Scallions\n\nHerb Broiled Cod w. Warm Yam &amp; Chickpea Salad, Crispy Polenta, Tomato Confit\n\nSandwich is Ham &amp; Swiss on Focaccia w. Honey-Dijon Aioli"], ["cod curry", 2369289619, "Hosting someone from an alpine republic so it’s matzo ball soup with dill, tandoori samosas with potato and peas, cod curry and rice and *all* the organic tangerines #tweetyourshabbat"], ["cod curry", 175307219, "Yes, I'm done, at 11:55. Seriously tho: good chips, loads of curry sauce with big umami hit and hint of Sichuan pepper-type heat, two fists of perfectly fried battered cod and a mini rissole. Change from 4 quid. #FridayFeeling"], ["cod curry", 1204102892594053122, "@GameSpot Just leave a year or two between games. I know this current model works quite well, but there’s a reason there was a soft-reboot of the MW series: you needed to curry favour with old fans. I mean, I’m loving this current CoD, but don’t let it become stale again."], ["cod curry", 1499383375, "On tomorrow's specials list:\nGoan Lamb Vindaloo,\nMedium-Hot Parsee Chicken Curry Mumbai,\nChicken Cordon Bleu with Smoked Ham, Gruyere Cheese and Tomato Sauce,\nLamb Burger With Goats Cheese,\nNorth Atlantic Cod Suprerme,\nRolled Chorizo &amp; Sage Pork Belly,\n\nhttps://t.co/tbH806OcuC https://t.co/qXjWobRcMB"], ["cod curry", 1220134001278701568, "I made this Burrito with Cod goujons and sauerkraut on curry sauce and called it 'Taj Platter' because it also has thin crust."], ["cod curry", 888048091395444738, "RT @AMummyToo: If you love classic chip shop cod and chips with curry sauce and mushy peas, you’ll go wild for these cod and chips crusty r…"], ["cod curry", 839782991094218752, "Spice up your fish &amp; try one the new dishes on our Flexitarian menu - North Sea cod, mussels &amp; vadouvan curry sauce and roasted cauliflower 😋 https://t.co/vChKbkJWcl"], ["cod curry", 363823267, "If you love classic chip shop cod and chips with curry sauce and mushy peas, you’ll go wild for these cod and chips crusty rolls! https://t.co/9vsOccHRXL https://t.co/S13rsW2Dj6"], ["cod curry", 3269398848, "•Crispy Tortilla Chips\n•Penne Pasta\n•Cheese Pizza\n•Sundried Tomato Salami Chèvre Pizza\n•Italian Sausage Flatbread\n•Italian Rubbed Chicken\n•Grill:\n1. Crispy Cod Sandwich\n2. Steak Cut French Fries\n•Soup:\n1. Caribbean Beef Curry Soup\n2. Broccoli Cheddar Soup"], ["cod curry", 930559740157063169, "@MCRQoorRema I think it means that if Paul's colleagues invite him out for a curry he tells them to 'do one' and then goes home and 'batters his cod' over a plate of fish and chips x"], ["cod curry", 751645555, "Cod bengali curry with home grown tomatoes https://t.co/BWzLDAsSKu"], ["cod curry", 20727492, "Lunch today: berbere and white wine citrus reduction over pan seared cod with lemon zucchini and curry orzo https://t.co/N82OVEFBwx"], ["cod curry", 2767148298, "@PFJReaper Nah, cod with shitloads of carrots and peas in curry sauce"], ["cod curry", 1111267528117047296, "Tonight’s dinner is prepared. Tonight we having a cod curry 🍛 with Bombay potatoes a nice simple on plan meal we can both share. I have pre cooked the cod ready to add later. I opted for the potatoes over the rice 🍚 #yum https://t.co/z7vQ05OrmS"]]