[["coffee protein shake", 1222275453605634050, "@ovran0s I forgot to add coconut water, coffee , protein shake"], ["coffee protein shake", 785235294060544000, "@Muramasa1285 @SirTremendous That's pretty much been my diet for the last 7 years.\nI might have a protein shake or an extra litre of water with my lunchtime coffee, but that's about it."], ["coffee protein shake", 321739280, "@tyler_casper Water or a protein shake. I don’t like coffee."], ["coffee protein shake", 606975421, "I mixed this vanilla protein shake w/ peanut butter it and it taste like coffee . I don’t know how to feel 🤔"], ["coffee protein shake", 1465580611, "Me: I'm going to go to bed early\nMe: *adds coffee to the protein shake that already has caffeine*\nMe: *drinks it at 7*"], ["coffee protein shake", 607206814, "@keily_blair Coffee, tea, a protein shake, or whiskey, depending on what time of day I finally settle in to write."], ["coffee protein shake", 12025272, "RT @draffauf: Perfect post workout meal/shake:\n\n- 1 small banana\n- 1 large tablespoon of peanut butter\n- 1 cup of strawberry chobani\n- 2 sc…"], ["coffee protein shake", 1188892402834165762, "All I’ve had today was a little bit of protein shake, black coffee, and two packets of peanut butter crackers and my body’s like “k yeah cool we good”"], ["coffee protein shake", 1950420992, "RT @vannab3: Currently carrying a blender bottle for my protein shake, a hydroflask for my water &amp; a starbucks straw cup for my coffee i li…"], ["coffee protein shake", 241703484, "Currently carrying a blender bottle for my protein shake, a hydroflask for my water &amp; a starbucks straw cup for my coffee i literally hate myself but were dedicated to that resusable cup life"], ["coffee protein shake", 477138704, "RT @GallagherPreach: Good morning!\n\nHere we go! The coffee cup is loaded the protein shake is ready, the vitamins are taken and the day is…"], ["coffee protein shake", 566800293, "thinking of replacing my morning coffee with a greens &amp; protein shake"], ["coffee protein shake", 16320523, "Good morning!\n\nHere we go! The coffee cup is loaded the protein shake is ready, the vitamins are taken and the day is bright.\n\nWhen you last thought about today, what did you picture?\n\nDid you picture chaos or success?\n\nDraw a visual picture of success and let's get started!"], ["coffee protein shake", 612603343, "@Andrew_Rotondi Protein shake &amp; a coffee. That's my guess."], ["coffee protein shake", 3022889282, "my coffee to protein shake ratio is mad off this morning.  fock."], ["coffee protein shake", 480876046, "Protein shake and coffee for breakfast.\n\n*10 mins later \n\n https://t.co/q5OwZBrJ2Z"], ["coffee protein shake", 1167706002, "I will have one coffee and one protein shake this morning. Nothing more, nothing else. 😩 #discipline"], ["coffee protein shake", 731157573378920448, "@M0_Snake Wallah it’s my first time drinking coffee in 3-4 years but I did try it in the morning yesterday and it banged in ma banana protein shake"], ["coffee protein shake", 1197197370016063489, "RT @Goddess8Brooke: No coffee today, reimburse My protein shake &amp; bang $8"], ["coffee protein shake", 1103751125851877376, "yesterday \n- owyn protein shake\n- coffee\n- pressed juicery chocolate oat milk"], ["coffee protein shake", 17079694, "@tanyarezak Weekday: effectively a chocolate protein shake with some decaf instant coffee in it. Maybe I’ll add a banana if I have one.\n\nWeekend: A big pile of vegetables and some sort of protein as well as aforementioned shake."], ["coffee protein shake", 221192199, "I’m trying to stay away from coffee except for the kind in my protein shake."], ["coffee protein shake", 746122696807747584, "@Mr_RSmash my usual go to is 1/2 cup of oatmeal with maple syrup and crunchy peanut butter and two eggs over medium. i enjoy a nice omelette or breakfast burrito when i can get it. if i'm in a rush i'll just make a whey protein shake or coffee though."], ["coffee protein shake", 1068919117669781504, "Day 1 of weight loss: I drank a protein shake for breakfast and had half a protein bar for a snack. Did a 15 min walk on my break and of course had coffee...... send help!!!! I don’t think I’m going to make it !!!! #weightlossjourney #momlife #workmom"], ["coffee protein shake", 1142150720940138496, "i put half a pint of halo top in this coffee protein shake and it still tastes like straight ass"], ["coffee protein shake", 1150555848776781824, "No coffee today, reimburse My protein shake &amp; bang $8"], ["coffee protein shake", 15661992, "Cafe Latte Protein Shake \nIngredients: \n• 1 scoop Shaklee Life Shake, Café Latte flavor \n• 1 scoop Shaklee Life Shake, Chocolate flavor \n• 8 oz non-fat milk (low-fat soy milk can also be used) \n• 1/4 tsp instant coffee \n• Ice (as needed)\n\nhttps://t.co/hdJzb7Zi81 https://t.co/3pITxW78H9"], ["coffee protein shake", 131182080, "RT @SweetlySays: SWEETLY Iced Coffee Shake Frappé\n\nTake two scoops of SWEETLY Iced Coffee Protein Shake Powder 💥\n\nAdd it to a blender or @N…"], ["coffee protein shake", 1068131568152207361, "SWEETLY Iced Coffee Shake Frappé\n\nTake two scoops of SWEETLY Iced Coffee Protein Shake Powder 💥\n\nAdd it to a blender or @NutriBulletSA with 200 ml of milk (or half milk, half water) 🥛\n\nAdd 5 blocks of ice and blend 💫\n\nFor an extra kick add a shot of cooled espresso!😁\n\nEnjoy! https://t.co/LF9vKN6Zfq"], ["coffee protein shake", 565138590, "coffee+protein shake= top tier"], ["coffee protein shake", 3885519140, "I'm currently drinking a protein shake that I poured into iced coffee and eating a protein bar so y'all better watch OUT"]]