[["cucumber raita", 322278274, "@TheFluxSystem All of them can be served with rice and/or bread and/or poppodoms. And mango chutney or lime pickle, I used to buy a jar when I could afford it and eke it out in teaspoons. An easy raita is coconut yoghurt with garlic, lemon juice, cilantro, and diced cucumber. 5/"], ["cucumber raita", 381799081, "Have you had a chance to try our new menu?! This is our delicious Beverly Creek Lamb dish. A pan seared lamb sirloin and curried lamb shoulder served with pressed aloo gobi, mint raita, cucumber and cilantro. The perfect combination of flavours. https://t.co/D9nKkoiDM5"], ["cucumber raita", 46225431, "Indian spiced lamb koftas with raita and cucumber new on the evening menu at Mrs foggs next week!!! @mrfoggsgb https://t.co/YKOIJ70mNK"], ["cucumber raita", 611779481, "RT @Josmile123: Home made chicken in a red pepper sauce by Madhur Jaffrey, vegetable pilau, cucumber raita and carrot salad, amazing! https…"], ["cucumber raita", 187868526, "Home made chicken in a red pepper sauce by Madhur Jaffrey, vegetable pilau, cucumber raita and carrot salad, amazing! https://t.co/lV5SgLXeDo"], ["cucumber raita", 603134640, "RT @Cripps91: Roasted Cauliflower and a cooling cucumber raita to complement the extreme chilli paste. @carringtonskent\nAbsolutely deliciou…"], ["cucumber raita", 1179064946740678660, "Lamb koftas with cucumber raita. Love has struck. #JaxCatering\n\nhttps://t.co/aaXu16OxOx https://t.co/EH8AsZYI1N"], ["cucumber raita", 2171322028, "I asked last week for suggestions for healthy low/no salt dishes for my 5th yrs &amp; here’s what they made! Thai spiced beef wraps, rainbow rice &amp; cucumber raita. Homemade Thai red curry paste was a real taste sensation! Plenty of fresh herbs added flavour too so no need for salt! https://t.co/qotF5ybLPz"], ["cucumber raita", 729701092901163008, "RT @prashantgaur4: @LoriShemek @onelilndn1 @EhimaOziegbe Mix cucumber(after peeling) with fresh made curd. Awesome nutrient rich addition t…"], ["cucumber raita", 364283535, "@LoriShemek @onelilndn1 @EhimaOziegbe Mix cucumber(after peeling) with fresh made curd. Awesome nutrient rich addition to your gut. We called it cucumber raita."], ["cucumber raita", 172080105, "Roasted Cauliflower and a cooling cucumber raita to complement the extreme chilli paste. @carringtonskent\nAbsolutely delicious with a little rocket and toasted cashews 🌶️🌶️\n#mondaymeals #cashewnuts\n#cucumberraita… https://t.co/EL6w701Vlh"], ["cucumber raita", 2892003534, "RT @RajeshwariGowd: And then I decide to cook 👩‍🍳 \nVeg pakora,Soya peas pulao,Chilli Garlic sauce &amp; Cucumber raita 🍴 \n-What’s your way of l…"], ["cucumber raita", 1481733547, "RT @PetulaElkindiy: Made pilau and some cucumber raita  for dinner!! I’m soooooo proud\n\nI’m ready for marriage now 😂"], ["cucumber raita", 589123895, "Soo Good Breakfast for today 😋😍\n.\n➡️ French Beans Aloo Sabzi + Cucumber Raita 🤤 + Tawa Roti 😋 👌🏻.\n.\n.\n#foodie #food #foodstagram #foodporn #vegitarianfood #vegan #veganrecipes #Winters #loveforfood #instafood… https://t.co/eFZUxTEZMZ"], ["cucumber raita", 61593337, "@AnOldWombat @jazzibemoody @SistatodaMoon @NickStopTalking @BabbyUnit Is that why they serve raita with curries...you know, mint, yogurt and cucumber 🤷‍♀️🤷‍♀️🤷‍♀️"], ["cucumber raita", 26233912, "@GordonRamsay \nWhat do you think about this?Surati home cooked meal by my wife for Award winning Chef’s. •Undhiyu, Sanang ni Dal,Mustard Dahi Vada,Banana Cucumber Raita,Green Chana,Osaaman,Leelva Kachori,Biranj,2layers Roti &amp; Vedmi (Sweet Lentil Roti.) I’m sure you’ll like it. https://t.co/HyY5BQ9SGz"], ["cucumber raita", 1022127006689837056, "@fayedsouza Dum chicken or mutton ,biryani I make at home with my own innovation. With mixed veg or cucumber raita with mixed veg pickle."], ["cucumber raita", 3355219000, "RT @LazyLeekCardiff: **Sunday Special** Indian spiced cauli bites, coriander cafreal, beet raita, rainbow 'slaw, cucumber ribbons, pickled…"], ["cucumber raita", 933757051712532480, "**Sunday Special** Indian spiced cauli bites, coriander cafreal, beet raita, rainbow 'slaw, cucumber ribbons, pickled chillies, Bombay mix, coriander, mango chutney. Give us a call on 02920 225270 to order! #pontcanna #eattherainbow #plantbased https://t.co/u9YWTkoQQj"], ["cucumber raita", 307190181, "@AnOldWombat @SistatodaMoon @NickStopTalking @BabbyUnit Yes, that is why most(?) Indian meals also have raita - yoghurt base with grated cucumber. Cools the scorch. 👍"], ["cucumber raita", 378676043, "@SistatodaMoon @AnOldWombat @NickStopTalking @BabbyUnit I never eat Indian food without raita. Yogurt, cucumber and a little mint. Delicious and cooling on the palate."], ["cucumber raita", 4030601172, "@SistatodaMoon @AnOldWombat @NickStopTalking @BabbyUnit Cucumber is the best for soothing. Hence Indian cuisine has Raita which is a mix of cukes and yoghurt. It helps to cool the palette."], ["cucumber raita", 960917421346271232, "Thali heaven at the Anaheim Packing House featuring vegetable curry, basmati rice, garlic naan, dal makhni, cucumber raita, salad and an IPA at lunch because vacation. Not ready to be back in rain and gloom. https://t.co/aVwQEyKEsq https://t.co/1if7d3rfVG"], ["cucumber raita", 906738613941100545, "@Lambda_Merc Hi there! I'm gonna have to disagree, mint chutney is thicker and green, maybe you were thinking of sweet chutney (contains dates) or tamarind chutney? Raita is yogurt based, but I'd expect to see finely diced onions/tomatoes/cucumber in it if it was so. Still, thanks for (1/2)"], ["cucumber raita", 48525566, "@nomstrositi You should really get some some cucumber raita to cool down that butter chicken and plain naan so you can eat it"], ["cucumber raita", 1069811469020160000, "@ebruenig rogan josh is always a good one. an indian friend of mine introduced me to the idea of mixing raita (a cucumber yogurt) in curries, and it works really well."], ["cucumber raita", 76041439, "Made pilau and some cucumber raita  for dinner!! I’m soooooo proud\n\nI’m ready for marriage now 😂"], ["cucumber raita", 890455572, "RT @Spicyndtangy: Daliya .. cucumber raita ..Amla pickle ND mirchi\nhealthy food \nAs not keeping well 😊\n\n #spicyndtangy #foodies  #macroni #…"], ["cucumber raita", 137998568, "@LolaPlusG @gerardwayvibes Have you tried raita? \n\nMainly yogurt, cucumber, and tomato. \n\nIt's flavoured with cumin, salt, coriander, and sometimes a bit of chili.\n\nIt's meant to be a cooling condiment to spicy Indian food but I can eat it plain.. my favourite salad type thing. https://t.co/z3j8AMhnNj"], ["cucumber raita", 1220379789623730182, "Enjoy delicious Paneer bhurji with Kulcha and  Cucumber raita."], ["cucumber raita", 2482777881, "Curried Sweet Potato Fries &amp; Cucumber Raita — Tin Roof Cooking https://t.co/WHRVt7YrPR https://t.co/UeVOlxw38k"], ["cucumber raita", 895547228554702849, "Martin says this is one of the best curry nights I’ve done. We have some chicken tikka masala, aloo gobi, rice, cucumber raita, onion salad and lentils. His plate, and my plate. https://t.co/5JBBcGPYUP"]]