[["curried peas", 780758635588706304, "@CabritoGoatMeat I love goat! But only ever had curried goat and rice and peas... assuming there are some good recipes on your website? I’m keen on this..."], ["curried peas", 1215949153630588928, "so we’re doing as much vegan/veg dining as possible these days, and tonight we made a rice pilaf topped w curried greens and chick peas. i think i’m going to be completely fine revamping the ol’ diet. \n\ncuz it was dank and i fux w dank food."], ["curried peas", 57056240, "Not on board with this Deeney diet.\nNo rice and peas, curried goat, fried dumpling, plantain, washed down with Appleton's. https://t.co/XgryJA8DKy"], ["curried peas", 829839225491124224, "Vegetable Masala Enchiladas 💫🌱 cauliflower, broccoli, peas, curried coconut, green garlic, panch phoron and herbs. https://t.co/ZcblFmVYVC"], ["curried peas", 3302912409, "Curried mushy peas. #UKwind"], ["curried peas", 2169336999, "#meatlessmonday with @gilsimmons @jocelynmaminta and @AlyssaRaeTaglia on @wtnh #wfpb #recipe below! I love Mondays!!\nCurried Spinach and Chic Peas \n Coconut curried Spinach and chic peas\n\n1 onion chopped\n3-4 cloves… https://t.co/fRe4bQXiHE"], ["curried peas", 1179371223182184449, "RT @giyuusdrip: @dominicanamjoon *clears throat*  when my family gets it, our go to dishes are tibs which is stewed/ sautéd beef, tekkel go…"], ["curried peas", 762865974185857034, "@dominicanamjoon *clears throat*  when my family gets it, our go to dishes are tibs which is stewed/ sautéd beef, tekkel gomen is curried vegetables, doro alicha is a stewed chicken, and kik alicha is just split peas. https://t.co/RSBTbMSo6m"], ["curried peas", 552989659, "RT @OriginalFlava_: Our BACK2BACK Vegan 🌱 supperclub Special was a Huge Success! Thank you to everyone who came out! \nCheck out the main di…"], ["curried peas", 1121377434, "RT @OriginalFlava_: Our BACK2BACK Vegan 🌱 supperclub Special was a Huge Success! Thank you to everyone who came out! \nCheck out the main di…"], ["curried peas", 20750954, "@Son_of_Albion I love curried goat. First had it at Chapletown Carnival with rice and peas. Yum"], ["curried peas", 1102820127022764032, "Last night I had jerk tofu, curried chickpeas, fried plaintain, sweetcorn fritters and coconut rice n peas followed by coconut ice cream. The vegan menu in turtle bay right now is substantial. My friends had the fried chicken style burger and said it was the best they’ve ever had https://t.co/Agbi0VKUDp"], ["curried peas", 2482753710, "RT @CurryCrew: Today's lunch. Curried butter beans and chick peas with onions, garlic, and red peppers. Who says #vegan food cannot be deli…"], ["curried peas", 80831131, "Today's lunch. Curried butter beans and chick peas with onions, garlic, and red peppers. Who says #vegan food cannot be delicious? #curry https://t.co/bndFV7bFjF"], ["curried peas", 49181470, "@DKAstrology Vege lasagne is served only a Friday though. Throughout the week you can get Tofu (pineapple, sweet sour, BBQ), vege mince and pasta, veggie chunks, curried chick peas, black beans, veggie stew, different vegetable patties and soups"], ["curried peas", 897628804931244032, "Today's lunch is curried ground beef with peas and potatoes. Not the best."], ["curried peas", 257114173, "height            : 5’10\nage                 : 25\nshoe size       : 9 women\nzodiac            : Scorpio\ntattoos           : 7\npiercings       : 7\nfav drink        : lemonade\nfav food         : curried chick peas\nfav animal     : orcas https://t.co/YUV3wvWWD2"], ["curried peas", 306962286, "Come home to curried goat, stew chicken and rice and peas. I serve a living God 😭"], ["curried peas", 568545391, "Wife has asked me to cook authentic Caribbean food for our friends tomorrow, I never need a excuse to cook Jerk chicken, curried lamb, dumplings and rice and peas...cha"], ["curried peas", 1219637110107525120, "Introducing something NEW... 'Turkey Kheema'.\nEvery Thursday. This curried Turkey mince and fresh Petit Pois Peas is packed with zingy flavours and spices. Served with Rice and Fiery Pickle. Low calorie and filling. \n#homemadefood #telfordtakeaway #healthyfood #glutenfree https://t.co/PFrVh9IUeO"], ["curried peas", 45808825, "Lunch Carmichael: Pasta Fagioli Soup (V), Bowtie Pasta w/Peas/Asparagus+Pancetta, Chicken Meatball Sub, Charro Pasta w/Avocado, VG Curried Cauliflower+Chickpeas, Cream of Tomato Soup, Cheddar Grilled Cheese, Burrito Bar, Cajun Corn, Fresh Zucchini"]]