[["curry fried rice", 7152302, "Chilli fried duck egg with tomato and coconut curry sauce (which I made last night), brown rice flour crusted fried tofu, curry leaves and coriander.\n\nHello, Friday! https://t.co/4OhYN9XeuP"], ["curry fried rice", 1194183056506015745, "#Beef_Coconut_fry is cooked with #spices and then stir-fried with #coconut #slices and #curry leaves is #delicious #appetizer or a great side-#dish with rice. #Beef #Varattiyathu is one of the #favourite #dishes of #Malayalees across the globe. https://t.co/k6rkCknoeR https://t.co/7WTH3QcxTP"], ["curry fried rice", 985356908138647552, "RT @Peterhynes15: Me: Do you want a Chinese for dinner Chloe.\n\nDaughter: No Dad coz I don't want to get the Conor virus\n\nMe: 🤔 The Conor vi…"], ["curry fried rice", 4659550713, "@JamesLoganj2 Curry fried rice n onions ?"], ["curry fried rice", 2270215261, "RT @sftmumbai: Cooked a mini meal for guest's who visited today!\nShakarai Pongal/Sweet Pongal, Bisibelebath, Thayir pachadi, Potato Peas Cu…"], ["curry fried rice", 1267330922, "@macaronvivi @loonatheworld @loonatheworld fried rice, fried chicken, pizza, spaghetti, rendang, chicken curry, chicken balado, burger, candy, fish curry #LOONAMentionParty2"], ["curry fried rice", 601416667, "@writingnewman @delaneypv15 @tacos1986 @KingTacoCaters As a lifelong Angeleno, the list above is great. Also, Thai is renowned in LA. Thai BBQ on Hollywood Blvd or Natalee Thai in Beverly Hills or Venice (thai ribs as a side + yellow curry, pad Thai or pad see ew). Tatsu Ramen will blow your mind (bold ramen w side of fried rice!)"], ["curry fried rice", 3464639483, "I want some Jamaican food so bad! Like some good as jerk or curry chicken, rice, cabbage and fried plantains🤤🤤"], ["curry fried rice", 325206528, "@paradoxiiiii What's your poison? I used to always get chicken fried rice but my local place has a really good curry chicken."], ["curry fried rice", 920238196977557504, "Was chatting up this chinki and she came back to mines the night. She was like “what do you want” and a said “a want to 69” She got out of bed and dissapeared for 15 minutes and came back wae 2 king prawn &amp; black bean curry’s and egg fried rice. Last time a ask a chinki to 69 🤣"], ["curry fried rice", 424511169, "@LNBDublin @TadhgHickey @NiallSF So I had a house special curry and fried rice with a nice cold bottle of Corona 😃"], ["curry fried rice", 1002559582734938113, "@HeavyWoodenBox Fried curry rice and chicken with something creamy sauce.hehe"]]