[["curried chicken and rice", 822439129925451776, "Slow cooked tikka chicken thighs, coconut basmati rice and masala curried cream \n#mealprep #fitness #food #foodie #curry #nutrition #fitfam #eating #chef @ Liverpool https://t.co/3Lq4aWRr4A"], ["curried chicken and rice", 527255691, "RT @StanbicKE: @ombachi Then add in the chicken cubes and mix coating well with the curried tomatoes onions mixture, pour in the coconut cr…"], ["curried chicken and rice", 1223966902956982272, "RT @RemzTheAwesome: Curried chicken and rice"], ["curried chicken and rice", 146255069, "Curried chicken and rice https://t.co/tKHJMgnOOZ"], ["curried chicken and rice", 2481284955, "RT @StanbicKE: @ombachi Then add in the chicken cubes and mix coating well with the curried tomatoes onions mixture, pour in the coconut cr…"], ["curried chicken and rice", 2561297364, "@ombachi Then add in the chicken cubes and mix coating well with the curried tomatoes onions mixture, pour in the coconut cream and one cup of water, cook on a high for 20-25 mins until the chicken is completely cooked. Serve over white rice and some flatbread."], ["curried chicken and rice", 1202414390932365312, "RT @legen_daryanime: @FabzYoung I'm from the Caribbean so if you like seafood I could do curried crab and dumplings or sweet and sour chick…"], ["curried chicken and rice", 481645544, "Specials for today are...\nCurry craze: butter chicken and coconut curried sweet potato &amp; kale, served over basmati rice...$14 incl tax\nSoup: Mediterranean sausage w/ lentils &amp; kale OR Chinese... more at https://t.co/HptrcshBmQ"], ["curried chicken and rice", 84078727, "RT @WESTonTheGreen: Today's Soups: Chicken &amp; Rice or Curried Parsnip\nToday's Sandwiches: Chicken and smoked cheese toastie, Cheese and cara…"], ["curried chicken and rice", 4832865706, "Today's Soups: Chicken &amp; Rice or Curried Parsnip\nToday's Sandwiches: Chicken and smoked cheese toastie, Cheese and caramelised onion toastie\nToday's Brewers Lunch: Spätzle with pork ragu, parmesan and garlic bread\nToday's Challenge: Choosing what to have for lunch 🤷🏼‍♀️"], ["curried chicken and rice", 3292905291, "@buhlengoma_ Breakfast for me would be like an omelette with mushrooms and spinach or oats . Lunch - broccoli , grilled sweet potato and chicken . Dinner - curried chickpeas and brown rice . Those are like my go to things when I don’t really want to try lmao"], ["curried chicken and rice", 1146494839950913536, "@FabzYoung I'm from the Caribbean so if you like seafood I could do curried crab and dumplings or sweet and sour chicken with roasted vegetables and festival rice"], ["curried chicken and rice", 423089845, "@DKAstrology @tonio_nation And I eat curried chicken alone all the time. Zero rice. Zero food. Delish."], ["curried chicken and rice", 3400767185, "This Week's Specials:\n\nUnroll Bowl - Carrots, Cucumbers, Carrots with Chicken or Tofu over  Brown Rice with Sweet &amp; Sour and Hosin Sauce (GF, V Options)\n\nHarvest Orzo (Veg)\n\nCoconut Curried Squash Soup (GF, V) https://t.co/zUbyefTukt"], ["curried chicken and rice", 835369579, "@lauramariannea I'm awake, it's 7pm, real after work bong hours. Just cooking some curried chicken and rice while smoking up."], ["curried chicken and rice", 2336156754, "Curried shrimp white rice and stew chicken 😋👉🏾 Repost @icookeverything https://t.co/m5Cez08TYG"], ["curried chicken and rice", 846031842067304449, "@justin_ng @1maison_vie @TooGoodToGo_UK Love that app!  My best was from a Jamaican place last week, £2.66 for a whole fish on rice and salad, curried goat, jerk chicken, yet more rice, vegetables and a dumpling.  My husband says I'm obsessed 😂"], ["curried chicken and rice", 499263346, "Excuse the mess of my hob. All homemade with the help of @matmcdonough Tomatoe choka, roti, curried chicken and rice. 🇹🇹 https://t.co/b890XF8PnK"], ["curried chicken and rice", 1035942997580546052, "Tonight’s dinner of curried chicken and rice with cucumber yogurt on naan. https://t.co/XCaB6YEtQz"], ["curried chicken and rice", 753882267710320640, "I am making a traditional punjab curried chicken and jasmine rice, side salad and roti, is it wrong that i am tempted to have chips too? @KirstieMAllsopp"], ["curried chicken and rice", 1102820127022764032, "Last night I had jerk tofu, curried chickpeas, fried plaintain, sweetcorn fritters and coconut rice n peas followed by coconut ice cream. The vegan menu in turtle bay right now is substantial. My friends had the fried chicken style burger and said it was the best they’ve ever had https://t.co/Agbi0VKUDp"], ["curried chicken and rice", 71430356, "@john_macgowan What else would be on the menu: \nApricot chicken and rice.\nCurried sausages."], ["curried chicken and rice", 738228070478446592, "I tempted to eat my rice and curried chicken rn"], ["curried chicken and rice", 318988563, "@SeptembreA Lol I’m obviously a cheap date - either pizza or curried goat roti (with rice and beans and chicken dumpling soup) and Netflix 😂😂"], ["curried chicken and rice", 306962286, "Come home to curried goat, stew chicken and rice and peas. I serve a living God 😭"], ["curried chicken and rice", 568545391, "Wife has asked me to cook authentic Caribbean food for our friends tomorrow, I never need a excuse to cook Jerk chicken, curried lamb, dumplings and rice and peas...cha"], ["curried chicken and rice", 545354920, "RT @TitanyaTC: I got home and made some amazing curried chicken with pumpkin rice. I didn’t eat lunch bcuz I just wanted my cooking. 😍 #sim…"], ["curried chicken and rice", 444024616, "I got home and made some amazing curried chicken with pumpkin rice. I didn’t eat lunch bcuz I just wanted my cooking. 😍 #simplethings"], ["curried chicken and rice", 979811987843698688, "Smethwick CAN Cafe tomorrow @ Raglan Road Christian Church from 12-2pm.\nchicken &amp; mushroom pie with spuds and vegetables, jerk chicken, rice &amp; slaw, curried cauliflower / lentil veg Dahl. \ndessert - rice pud fresh fruit salad or fresh cream cake\nAll £1, desserts 50p drinks free."], ["curried chicken and rice", 1142052152149516290, "RT @JessAmmah: So today with @Foodwithdom she made my office a delicious spread of Curried Chicken, Fried Fish, Peppered Plantain, Thyme &amp;…"], ["curried chicken and rice", 481645544, "Specials for today are...\nCurry craze: spicy chicken vindaloo and curried broccoli, served over basmati rice...$14 incl tax\nSoup: Moroccan chickpea &amp; vegetable\nSalad: greens w/ red onions,... more at https://t.co/v3N3zMCBLY"]]