[["curried lamb", 1067932142, "Menu For Saturday 15th February \n\nLarge - £8.00\nSupersize - £10.00\n(With A Choice Of An Extra Meat Or Mac Pie)\n\nFried Chicken\nLamb Chops \nMutton (Curried Goat)\nFried Fish \nRice and peas\n\nExtras \n\nFried Chicken - £2.00\nLamb Chop - £2.00\nFried Fish - £3.00\nMac Pie - £2.00"], ["curried lamb", 1952665910, "I want Indian food, curried lamb from up the street sounds like a move."], ["curried lamb", 31567003, "Start with the curried lamb and apricot hummus at the Cleveland Heights spot. https://t.co/vwM4vGBWEE"], ["curried lamb", 381799081, "Have you had a chance to try our new menu?! This is our delicious Beverly Creek Lamb dish. A pan seared lamb sirloin and curried lamb shoulder served with pressed aloo gobi, mint raita, cucumber and cilantro. The perfect combination of flavours. https://t.co/D9nKkoiDM5"], ["curried lamb", 308588085, "Join us for lunch! BED: Lamb Vegetable, Roasted Red Pepper &amp; Tomato, Beef Fajita, Curried Sweet Potato Bisque HFX: Chicken Noodle, Thai Chicken &amp; Vegetable, Cream of Broccoli, Split Pea &amp; Ham GFE: Cashew Chili Daily Delish: Chef's Sammies #lunchpicks #goodeats #soups"], ["curried lamb", 286883249, "RT @BurgerUP: Warm right up with NEW February Specials! Stop in to try our @prbutcher Lamb Burger with boursin cheese, Curried Quinoa Soup…"], ["curried lamb", 67981968, "Warm right up with NEW February Specials! Stop in to try our @prbutcher Lamb Burger with boursin cheese, Curried Quinoa Soup with butternut and spaghetti squash, and The Gilded Bloom - a rye cocktail with dry curacao, cinnamon, St. Germain and lemon. https://t.co/4KDlXqHUXv"], ["curried lamb", 21727002, "@1001cranes @JRMoockjr Um, hi, hello, i would like this. You could do like a curried lamb hash? Sign me the fuck up!"], ["curried lamb", 308588085, "Join us for lunch! BED: Lamb Vegetable, Roasted Red Pepper &amp; Tomato, Beef Fajita, Curried Sweet Potato Bisque HFX: Hearty Chicken Noodle, West African Peanut, Creamy Almond Chicken, Tomato Tarragon GFE: Beef Stew Daily Delish: Sizzlin' Stir Fry #lunchpicks #goodeats #soups"], ["curried lamb", 271227432, "@BridgetPhetasy At restaurants ... I can get a nice greek style lamb meal for 18ish\nAt the vegan place, it's about 15?  And I get annoyed that I could be eating delicious lamb ...\n\nI love lamb ... And goat ... Idk how u can be vegan, living w/o curried goat... Hmmm\n\nDammit, now I'm hungry https://t.co/F6HpGTdys7"], ["curried lamb", 553630215, "Slow roast curried lamb with homemade naans. Tasted as good as it looks. https://t.co/9TLOdUYXly"], ["curried lamb", 1060671519846817800, "@RossMcCaff Nice try, data thief (get a mixed grill and fish for starters with some chips and two curried for main. Lamb and chicken). The lamb is very very good"], ["curried lamb", 945609835177021440, "RT @mightytom: It’s been a while since I posted some home cookin’. This here is a #curried #lamb #burger on a #brioche #bun with lightly #g…"], ["curried lamb", 25735249, "It’s been a while since I posted some home cookin’. This here is a #curried #lamb #burger on a #brioche #bun with lightly #grilled red #onion and a topping of #bleu #cheese mixed with #mayo, #dijon #mustard, and… https://t.co/dZcy1Uvnbx"], ["curried lamb", 1002822704536449024, "Curried lamb I’m thinking..."], ["curried lamb", 568545391, "Wife has asked me to cook authentic Caribbean food for our friends tomorrow, I never need a excuse to cook Jerk chicken, curried lamb, dumplings and rice and peas...cha"], ["curried lamb", 84740256, "RT @BabaloNdenze: @tembisa_J I like curried lamb mince. It talks to me."], ["curried lamb", 551879343, "@tembisa_J I like curried lamb mince. It talks to me."], ["curried lamb", 1069730280460746753, "Gearing up for the weekend with new lunch &amp; dinner options available.  Here are three new options you can taste: Lamb Tagine, Roasted Curried Cauliflower, and Greek Shrimp Tartine!  😋 @ Oak &amp; Reed Downtown https://t.co/8lv3BBiCl5"], ["curried lamb", 3254735367, "Early doors heads up for Thursday pies 😁😋 steak cheese hash pies, Scottish hash pies, chicken madras pies, curried veggie pie, cheese egg bacon puffs, black pudding pasties, chili lamb pasties, flapjacks, biscoff… https://t.co/Mk0LwpP4sP"], ["curried lamb", 1174638885470531584, "RT @abdulmshaheed: I have always said chicken or lamb or beef or eggplant curry.\n\nI have heard people say curry chicken and I wonder if it…"], ["curried lamb", 21156478, "@simonshen_glos @WBYeats1865 If they hadn’t organised a strike Curried Lamb would have left the border points wide open, thereby massively exposing hk to the Wuhan virus"], ["curried lamb", 2236931703, "I have always said chicken or lamb or beef or eggplant curry.\n\nI have heard people say curry chicken and I wonder if it should be curried chicken or is that a Fijian version of English that we now use. https://t.co/uusXiL9WNi"]]