[["dal khichdi", 18393603, "Inspired by @YellowWingss, I decided to click and post a photo of my lunch today.. Made it myself. Simple, but I'm satiated!\n. \nMoong Dal Khichdi with a dollop of homemade ghee, Beetroot sabji &amp; Papads!\n. \n#Homemade #Lunch #NoOnionNoGarlic #Simple #Meal #GlutenFree #Sattvik https://t.co/wRssG1of6A"], ["dal khichdi", 78323573, "@SwiggyCares I ordered langarwali dal khichdi from the Khichdi Experiment along with lehsuni palak. Does this look like my order from any angle? Your useless customer care says I have to wait 6 hours to receive a response. What about my lunch? What about the money I have paid? https://t.co/3uTlfOvuSo"], ["dal khichdi", 1175436709347151873, "@virsanghvi @HarshRa05005237 Everywhere\nPeople ate rice mixed with oth items to modify its bland taste\nThen tey strted cooking all ing.together like khichdi\nSo khichdi and Biryani are cousins.Both can be wet or dry and veg and nonveg\nLike dal khichda and veg Biryani\nNo one invented them\nThey are common food"], ["dal khichdi", 3994536261, "@bigbacontheory Dal chawal or khicchdi\nOmelette or egg bhurji (so yummy and filling)\nSaboo Dana khichdi is easiiiiiiesssstttttttt (if you like)"], ["dal khichdi", 432232040, "@zomatocare Order # 1715533899\nDelivered so late. After almost 70 mins.\nLook at the oil and is there in the paneer dal khichdi, Are you guys planning to import oil to the world?\nPerfect oil in mushroom palak khichdi. Not excess. \n#FoodHygiene #foodsafety #food #mumbai https://t.co/KalunstIR9"], ["dal khichdi", 1118822521170735105, "@zomatocare I request you to please start a sick people food section. Because of gastro issues, I ordered dal khichdi from Tawa N Wok yesterday but it was floating in so much oil that America wants to know my location."], ["dal khichdi", 34642369, "RT @shashishekhar: @peeyuka Dal khichdi and tandoori chicken is an underrated combo."], ["dal khichdi", 14513865, "@peeyuka Dal khichdi and tandoori chicken is an underrated combo."], ["dal khichdi", 1131419688284565505, "@Neurophysik coz all gujrati r sick for punjabis if they khichdi. We eat Yellow dal with desi Ghee and white chawal."], ["dal khichdi", 768714304967155712, "#mealforone \n.\nA meal that I can never say no to. Quick yet delicious ghee laden masala dal khichdi was my dinner tonight. I prefer to make easy peasy one pot meal mostly for dinners and especially when I am home… https://t.co/1hM74nfA5j"], ["dal khichdi", 142179355, "@RoflGandhi_ @AmitShah Got confused between Biryani &amp; Dal Khichdi"], ["dal khichdi", 2687928560, "Bc tabiyat kahrab hai aur bhook lagi hai.  And for some reason dal khichdi is only available after 12:15 am on delivery apps. Wtf."], ["dal khichdi", 2687928560, "Yo mumbai Twitter. \n\nI'm super sick, can somebody come over with some dal khichdi and nariyal paani?"], ["dal khichdi", 74957667, "@AbidZaidi1 Mutton pulao/khichdi/khichda as it is called in some parts of India. Basically it is mutton cooked with rice and some dal\nKashmiris make it on Khyetche Mavas(Yaksha Amavas). It's absolutely delicious 😋😋😋"], ["dal khichdi", 894895509772525568, "@TarangSinha Even I like the fried ones. Had roasted papad yesterday, it goes well with Dal khichdi"], ["dal khichdi", 300783878, "My weekend looked like this 😋\nThat’s Chicken Handi with Tandoori Rotis and delicious Dal Khichdi 🥰\nHow was yours???\n.\n.\n\nFollow @thehungrywooman for more action!!\n.\n.\n#whatsonmyplate #indianfoodbloggers #mumbaifood… https://t.co/9S2kVg4R4Z"], ["dal khichdi", 74406493, "India is like KHICHDI, If you remove rice or dal or ghee from it.. it won't taste nice!!\n@sudhirchaudhary don't try to break India by your stupid communal tv programs."], ["dal khichdi", 711014317022257152, "Dal Khichdi - Super delicious, protein packed one pot rice lentil dish\nhttps://t.co/wYqrJpg0me"], ["dal khichdi", 2863367689, "@FarandWidecom Ranking between the obvious and the ridiculous: what is called here as \"khichdi\" is what I've always heard of as \"dal bhat\"; in Italy only tourist call \"bolognese\" what we call \"tagliatelle al ragù\" which isn't our best for sure; French cooking is miserably represented; et cetera"], ["dal khichdi", 604562020, "dal khichdi so simple yet so beautiful i love you"], ["dal khichdi", 2374822296, "@Snowflake_3925 Biryani is great,  dal chawal /khichdi is fake \n\nWhen some ppl are soaked with slavery of Mughalism.. no matter what u say they will turn d face 👍\n\nGood luck till u get enlightened 😛"], ["dal khichdi", 107752862, "@SwiggyCares it's been more then an hour and I am still waiting for my order ...this Dal khichdi is getting delivered from moon?"]]