[["egg rolls", 240104895, "I am so angry that someone hasn’t brought me a plater of egg rolls, sushi, and crispy duck. And chopsticks because forks ruin the point https://t.co/40gpJdsR0P"], ["egg rolls", 898606568106860545, "A little culture today with egg rolls... https://t.co/q4OblC2qSc"], ["egg rolls", 4692173359, "RT @CMNHospitals: .@PandaExpress locations across the country will serve egg rolls which symbolize wealth; long chow mein noodles that symb…"], ["egg rolls", 758036555982180352, "Dine with your dog in our dog friendly patio, always shady with ice water and treats for your dog and you.  Order any food item from our menu and receive a free order of egg rolls, crab ragoon (wontons) or other surprise item.  Must have your dog with you and dine in the patio ar"], ["egg rolls", 544617088, "@DeanOfDank @s___flexing @mostlygeneric @mizedub don’t even get me STARTED on the cheeseburger egg rolls that they got rid of a while back, those shits were BANGING"], ["egg rolls", 182709001, "Southwest egg rolls be... 🔥🔥"], ["egg rolls", 1207429472087138305, "Egg rolls AND Spring rolls...\n\nLet's talk about it 🔥\n\nLol\n\nAnd sauces 🔦 https://t.co/0iMfDzGN2Y"], ["egg rolls", 1861901892, "@vindellss Chopped cheese egg rolls??! Nahhh that’s different"], ["egg rolls", 177997141, "Ughhh I wish someone would bring me some south west egg rolls from @Chilis right now. This rain is making me tired and hungry 😭😩"], ["egg rolls", 173608628, "@_suni_child_ ayyyye I did egg rolls in my air fryer and they are really good! I also cooked stuffed bell peppers earlier this week and they were so good! Has a fried crunch to them! https://t.co/2DUElfp5og"], ["egg rolls", 815707474003165184, "Id literally kill to have some lo mein and egg rolls right now!🥴🥴"], ["egg rolls", 4779786268, "@UltraBaller 15 egg rolls in my ass"], ["egg rolls", 1076381733774254080, "Interesting symbiotic business relationship between Genesis gym and a hot jam donut van set up in their car park. Oh van also sells egg and bacon rolls!"], ["egg rolls", 2970400041, "RT @DelishDotCom: These Chocolate Cheesecake Egg Rolls Are A Dessert WIN https://t.co/d2N650XTvC"], ["egg rolls", 477896306, "Our cheesesteak egg rolls are specifically designed to fit in one hand — two-fisting is recommended. #CheesesteakEggrolls #Instabarsnax #LateNight #Jazz #JazzLover #JazzLovers #JazzMusic #LiveMusic #PhillyJazz #LiveJazz #Eat #Eats #Eater #EaterPhilly #Philly #Philadelphia https://t.co/BTxKSs1YJB"], ["egg rolls", 17400433, "RT @pintipdunn: Please join me this Sat. to celebrate the launch of MALICE! There will be egg rolls! And cake! And Thai iced tea! And tradi…"], ["egg rolls", 324116705, "I love vegetable egg rolls"], ["egg rolls", 1185754269410037761, "RT @soobincharms: s cawaii interview — hueningkai \n\nhueningkai loves eating eggs. he loves fried egg and egg rolls. he can make simple egg…"]]