[["egg salad sandwich", 939661679285153792, "RT @TheLastRefuge2: In Iraq, Vindman probably ate an egg salad sandwich with a piece of shell..."], ["egg salad sandwich", 498716177, "RT @TheLastRefuge2: In Iraq, Vindman probably ate an egg salad sandwich with a piece of shell..."], ["egg salad sandwich", 594886554, "In Iraq, Vindman probably ate an egg salad sandwich with a piece of shell... https://t.co/k4HjodUhXu"], ["egg salad sandwich", 3491571, "@TitusNation At this point the country would be better off with:\nBay-Tor, Devourer of Souls (D) 2020\nSix Rabid Weasels in a Trenchcoat (D) 2020\nAn Expired 7-11 Egg Salad Sandwich (D) 2020"], ["egg salad sandwich", 4714981094, "Considered buying a sandwich to hold me over until my eye doctor appt. Then I thought about eating an egg salad sandwich alone in a Target and got WAY depressed."], ["egg salad sandwich", 1050173136069689352, "@Mochievous A woman is like an egg salad sandwich on a warm Texas day. Full of eggs and only appealing for a short time. - Sheldon Cooper. Women above 30 aren't appealing"], ["egg salad sandwich", 1050173136069689352, "A woman is like an egg salad sandwich on a warm Texas day. Full of eggs and only appealing for a short time. Women above 30 aren't appealing - Sheldon Cooper. https://t.co/LNWuxnbMUW"], ["egg salad sandwich", 1217169203607699456, "@jeffreyb725 I just had a egg salad sandwich yesterday , I will try it again next week will let ya know"], ["egg salad sandwich", 134288247, "Egg salad sandwich and jalapeño chips. I’m a big egg salad fan. Normally Pret is pretty spot on. This had a little too much arugula, and yet it was a little blander than normal. \n\n#food #sandwich #eggsalad #lunch https://t.co/xvBJZ3ab3S"], ["egg salad sandwich", 73689958, "Just stopped in West at the Czech Stop. Couldn’t decide between egg &amp; tuna salad, and I discovered they have a sandwich called The Arnold Palmer that has BOTH on it! I’m in heaven! 😍😍😍 https://t.co/OJb4qeTO1b"], ["egg salad sandwich", 3127854535, "Egg salad sandwich and Yoo-hoo: The Breakfast of Champions™️"], ["egg salad sandwich", 703393109929906176, "@biweiying Ayee egg salad sandwich I smothered in sriracha"], ["egg salad sandwich", 735495823593590786, "that egg salad sandwich craving b so real sometimes"], ["egg salad sandwich", 156039994, "Some of my recent vegan meals. \n•Sushi &amp; salad\n•biscuit sandwich with eggs &amp; bacon\n•quinoa bowl with veggies\n•veggie egg scramble with sausage https://t.co/BSUNcqGq6e"], ["egg salad sandwich", 1119057242911756288, "@corinnec @jtLOL I’m in a Starbucks right now and Kurt Russel is eating an egg salad sandwich. HOLY COW! Miley Cyrus jist ealked in and she’s feeding sauerkraut to Stone Cold Steve Austin."], ["egg salad sandwich", 586017195, "@eclecticbrotha I swear to god I will vote for a rancid egg salad sandwich if it wins the Democratic nomination."], ["egg salad sandwich", 180066380, "\"Two classics combine resulting in the ultimate sandwich for grown-ups.\" https://t.co/sQ5w7gFrv2"], ["egg salad sandwich", 1332757724, "Me eating spagehtti in the bathtub: “this shouldn’t be weird if it feels so right”\n\nMe 2 weeks later eating an egg salad sandwich in the bathtub: “ok — this is getting out of control now..” \n\n#bathtubvibes"]]