[["fiesta dip", 3855257654, "Listen... vegan crunch wrap supreme, take it home and add Trader Joe’s creamy cashew fiesta dip. You’re welcome."], ["fiesta dip", 406351530, "@pxlsicle listening to Extra Napkins Fiesta Foods tak about fountains.  KFC Gravy fountain. Dip in popcorn chicken. Mashed potato and corn fritters, too!"], ["fiesta dip", 3146579336, "@booradley1961 @ananavarro @PeteButtigieg Me too. I call it Fiesta Ranch, great on Taco Salads or as a dip."], ["fiesta dip", 379956390, "@tenderlymag Their Cashew Fiesta Dip!"], ["fiesta dip", 1045458519627980801, "@ananavarro @PeteButtigieg Here in NM, people dip their pizza in ranch dressing. I’d never seen that before I moved here and it tastes delish. Dion’s pizza is a must-try if you come to Albuquerque in Oct for the balloon fiesta."], ["fiesta dip", 173365799, "@rileythehippie Have you tried their cashew fiesta dip!!!"], ["fiesta dip", 564143548, "Fiesta Cashew dip goes bananas \n\nThank me later https://t.co/hf6mQOmWHh"], ["fiesta dip", 1170761577936482306, "@SatanicMikeNYC I like cashew based soft \"cheeses\" but the shredded almond milk cheese was bad, didn't melt, and not great for you (canola oil). Chao slices were similar. The fiesta cashew dip from Trader Joes is good. Made a bomb 7 layer dip with it on Sunday!"], ["fiesta dip", 455230193, "Chips. Dip. Crunch. Munch. The Fiesta Board !!! 😘💞👏🏹💃👍#Salsaritas https://t.co/exAX6gX1hI"], ["fiesta dip", 3179989675, "Hey Scholars, have you still not tried our Chicken Fiesta Dip, tonight is your chance. Tuesdays, Our bloody awesome Appetizers are on special for 30% off\n#saskatoon #saskatooning #saskatoonpubs #yxefood #yxefoodie #BeAScholar #ThinklikeaScholar https://t.co/jrC9gwjjRX"], ["fiesta dip", 1124648571012374528, "Fiesta 2-pc. Dip Mix Set   https://t.co/IIzDVSWaVR https://t.co/QsXKiHd7iX"], ["fiesta dip", 617746064, "Chips and dip and a modelos, it’s a fucking fiesta"], ["fiesta dip", 329792329, "got home way later than i thought we would and only had some super freezer burnt taquitos in the freezer but i smothered them in the trader joe’s cashew fiesta dip and they’re still good lmao"], ["fiesta dip", 23931285, "IKR?!?!?! Dip that shit in some damn salsa and that's a fiesta in your mouth!😃 https://t.co/wWwy935BXG"], ["fiesta dip", 1016740300277080065, "down bad in the crib eatin kowalskis taco fiesta dip"], ["fiesta dip", 19980671, "@HVRanch we’re really sad about the fiesta ranch dip mix changing 😭 it’s SO much saltier but less tasty &amp; makes many of our award winning signature dishes awful. The old recipe was bomb 💣 Bring it back?!"], ["fiesta dip", 364823106, "@SEC_Logo @WaffleHouse Fiesta omelette plate, bacon extra crispy, hasbrowns scattered, smothered, covered, and grape jelly for the toast! And ima need some syrup to dip my bacon in!"], ["fiesta dip", 944416049256128512, "everything named salsa is great. \nsalsa music: sweet\nsalsa dance: amazing \nFiesta Salsa: fabulous \nsalsa dip: absolutely mind blowing"]]