[["filter coffee", 1646120928, "RT @ShefVaidya: Kolams outside every doorstep are my favourite part while traveling in Tamil Nadu. The women always seem to be amused when…"], ["filter coffee", 4288453459, "RT @ShefVaidya: Kolams outside every doorstep are my favourite part while traveling in Tamil Nadu. The women always seem to be amused when…"], ["filter coffee", 316917053, "RT @ShefVaidya: Kolams outside every doorstep are my favourite part while traveling in Tamil Nadu. The women always seem to be amused when…"], ["filter coffee", 246689688, "RT @ShefVaidya: Kolams outside every doorstep are my favourite part while traveling in Tamil Nadu. The women always seem to be amused when…"], ["filter coffee", 1964237336, "RT @ShefVaidya: Kolams outside every doorstep are my favourite part while traveling in Tamil Nadu. The women always seem to be amused when…"], ["filter coffee", 4374050188, "RT @ShefVaidya: Kolams outside every doorstep are my favourite part while traveling in Tamil Nadu. The women always seem to be amused when…"], ["filter coffee", 532336166, "RT @ShefVaidya: Kolams outside every doorstep are my favourite part while traveling in Tamil Nadu. The women always seem to be amused when…"], ["filter coffee", 353115429, "RT @ShefVaidya: Kolams outside every doorstep are my favourite part while traveling in Tamil Nadu. The women always seem to be amused when…"], ["filter coffee", 1934388686, "Kolams outside every doorstep are my favourite part while traveling in Tamil Nadu. The women always seem to be amused when I stop to take pics of their Kolams! For them, drawing a Kolam is an everyday ritual, like their morning cuppa of filter coffee. #TamizhTales https://t.co/7zKmoyZ1eg"], ["filter coffee", 4234679758, "Yeah but did you know that if you bring your own cup to #pret and get a filter coffee (inc milk of your choice) it’ll cost you just 49 of your fine English pence? https://t.co/mOGOqRlVCK"], ["filter coffee", 1225286239605030913, "I am a tamilian and I HATE filter coffee to the core! Yes we do exist! https://t.co/TZws6uGDOC"], ["filter coffee", 897692369788784640, "@Royalprakash @coolfunnytshirt I am a Tamil.\nBut a Kannadiga of 2 decades.\n\nAddicted to,\n1) Red hot bisibele bath + boondhi + coconut chutney.\n2) Benne (Butter) Masala dosa\n3) Filter coffee.\n\nDon't know whether I am a Tamil or Kannadiga.\nBut yes, we do exist."], ["filter coffee", 1013722750165438464, "Cuisinart Coffee on Demand 14-Cup Capacity Coffee Maker w Charcoal Water Filter ( Discount 40 % )   #Cuisinart  #Coffee  https://t.co/0DZhYoOqX8"], ["filter coffee", 1209160129121280000, "First time seeing this one-time coffee filter ☕😂\n#morningcoffee https://t.co/FzvWIOEKqd"], ["filter coffee", 1066655938101166080, "@loremips0em Pasti filter coffee"], ["filter coffee", 1195955844665360385, "RT @IDFreshFood: The best way to spend your weekend? Of course, it’s reading books over filter coffee. Let’s celebrate this feeling togethe…"], ["filter coffee", 40386930, "@respatitapser YOU'RE RUINING THE COFFEE FILTER!!!"], ["filter coffee", 90372933, "@emmccatt I had to quit caffeine. You need to find a good quality decaffeinated coffee. I use decaffeinated @LyonsCoffee coffee bags in a travel mug - you can get them on Amazon. Or Taylor's of Harrogate do an excellent decaffeinated cafetiere/filter coffee..."], ["filter coffee", 1100792851267547136, "RT @Ykids_Charity: #YouAreInvited We're excited to announce the return of Afternoon Tea at North Perk Cafe!\nEnjoy a selection of delicious…"], ["filter coffee", 37433050, "RT @mintybookworm: Chennai has given me filter coffee and I think I can overcome everything now 😍"], ["filter coffee", 890276820628779008, "Chennai has given me filter coffee and I think I can overcome everything now 😍"], ["filter coffee", 739072503931240451, "RT @minaturegalaxy: I FOUND THE SNAPCHAT FILTER IM SORRY FOR MY GROSS LAUGHTER https://t.co/U6koHY5sy2"], ["filter coffee", 29674233, "What a lovely start to the day! Freshly baked muffins and filter coffee for all colleagues @ArkGlobeAcademy as part of our spotlight on #wellbeing - I can confirm the blueberry muffin was delicious! 😋 https://t.co/JcdlNpkfhG"], ["filter coffee", 381734721, "@emilynussbaum Nice hack! Reminds me of Winona Ryder using 🧻 as a coffee filter in Reality Bites."], ["filter coffee", 2541676298, "The best way to spend your weekend? Of course, it’s reading books over filter coffee. Let’s celebrate this feeling together at the Times LitFest. We hope to see you there tomorrow. Register now https://t.co/1lYrOpEmcx\n#TimesLitFest #TLFBlr #iDFresh #iDFreshFood #FreshFoodPartner https://t.co/KN5yr87uu9"], ["filter coffee", 818790198611841024, "Airtight Cold Brew Iced Coffee Maker (&amp; Iced Tea Maker) with Spout – 1.5L/51oz Ovalware RJ3 Brewing Glass Carafe with Removable Stainless Steel Filter 🥰 https://t.co/tWSZFH8TMQ\n\n@wookitopia \n#Cold #Brew #IcedCoffeeMaker #Coffee #Tea #Stainless #Steel #Filter #Gifts #House #Home https://t.co/w6r4xRupr6"], ["filter coffee", 23634455, "Complimentary #Lavazza filter coffee on the 0518 @GWRHelp  out of Malvern this morning. Epos failed. Again! Thanks, Jane. Have a lovely weekend. #London #Paddington https://t.co/fvftgUuX8F"], ["filter coffee", 39538533, "@vantaskigoli @gazeboturtle Is it the lighting or have they started serving filter coffee in brass instead of steel cups?"], ["filter coffee", 2848421142, "Premium Designer Black Steel Pour Over Coffee Maker Handmade Concrete Stand Complete With Glass Dripper – The Finest Homemade Pour-Over Coffee a Unique Individual Coffee Filter Coffee Drip https://t.co/vZ887XTv31 https://t.co/fopTLhAEkf"], ["filter coffee", 35291908, "Filter coffee morning with my best girls. https://t.co/9o3Ec59Pob"], ["filter coffee", 913412676767944705, "To book, call 011 465 5011 (Design Quarter) | 010  020 6837 (Kyalami Corner). \n*T&amp;C’s apply, not available on public holidays, one coffee per breakfast, filter coffee and cappuccino available with promo."], ["filter coffee", 1107243126085898240, "Check out Vintage Brass Tea Filter Spoon Hand Crafted Coffee Filter Spoon Old Brand Marked  https://t.co/gsIPwfeJUD via @eBay"], ["filter coffee", 161744502, "RT @Iyervval: The Mylapore Breakfast: soft fluffy idlies with: white sesame gunpowder; black sesame gunpowder (both drenched in gingelly oi…"], ["filter coffee", 103283007, "RT @Iyervval: The Mylapore Breakfast: soft fluffy idlies with: white sesame gunpowder; black sesame gunpowder (both drenched in gingelly oi…"], ["filter coffee", 2270215261, "RT @Iyervval: The Mylapore Breakfast: soft fluffy idlies with: white sesame gunpowder; black sesame gunpowder (both drenched in gingelly oi…"], ["filter coffee", 260076953, "Filter coffee at the airport is ₹190! That is the price of 10 cups on the streets! I realise that the taxes are way too high and no visible changes done to the walkways, roads and buildings! What are taxes used for? #India #taxes"], ["filter coffee", 1070835724151222272, "A peach pear la croix at the bar, and a black filter coffee at Veronica’s work. feel dizzy and vibrating because I haven’t eaten in anticipation of a dinner, and have had too many cigarettes"], ["filter coffee", 1386333272, "RT @Iyervval: The Mylapore Breakfast: soft fluffy idlies with: white sesame gunpowder; black sesame gunpowder (both drenched in gingelly oi…"], ["filter coffee", 244173461, "Our Filter Drip Packs are great for traveling and to take with you to your office. Highest quality Filter Coffee made simple. https://t.co/rwG7Qrsc8c"], ["filter coffee", 2303982482, "@guybranum @SvePan1108 @emilynussbaum Cowboy coffee: when the grinds are so coarse and chunky that you either let them easily settle/ can filter with just about anything. \n\nTurkish/Greek coffee: beans are ground so very fine they *almost* dissolve and otherwise settle to the bottom of the cup like silt."], ["filter coffee", 796353452976680960, "@guybranum @emilynussbaum It was supposed to be a joke.\nBut the way to prepare coffee as Turkish coffee is a little more involved than \"just boil the sucker and don't filter\"."], ["filter coffee", 2811580568, "@emilynussbaum Don't use a paper towel as a filter! There's chemicals and crap that they use to treat them and that'll leech into your coffee."], ["filter coffee", 1264883444, "@emilynussbaum Take a large jar, put a cone shaped paper towel over the top, put the coffee into the cone filter, pour very hot water to the top of the cone, let it drip into the jar. A cup of ☕️. You’re welcome."], ["filter coffee", 169677889, "@emilynussbaum Yes it's called cowboy coffee but you can also use a paper towel as a filter!"], ["filter coffee", 43370680, "@emilynussbaum Yes. Bonus points for making a coffee filter out of a paper towel or napkin. But grounds in water is still coffee"], ["filter coffee", 96099171, "RT @Iyervval: The Mylapore Breakfast: soft fluffy idlies with: white sesame gunpowder; black sesame gunpowder (both drenched in gingelly oi…"], ["filter coffee", 1343906912, "I've always though Starbucks an expensive way to generate non recyclable plastic waste when theres filter coffee to be drunk out of stainless steel tumblers. \n\nThis however brought tears to my eyes 🤗🤗🤗 well friggin done https://t.co/C2jk1txguG"], ["filter coffee", 312018456, "@chitraravi Nahiiiiinnnnnnn. I'm a tamilian living in Goa who's drinking filter coffee morning noon and night 😋"], ["filter coffee", 1013992432650686464, "Potato Sandwich , Grapes , Red Guava , Orange &amp; Filter Coffee - Breakfast plate today ..... \n\n#breakfasttime #breakfastplate #todayistheday #sandwichesofinstagram #madrascoffeehouse #foodbloggersofinstagram… https://t.co/6VG6HzbdrO"], ["filter coffee", 923649835907145729, "New post (KaiKai Foldable Coffee Drip Stand, Stainless Steel Outdoor Camping Portable Coffee Filter Cup) has been published on Espresso Machine Review - https://t.co/xklY1ZeP6d"], ["filter coffee", 2728749718, "Coffee Filter Art Activity during tonight’s TCE Family STEAM Night! #TCEgamechangers #TCEsteam @ValVerdeUSD @dhenderson_sci @mrs_seagrave https://t.co/mFzlLHaVN8"], ["filter coffee", 140375902, "@loginadmk @jvishi 3 masala dosai,  2 noodles and 2 filter coffee after 15 minutes @mkstalin"], ["filter coffee", 1052161009899790336, "RT @Iyervval: The Mylapore Breakfast: soft fluffy idlies with: white sesame gunpowder; black sesame gunpowder (both drenched in gingelly oi…"], ["filter coffee", 1133894045326069762, "I FORGOT TO PUT THE FILTER CAGE BACK IN THE COFFEE MAKER. THERES ALREADY A POT BREWING WTFFFFFF"], ["filter coffee", 2177117550, "@sNickwastaken For liquid sugar, boil 1 cup sugar &amp; 1 cup water, and after it mixes, pour it through a coffee filter and into another pourable/reusable container, and keep it in the fridge so it doesn't go bad."], ["filter coffee", 3484088653, "RT @amitmalviya: Nothing beats a lazy lunch with friends - Hyderabadi biryani, filter coffee and more.. The gapa goshti is added incentive.."], ["filter coffee", 240314371, "RT @Iyervval: The Mylapore Breakfast: soft fluffy idlies with: white sesame gunpowder; black sesame gunpowder (both drenched in gingelly oi…"], ["filter coffee", 49523238, "@KSPrior @SkipMcQ I have a simpler set up: it's basically a plastic bucket w/ a hole in the bottom; plug hole, insert a filter, layer a lb of ground coffee and filtered water until full; steep for 24 hrs; remove plug and drain into carafe; best coffee concentrate ever, perfect w/ cold H2O over ice"], ["filter coffee", 501175297, "@ScientifEquine Cold brew coffee first! I have a cold brew carafe from amazon and do 24 hours, filter, then add the extras!"], ["filter coffee", 742633969095561216, "Refillable Reusable Single K-Cups Filter Pod for Keurig 2.0 Coffee Makers - https://t.co/VDxF6pci4g https://t.co/0ILdywoxMH"], ["filter coffee", 822788935223046144, "RT @ksk_khalandar: @aaigoaairport @ameyabothara @baliga_abhay10 @GOAMILES1 Our Dabolim Airport is the best... We even have inline screening…"], ["filter coffee", 80501783, "RT @guadaluperoast: The Drip method is used by many coffee drinkers!  In this method, the hot water is poured over the coffee beans, after…"], ["filter coffee", 1198671026378297349, "party in the usa reminds me sitting on the side house as a kid with my brother eating coffee grounds out of the filter that my mom had thrown away and trying to make coffee with hose water after it tasted gross \n\noh my god i was a nasty kid 😭"], ["filter coffee", 937029193824722945, "While my friend was out of town for a month I used her French press exclusively. Now that she’s back I slunk back to my Mr. Coffee. Only to find I forgot to rinse old grounds out of the filter. It grew mold. 👋. Now it’s to the moka pot a friend bought me ages ago. Stay tuned. https://t.co/PqtiDzmWkH"], ["filter coffee", 1169154463766110209, "and now they're sitting cross legged on the carpet in his studio. fast food wrappers long forgotten on the coffee table and a bottle of whiskey thrumming through their veins, making taehyung's brain to mouth filter malfunction."], ["filter coffee", 953559577, "@DrEricLevi Is that a very very light roast? Or a #filter. Yes that’s a coffee pun. I go for dark roast"], ["filter coffee", 1374055788, "Marco SP9  - Denver, CO, United States: https://t.co/RKMs3z9Ii7"], ["filter coffee", 942669964649140225, "Cuisinart Coffee on Demand 14-Cup Capacity Coffee Maker w Charcoal Water Filter ( Discount 40 % )   #Cuisinart  #Coffee  https://t.co/w4jb8DVHqM"]]