[["fish fingers", 1199281461712609282, "@IBRice101 What you chatting about my man Captain Birdseye, his fish fingers are in fact only 244 calories per 4 servings, eat a couple of them bad boys a day and you’ll be in peak physical condition"], ["fish fingers", 267768124, "@newmoo41 @Lisaismyname89 I agree but at the same time I’m thinking about the omega 3 that’s in the fish fingers, I’m gonna have for dinner tonite basically I have no care"], ["fish fingers", 1160463622105116672, "RT @sonnyDrobertson: But why are they called fish fingers?"], ["fish fingers", 202962081, "@luxetrobur @Ebbrell67 Surely the fish fingers belong to the baghead.."], ["fish fingers", 1224038492919025665, "RT @Judithn70527123: @june_mummery No no no no,   Our waters, our fish,  you have had your dirty fingers in our pie far far too long !"], ["fish fingers", 2929178027, "@Susansm70570449 @mk_inwa @pipnic2 @StanPic25845029 @smoke_schnauzer @BenjiTibetan @ScrappyDaDog14 @ShennyWalrond @gardenmum7 @ctinebean @nannysue_sue @OfficialPanfur @SassyCassyCat @dog_phoebe @markblk9779 @VeronicaLamb17 @RangerTheDogg @sweetAbby20 @LJ_doodle 🐾Hello friend Daisy!♥️it was my food list for lunch, but me had fish fingers, kibbles and some ricotta cheese on top😋 🐶 worried cause D has bad cold🤧hope not🌡️🤞send you a big hug and kisses 🥰💕💋💕💋💕"], ["fish fingers", 2929178027, "@StanPic25845029 @mk_inwa @pipnic2 @smoke_schnauzer @BenjiTibetan @ScrappyDaDog14 @ShennyWalrond @gardenmum7 @ctinebean @nannysue_sue @OfficialPanfur @SassyCassyCat @dog_phoebe @markblk9779 @VeronicaLamb17 @RangerTheDogg @Susansm70570449 @sweetAbby20 @LJ_doodle 🐾Ciao Stan!♥️🐶 me having kibbles and fish fingers😋 poor D back home with a bad sore throat🤧 we send you and Mom our love and smiles 🥰💕💋💕💕"], ["fish fingers", 34254136, "@bkksomchai Omg are they fish fingers?"], ["fish fingers", 1185988219424464898, "bubblescuddlesandgin sometimes only fish fingers will do! Gluten free birdseyeuk fish fingers with green leaves, a chickpea salad and  hellmansmayonaise olive oil mayo #50foodsinaweekchallenge #50foodsinaweek… https://t.co/DIEE3gZ2IF"], ["fish fingers", 620050093, "@glennkirschner2 Bill Barr is the epitome of evil. Just look at his blow fish face.Reminds me for the lack of a better word  Weasel and i do not intend to bad mouth a beautiful animal.\nImpeach  and prosecute him when we get The Senate on November along with Nunnes and Sticky Fingers Lindsey"], ["fish fingers", 716664287733788672, "wait, how do i always fck up the psych test??. Like okay for the first round i was said to be a sexually confuse person, second I am sexually preoccupied and third im cute like a fish???. how is shapes and fingers get to predict this? HAHAHSHAH anyhow i chose mid finger cause--"], ["fish fingers", 62182882, "@amuizMustaffa Haha sorry tersalah reply pulak atas ni. \nAnyway, “he’ll have fish fingers &amp; beans TWICE” problem solved."], ["fish fingers", 1145610423682490368, "Have you played Under The Sea Slots?, Keep your fingers crossed! 🐍💋😍 #fish #turtle #lobster"], ["fish fingers", 1148531580509609984, "RT @Judithn70527123: @june_mummery No no no no,   Our waters, our fish,  you have had your dirty fingers in our pie far far too long !"], ["fish fingers", 1035869465873969152, "Guts Galore! Awesome activity on our WW2 Day with Y6 @RanbyHouse gutting trout. They LOVED it, especially poking fingers through the gills and popping out the eyeballs!! They’ll eat the cooked fish later. 😊\n#primaryrocks #WW2 https://t.co/ViZIcLfwJi"], ["fish fingers", 798303239590604800, "do they serve fish fingers at the lesbian orgy?"], ["fish fingers", 82448210, "@ChopperNeill14 That is a very deep philosophical question lol.  If it's fish as in fish and chips, then yes, in batter.  But things like fish fingers - then breadcrumbs definitely."], ["fish fingers", 2256665295, "@jamieoliver Fish Fingers 😋"], ["fish fingers", 521449464, "@Otto_English Thicker than two fish fingers"], ["fish fingers", 268598506, "@realhippohollow I hope it will be the reverse of the lovely Michael Fish in 1987!!!!! Over egging the pudding. Fingers crossed. Hope today is a good day my lovely. X"], ["fish fingers", 449756833, "@redkingcraw I had this but with fish fingers yesterday...  A good call I say!"], ["fish fingers", 317310125, "@SouthYeoEast Mmm.... perfectly normal! Oven also good for drying the children's sploshy paintings....remove before cooking their fish fingers!"], ["fish fingers", 1853984700, "@lufcchamps92 @garry_gazswfc @IngoodNick17 @OfficialVizeh Tuna flavoured fish fingers 😂😂😂"], ["fish fingers", 931451906572120065, "‘Now I’ve been called a prick 16 times my fish fingers taste less nice’  @Rubberbandits #rubberbandits #nocontext #blindboy"], ["fish fingers", 2858108795, "RT @SANHA_Halaal: Atlantis fish fingers are certified Halaal by SANHA.\n\nIn terms of information at our disposal I&amp;J fish fingers are Halaal…"], ["fish fingers", 2974831504, "@emotivefreq @musicGRiNDHOUSE Lol, who's up cooking fish fingers in the morning?"], ["fish fingers", 4393338537, "@musicGRiNDHOUSE Got a brej who eats chips and fish fingers religiously for breakfast..mmi kid you not 7 dirts every morning!"], ["fish fingers", 2237717490, "The way I eat though, burger and fish fingers for breakfast... I need to stop!😭😭"], ["fish fingers", 4070796436, "Was supposed to go for a run last night instead I had a whole pack of fish fingers and 2 pints well done joe"], ["fish fingers", 2948744031, "Fish fingers don’t get the credit they deserve"], ["fish fingers", 1223475819089055744, "RT @_AlexHirsch: I WANT MY FACE ON FINLANDS FINEST FROZEN FISH TREAT\n\nI promise if Im the new Captain Fishfingers I will\n1 Dress like a sea…"], ["fish fingers", 2308870279, "Could the Deadly Coronavirus Actually Be a Man-Made Killer Disease?\nThere's evidence suggesting that the Wuhan coronavirus did not originate in a fish market. Fingers point to the Wuhan Institute of Virology.\nAuthor: William Ebbs @ebbs_william\nCoronavirus"], ["fish fingers", 1062374697059389441, "@FlakfireGaming Fish fingers and custard"], ["fish fingers", 34328769, "RT @samtrayter: @fredboycolor *gold fish flavor blasted dust on my fingers*\n\ni think ana de armas should give me a chance"], ["fish fingers", 1099704392385814531, "my fish tank has a bit more algae than id like so i was kinda rubbing it off with my fingers and sashimi just stared at my hand for a while like https://t.co/4OIlgxSb4m"], ["fish fingers", 224356863, "@jamieoliver Battered fish fingers for the kids!"], ["fish fingers", 286595186, "@clairus_bearus Some plasters and hand warmers are in the BB also in case of slicing fingers on the boxes/getting cold reaching into the fridge for fish fingers"], ["fish fingers", 930782203319128068, "RT @da_judge: I just found a box of fish fingers on the pavement.......well findus keepers!!!"], ["fish fingers", 203920646, "@fredboycolor *gold fish flavor blasted dust on my fingers*\n\ni think ana de armas should give me a chance"], ["fish fingers", 15711118, "@ppryan1 @mattremains @BolgerLorraine Fish fingers I get but buffalo wings needs explaining"], ["fish fingers", 3227315188, "Tonight was the first time while cleaning the fish tank that the fish were attacking the siphon and biting at my fingers.\nNow that they're bigger they're cocky things."], ["fish fingers", 1194899998644883458, "@mattremains @BolgerLorraine They also appear to think fish have fingers and buffalo have wings. Is there a link?.."], ["fish fingers", 66981444, "@aalizaaaa @ChulbulPandeyJR With fish fingers 🥴"], ["fish fingers", 62046966, "@PhilHannon @tim_rigby This hasn't aged well! Never mind Tim's mum cooked him his favourite fish fingers for tea!"], ["fish fingers", 779183806599266304, "@mayfieldfilms can't decide so I'll do a few\n\n- God is the villan, plaid, characters won't stay dead\n- Soft angle likes food and soft snek stans queen, basically married\n- Jawn, roof jokes still too soon?, please give us s5\n- Dooweeewoooo, fish fingers and custard isn't that bad actually"], ["fish fingers", 1086288728111435776, "@BearWinters @SlipperyKaijuu I just put my food order through for the week, had to add Fish Fingers. Have not had them in years."]]