[["fish curry", 211668938, "It’s Friday and you know what that mean...Ms. Maxine Friday lunches are on sale...Jerk Chicken, Curry Chicken, Brown Stew Chicken, Curry Goat, Oxtail, Escovich Fish, Brown Stew Fish White… https://t.co/7Q1REy15xc"], ["fish curry", 533469543, "Last fish dish done! Lovely mellow but aromatic fish curry @cookerycourses https://t.co/iTB8mCHHkn"], ["fish curry", 1132708218457743362, "“you don’t look bengali”\n\noh my bad I forgot to bring my fish curry with me https://t.co/cSQww2DPUB"], ["fish curry", 1206681267858812928, "Indian Fish Curry Recipe | Machli Ka Salan | Tasty And Easy Recipe | By Skill Cuisine\nhttps://t.co/TZcWeTQ1ei"], ["fish curry", 625602424, "RT @NDTVFood: Indian Cooking Tips: Quick And Easy Fish Curry For Treating Your Unexpected Guests\nhttps://t.co/098ugF3fOS\n#recipes #fish #Co…"], ["fish curry", 175428024, "@mmdotcox .@meerasodha coconut fish curry! Perfect perfect."], ["fish curry", 941758969, "@MGNTheTwin Rice and Fish curry types"], ["fish curry", 1162215817905184769, "RT @AmizaSherry: Because I didn't get to buy any Apeach yet... I'm healing myself with cooking. Steamed fish in da haus. And also making fi…"], ["fish curry", 1040725794828562432, "RT @Shedus_Food: A Thai Coconut Green Fish Curry\nWith cashew nuts\n\nHome Meals https://t.co/UDdNRfmN58"], ["fish curry", 1162215817905184769, "RT @AmizaSherry: This sound somehow reminds me of that guy who was trying to do raining sound ASMR to us and someone said it sounds like fr…"], ["fish curry", 801334451150225408, "RT @Snigdha_Hajong: How to Cook #Catla #Fish #Curry with #Radish | #Northeast #Indian Food #Recipes https://t.co/yYWyD351Bh via @YouTube"], ["fish curry", 212858692, "Apologies for being overweight due to a diet of Samosas, Pakoras, Curry's and Biryanis and then seeing these impact wider society.  I promise it wasn't because of my hatred for Fish and Chips.  \n\n\"I take your point!\" - And what point is that exactly?? @bbcquestiontime https://t.co/cwNr7FqtH2"], ["fish curry", 4824718177, "How to Cook #Catla #Fish #Curry with #Radish | #Northeast #Indian Food #Recipes https://t.co/yYWyD351Bh via @YouTube"], ["fish curry", 2256664812, "RT @ParkerGrainne: This is a tofu spiced curry but you can use prawns or fish and it would also be (even more, IMO 🤣 ) delicious \nhttps://t…"], ["fish curry", 87411715, "This is a tofu spiced curry but you can use prawns or fish and it would also be (even more, IMO 🤣 ) delicious \nhttps://t.co/oFjcUwdf1l\n#recipe #weekend #curry #vegan #familyfood https://t.co/KkPgQ7Ecwo"], ["fish curry", 750099806501085184, "Craving Busaba like crazy today wow. \nThe southern fish curry with jasmine rice and the calamari 😋"], ["fish curry", 211523689, "RT @MaePloy_Kitchen: FOLLOW &amp; RT to enter our #competition...\n\nYou could #WIN this selection of versatile, delicious Curry Pastes!\n\n#WinItW…"], ["fish curry", 1016289058945884160, "@NoContextZano @Reynaldikhsan I'm a Brit fella. Not everytime I eat curry rice here. Sometimes got bored with fish and chips"], ["fish curry", 2203717098, "@OrphicWxtch @ArrynZech @RoosterTeeth I imagine that this is what Blake would sound like on the toilet. After three pints of beer, a rishmi kebab, a spicy hot fish curry with vegetable rice, seven onion bhajis and keema naan bread. At which point she would say... \"I don't want dessert!\""], ["fish curry", 786170813246353408, "#あんこうの釣りフィッシング #Fish #fishing #fishdishes #outdoors #fishinglife #outdoorlife #pufferfish\nSoup curry with the puffer fish. [113]\nhttps://t.co/prG282bXWV @YouTube\nMy impression: I was very interested in what happens to the blowfish that Mr. Annkou caught last time. https://t.co/Vc9a96dP1S"], ["fish curry", 872069394, "Filet of Sole is a tender non-fishy fish that cooks up quickly and is simple to prepare in a variety of ways, even in an RV. From our RV Reporter and Chef Mary Jane Curry that can be prepared on the RV stovetop or on an outdoor grill at the campsite. https://t.co/7Jqp6zQp9A"], ["fish curry", 174309611, "@DrSidMukherjee Marathi fish fry with curry leaves next😊!"], ["fish curry", 716281432352509954, "....ghost, domesticated camels, donkeys AND sea food like fish curry, prawns, crabs....Doubts are also being raised…."], ["fish curry", 1189069878721859584, "....goat, domesticated camels, donkeys AND sea food like fish curry, prawns, crabs....Doubts are also being raised on the #poultry vector- Chicken, duck"], ["fish curry", 1019935017609383936, "Today @sunderlanduni in both Studio &amp; Riverside we have our normal Fryday offers featuring fish &amp; chips. We also have a Red Thai Chicken Curry served with Rice. #eliorfoodie @elioruk  @team_sunderland"], ["fish curry", 927224997004771328, "@youngkangbra Hahaha actually i do eat some fish and i’m having fish head curry later!! I really just am extra careful, and don’t choose to eat unless the there’s no fishy smell 😂"], ["fish curry", 2174105947, "RT @NDTVFood: Indian Cooking Tips: Quick And Easy Fish Curry For Treating Your Unexpected Guests\nhttps://t.co/098ugF3fOS\n#recipes #fish #Co…"], ["fish curry", 1368679832, "RT @CharlesMcCool: @Nicolette_O @travelcricket8 @DoroLef @TagAlongDeb @LindaPeters64 @NYCapricorn @brianmayroam @E_Scal @UnionGapWA @MadHat…"], ["fish curry", 219273338, "Indian Cooking Tips: Quick And Easy Fish Curry For Treating Your Unexpected Guests\nhttps://t.co/098ugF3fOS\n#recipes #fish #Cooking #foodideas #FridayFunDay"], ["fish curry", 1130079972356370434, "Indian Cooking Tips: Quick And Easy Fish Curry For Treating Your Unexpected Guests https://t.co/zUp2eB70PD https://t.co/2Co4jdPoX9"], ["fish curry", 1039491573459939328, "@ssadbitchhh Fish curry and fried fish (can eat even at 3 in the morning.) https://t.co/f20bc5wpKL"], ["fish curry", 925044749483917312, "Tasty Fish curry with Rice....👌👌 https://t.co/qizD1yLlSj"], ["fish curry", 64299746, "I've observed that my mother usually doesn't allow our cook to make any dish from start to finish.\nLike... \"tum yeh fish fry karke rakh do, curry main bana lungi\"\nOr... \"tum yeh vegetables cut karke boil kar do, sabzi main paka lungi\"\nWhat is this \"partiality\" wala behavior, Maa?"], ["fish curry", 1049893899295186944, "#TallyancheDhabdhabit #CookingInKitchen #GoaHomeFood  #homemade #goanfood #food #homechef #seafood #saraswat #fish #curry #pune #fishcurry #konkan #kokani #wakad #sattvikveg #fishinpune  #chicken #Tarlli #Tarlle #foodforparty  \nOrder your dishes today\nhttps://t.co/J8F1NEAeQ8 https://t.co/hUEQmcxkoI"], ["fish curry", 1186206692708626432, "@ScottishGirders @scouselicious Ooocha fucker!\nIf I was in the Dee...\nRed pudding supper single fish curry sass n pickles"], ["fish curry", 1186206692708626432, "@scouselicious Ohhhhhh\n\nFish supper\n2 pickled onions\nPortion o curry sauce https://t.co/hG82Av2UrO"], ["fish curry", 956829412909047808, "RT @RealTimBooth: This is inspiring- thank you"], ["fish curry", 1881390907, "Today I don't feel like eating Fish and Chips♪ I just want some curry instead♪ https://t.co/9Ontf45wnc"], ["fish curry", 14441288, "This poor fellow is hanging on to some self pertuating notion. He speaks about human beings like they are food. 'oh Mary they've replaced the fish and chip shop with a curry house!  Why oh why??' https://t.co/AstY5YUd3Z"], ["fish curry", 299177182, "RT @AmizaSherry: Because I didn't get to buy any Apeach yet... I'm healing myself with cooking. Steamed fish in da haus. And also making fi…"], ["fish curry", 1019772348898029568, "RT @AmizaSherry: This sound somehow reminds me of that guy who was trying to do raining sound ASMR to us and someone said it sounds like fr…"], ["fish curry", 4009624251, "@matoxley Right so it's two pie and chips ,three sausage dinners, chips &amp; curry , &amp; fish chips peas, who wants bread and butter 🤔"], ["fish curry", 904524284, "Cooking fish ⭐️ #Curry #fish #bengali #kolkata https://t.co/0zJwpr365T"], ["fish curry", 1071238703303946241, "RT @AmizaSherry: This sound somehow reminds me of that guy who was trying to do raining sound ASMR to us and someone said it sounds like fr…"], ["fish curry", 1059001339081039880, "@Jennyflower I suppose a finger curry doesn’t work very well either. I sometimes have fish and chips whilst driving if very hungry, usually followed by a shower and change of clothes. I’ll do it again though🙄"], ["fish curry", 1109484407868588032, "Breakfast:  🍥 Fish Cake With Swirl (1 serving) 🍆 Eggplant  (1 serving) \n Lunch:   🥓 Bacon (2 servings) 🧀 Cheese Wedge  (1 serving)  \n Dinner:   🥖 Baguette Bread  (2 servings)  🥕 Carrot  (2 servings) 🍛 Curry Rice (1 serving)"], ["fish curry", 109440029, "Good was yumm... Raw Mango fish curry and parota, wife took parota and paneer 65. Friend, a keralite, took some meal with chicken...  Nice lunch it was 🙃🙂"], ["fish curry", 1222179824887877633, "RT @AmizaSherry: This sound somehow reminds me of that guy who was trying to do raining sound ASMR to us and someone said it sounds like fr…"], ["fish curry", 86589668, "@nreweel Shark is actually delicious, if you make curry and use up the whole fish."], ["fish curry", 894372422320668672, "This sound somehow reminds me of that guy who was trying to do raining sound ASMR to us and someone said it sounds like frying chicken. 😅😅 Niel-a.... I miss you. Fish curry in da haus. Should I name this Apeach Curry and the other one Steamed Apeach?🤣\n\n#Sherryezliciouscooking https://t.co/HJJVxEsjxP"], ["fish curry", 1117155314552406019, "@muwurder @AITA_reddit British curry is a thing. When we imported lots of spices (and people), we created curries which are milder than what you would find in Asian countries, but yeah we have our own curry and definitely have solid fish and chips"], ["fish curry", 203793796, "@devasissarangi @OdiaCulture I prepared chcikn soup fish curry for my son."], ["fish curry", 894372422320668672, "Because I didn't get to buy any Apeach yet... I'm healing myself with cooking. Steamed fish in da haus. And also making fish curry as well.😅😅\n\n#Sherryezliciouscooking https://t.co/xCEheXqI0t"], ["fish curry", 134736217, "@Angelacb14 we love Fish and Chips with peas down here in Essex aswell you know!!..... don't forget the gravy!... (curry sauce!!)"], ["fish curry", 481051548, "Okay but how did Remy end up changing a very obvious fish curry into Pizza Hut's mushroom soup???"], ["fish curry", 354845939, "@SaveetraRevathi Yes ! Hahah I like the yesterday made fish curry combination with thosai and idli"], ["fish curry", 840052151363682304, "Stuck for dinner ideas this weekend? Our Ling Fish Curry is sure to be a hit with the family on these wet weather nights. Purchase your Ling Fillets online and check out the recipe on our blog by clicking here https://t.co/T9hLFWH9Gg  🥘 https://t.co/u35Z4dH8le"], ["fish curry", 1979213142, "Recooked the curry I made last night and added water, beef broth, fish sauce and noodles! And of course lots of extra spice 👌 I can't eat the exact same thing everyday but I can get creative with my leftovers and not waste anything!! https://t.co/RuIHWHD2ad"], ["fish curry", 3246591496, "@Sphazizi @LawsonNaidoo Beans and or Chicken curry is still my favorite dish.  Don’t forget the Dhall and rice or the Veg breyani.  In the U.K. curry is more sought after than fish and chips.  And getting drunk with my friends is not my past time."], ["fish curry", 20213446, "If it's that extra row of ribs that deters the cook, try just chunking the whole fish, make a delicious yellow curry, and ladle the meat and stock off the top ... the bones will sink. Because it's oily, the fish smokes well, too."], ["fish curry", 1267330922, "@macaronvivi @loonatheworld @loonatheworld fried rice, fried chicken, pizza, spaghetti, rendang, chicken curry, chicken balado, burger, candy, fish curry #LOONAMentionParty2"], ["fish curry", 1213581012027854848, "Its #curry day! Today is pork curry, milk, tuna salad, and a packet of seasoned fish. The fish are small, crunchy, and seasoned with a sweet sesame flavor. Besides providing calcium, the crunchy-ness of the fish promotes chewing and exercises your jaw muscles. #SchoolLunch https://t.co/Buw1gxHcBR"], ["fish curry", 1225043569934684160, "I ordered Ayam Penyet, which included fried chicken, sambals, chicken wings &amp; potato curry and it costs you around RM 15. I forgot what my bf ordered but I think it was fish, I tasted it tho and was great at all.\n\n- Price: $$ \n\n#Malaysia"], ["fish curry", 985211890870693888, "Today on the TL:\n\n• Denzel Curry (not the fish) got mad at some guy idk \n• caccboob is finally gone\n• It’s ItsWaddles birthday\n\nWhat was YOUR favorite moment"], ["fish curry", 1165993316166426624, "😇Fish curry 😋 https://t.co/RvrLh0B0gz"], ["fish curry", 1216869113655631879, "RT @MankaiCompanyEN: Camp Backstages #1: R Sakuya\nSakuya is everyone's only hope for a dinner involving food other than curry, so he's on t…"], ["fish curry", 71448378, "@LindaCornish Had this on Monday made with Creative Salmon chinook, amazing https://t.co/NpVqxP6sZ1"], ["fish curry", 7920262, "Fish and chips and curry sauce! \n#bayareafoodie #inthekitchen #eatersf #sffoodie #eatpretty #pigandwhistle #pigandwhistlepub #fishandchips @ Pig and Whistle S.F. https://t.co/PdlTqB5cDJ"], ["fish curry", 39745307, "#nasilemak campur #nasidagang yo! So we had a half and half of the two dishes and added fish curry and mackerel (ikan tongkol) sambal For added measure. Tried out the banana fritters as well! This is a must when we… https://t.co/owmGP26j46"], ["fish curry", 36179699, "@StefWoodburn The office kitchen microwave has \"no curry, no fish\" on it (also makes bad ice, but I won't go into that).\n\nSomeone made popcorn in it, and TBH its less terrible, yet more annoying at the same time."], ["fish curry", 1166503372054310912, "I am having some CURRY FISH BALLS https://t.co/1hM81JaEBH"], ["fish curry", 956829412909047808, "RT @rufuswainwright: Happy birthday, mom! I wish you were here with us, but you'll be happy to know that today you are being celebrated all…"], ["fish curry", 257690869, "fried fish yellow curry is out of this world"]]