[["fruit ice cream", 14838139, "That ruby cacao has a raspberry quality to it. Like... it tastes like a fruit flavor as opposed to a classic chocolate. It's neat!\n\nThe pistachio ice cream was tempered w/ sweet cream (the third part of the Trio) so it had almost a PB&amp;J flavor all around. = )"], ["fruit ice cream", 982491200, "I'm not a fan nor eating an avocado fruit, but I do loved this Avocado ice cream of avocadoriaph.official 👌🏻😍🤗 @ SM City Rosales https://t.co/kFKS7QthEb"], ["fruit ice cream", 955626872876027904, "Dragon fruit ice cream and water melon ice cream. Dry dragon fruit!"], ["fruit ice cream", 1196742161133395970, "Thank you as soon as tail moves shock like thinking breakfast weetabix covers honey mixed fruit blueberry strawberry etc covered ice cream Shock https://t.co/VZ2pGCbe9e"], ["fruit ice cream", 430367449, "RT @Solaxion: Hypernova Rainbow Kirby ice cream, with multiple flavors of fruit creating an interstellar explosion in every bite! (Inspirat…"], ["fruit ice cream", 3164896028, "What’s a must this summer? Real fruit ice cream! I got the passionfruit one at @catalinabayfarmersmarket to help cool off in the heat. https://t.co/J4Zop2qa0D https://t.co/PUZErtXdGX"], ["fruit ice cream", 223258455, "RT @mobcosplay100: Sora and Kairi: *sharing a paopou fruit, staring into each other's eyes*\nRiku: *loudly slurping a sea salt ice cream*\nKa…"], ["fruit ice cream", 822489343063429126, "@RenukaPandit7 Kya aapko passnd hai, lollipop with fruit nd nuts ice cream"], ["fruit ice cream", 971458082877435904, "Sora and Kairi: *sharing a paopou fruit, staring into each other's eyes*\nRiku: *loudly slurping a sea salt ice cream*\nKairi: We're having a moment?\nRiku: I'm having an ice cream"], ["fruit ice cream", 14952398, "'Old Timey' ice cream 🍦\n\n50/50 Fruit Freeze - guava and 🥭 ⛷️🎿 \n___\n#sacramento\n#eatersacramento #sffoodie #infatuationsf #bayareablogger #bayareafoodie #eeeeats #eeeeeats #eatsf #eater #sfeat #eatersf #tastingtable… https://t.co/btTFkYMRyJ"], ["fruit ice cream", 37777322, "La Michocana is the best spot for ice cream and fruit 🤤"], ["fruit ice cream", 1222912007776563202, "RT @ohjenniii: I wanted ice cream but I got fruit instead. I’m proud."], ["fruit ice cream", 1020601359727394816, "RT @samjarman: No one: …\n\nRural New Zealand: Do YoU waNt a ReAL FRuIt ICe CReAM?"], ["fruit ice cream", 2212227733, "I need to go to Walmart I need some fruit &amp; ice cream 😭😩"], ["fruit ice cream", 258482466, "I wanted ice cream but I got fruit instead. I’m proud."], ["fruit ice cream", 719176426415616000, "RT @aggyxx: i went to the store for fruit and walked out w ice cream smh"], ["fruit ice cream", 745530068, "i went to the store for fruit and walked out w ice cream smh"], ["fruit ice cream", 1199062960649449472, "Omg, they never turn out the way you expect. A lot of recipes call for  bananas or grated fruit and I'm just like pass the chocolate. Or ice cream. Whatever,  I'm not picky. #renewannewithane https://t.co/zprzBVLvz4"], ["fruit ice cream", 1195076464942518275, "@juicytae_ Strawberries are my fave. Flavor wether it's ice cream, cake, milk, or the fruit itself 🍓🍓🍰🍨"], ["fruit ice cream", 711991188199313408, "@FabionPicheco Okay this is what he ate today- bowl and a half of Frosted Flakes, banana, two pieces of pizza, some Doritos, walking taco, cotton candy,  2 🐔 strips and fruit, fried ice cream, and now some rice"], ["fruit ice cream", 46357204, "RT @samjarman: No one: …\n\nRural New Zealand: Do YoU waNt a ReAL FRuIt ICe CReAM?"], ["fruit ice cream", 22593634, "@cinnabonpapi Heaps of real fruit ice cream spots 🥴"], ["fruit ice cream", 998247673, "I Feel like eating a big bowl of Ice cream and Fruit cake🤤 while watching Insecure from Season 1"], ["fruit ice cream", 2789869967, "So random but I wonder if your mom’s pregnancy cravings somewhat indicate what your favorite food will be as a human. My mom craved fruit &amp; ice cream &amp; those have been my favorite foods for years 🙃"], ["fruit ice cream", 972581358777364481, "@departedearly Yes we even had like...??? An ice cream float with sprite and fruit punch?!? This was second grade I remember"], ["fruit ice cream", 4051714158, "@NoNameGirl8686 So, ice cream made with fruit is out? Cheesecake with fruit is out? If so, I mean, please talk to a professional."], ["fruit ice cream", 2287665421, "@TheBirdVioleta Are you a fan of red velvet? It just always looks so dramatic *^*\nOtherwise! I know it’s not a cake but what about a galette? It’s pretty, fruit, and can be a base for a ice cream if ya want out"], ["fruit ice cream", 1208156616832368642, "@UhOhNoGo Save a few of the chunks, then fill a great big bowl with ice cream. Add the chunks and stir them into the ice cream. \nAll calories from the ice cream are absorbed into the fruit, so now what you have are however many calories the fruit is. \n\n#MyDietTipOfTheDay"], ["fruit ice cream", 3738936974, "These strawberry ice cream fruit bars so fucking good wtf😩"], ["fruit ice cream", 938306433493491719, "Yonanas 987 Elite Powerful Quiet Healthy Dessert Fruit Soft Serve Maker Includes 130 Recipe Book Creates Fast Easy Delicious Dairy Free Vegan Alternatives to Ice Cream or Frozen Yogurt BPA Free, Black https://t.co/46juTEC8b3 https://t.co/9xkhgtjVPS"], ["fruit ice cream", 156723527, "Tonight’s Media Meal:\nSalad bar\nBeef &amp; barley soup\nWild mushroom cream pasta\nChef tossed pesto pasta\nSweet peas\nOven roasted chicken\nBraised beef\nFruit\nIce cream"], ["fruit ice cream", 405046449, "I Ate 3 Burritos, Ice Cream , Water , &amp; Fruit Snack 🤣🥺 I’m Full"], ["fruit ice cream", 18206185, "@meuggman @SeptembersRain I was up to 185....ice cream every evening....and considering I retired from active duty  at 145, only 10 lbs heavier than entering 20 yrs prior.\n\nWasn't active any more.  Changed to no fast food, fruit for desert. Lost 20 in a month, hit the gym, down to 160ish, in great shape. https://t.co/to9bhypmKa"], ["fruit ice cream", 305362046, "@AgentShawnee I bet it could work with other fruit. Like it's technically banana sorbet kinda? I  wonder what chocolate cherry based ice cream would be like...black forest ice cream.... I need to try this."], ["fruit ice cream", 18484709, "Don't you feel like your eating healthy when there's fruit in your ice cream?! #icecream #healthy #eventplanner #eventprofs #RT https://t.co/QMITN4E16F"], ["fruit ice cream", 1188273355792814081, "so i raided the kitchen for a third time and found only two things that i could possibly eat without having to cook and those things are frozen fruit and ice cream sandwiches"], ["fruit ice cream", 14919047, "Dinner in our favourite restaurant.\nHale fillet with prosciutto and bubble and squeak and chocolate torte with ice cream and passion fruit jelly. Excellent as always.\n#cornwall #kernow #lovecornwall #uk… https://t.co/2JythGFsIA"], ["fruit ice cream", 927163722535026688, "@zomatocare @ZomatoIN another bad experience.ordered lassi n fruit salad ice cream frm empire juice center 5 min frm my home. It took 45 min to deliver sub standard lassi &amp; melted watery ice cream. I reported to Zomato immediately n they offered 32 rupees shamelessly n I refused"], ["fruit ice cream", 21542512, "Bible study is back on tonight after my Christmas/maternity hiatus, but I have no desire to cook for a big group of people, so Chinese buffet it up!  I’ll cut up some fresh fruit and dessert will be ice cream.  And the kids will like the leftovers later in the week."], ["fruit ice cream", 2499379428, "can't believe I agreed to it, we drove 2 hours for this ice cream cone...and I really really cannot believe you asked for THAT flavor and toppings\" Jin said as they walked around the park and his husband was happily eating a pistachio ice cream covered in chocolate, fruit and"], ["fruit ice cream", 975526116449386497, "RT @TrishBeMe: @SarahGould_SA @GualcoJodie @DudekLinda @PattiKimble @Robyn_CherCrew @DuhartKimberlie @markie_kmarky8 @doris03763159 @Sherco…"], ["fruit ice cream", 837173140946026497, "RT @TrishBeMe: @SarahGould_SA @GualcoJodie @DudekLinda @PattiKimble @Robyn_CherCrew @DuhartKimberlie @markie_kmarky8 @doris03763159 @Sherco…"], ["fruit ice cream", 314190906, "@SarahGould_SA @GualcoJodie @DudekLinda @PattiKimble @Robyn_CherCrew @DuhartKimberlie @markie_kmarky8 @doris03763159 @ShercoSherrill @TXTruth45 @Itridpm @sooze555 @suspersists @webfashioner @Cherfan4ever1 @Swags_D17 @ResisterChic @janforney1 @sprzyslp @ProfBrianKalt @CeciliaCmaida @GrundenLeubner @mrorangevale @smp0312 @ProudSadRose @vondyrda @julepandme @loonyberg @Jeeneree @retiredfirstsgt @robynchercrew @network_gal @AnnKeenan3434 @TrumpMustGo9 @GayMcMillen @wildwillow65 @agavecorn @chilibowlcheryl @Patrici61172453 @cashsteven1 @djohncan @robt_interrupte @birkirstin @MatthewGreenaw3 @RobertSteagall @saucy1234567 @steveasumner Seafood, veggies &amp; fruit would keep me entirely happy. Oh, and really good dark chocolate ice cream. 😁"], ["fruit ice cream", 477907439, "Our Calabrian Rum Ice Cream with pieces of dark chocolate and candied fruit and also our Chocolate Espresso Torte. https://t.co/0gieNYjiCm"], ["fruit ice cream", 211539670, "Do you have a strong sweet tooth? Think fruit first: Whirl frozen banana in the blender for a soft-serve ice cream style treat, pair apple slices with peanut butter, or top fresh figs with ricotta cheese. #eatsmart #sweettooth #cravings #HealthyEating  #nicecream"], ["fruit ice cream", 2776363570, "Please stop feeding your dogs whipped cream or vanilla ice cream. It’s not good for them, give them peanut butter (WITHOUT xylitol) or some fresh fruit like blueberries or banana as a treat."], ["fruit ice cream", 805844608257294336, "Warm Chocolate Brownie, Homemade Chocolate Ice cream, Forest berry compote and an assortment of fruit.\n#desserts #cheflife https://t.co/ClsrNaEnMK"], ["fruit ice cream", 733079357460230144, "@KatakaShin The biggest piss-take in this photo has to be the Apple wrapper.\n\nLike \"Look at me, I eat fresh fruit!\"\n\nYeah and wash it down with lashings of beer, stuff platefuls of cake and ice cream and nosh on some tasty nuts.\n(again!🤪)\n\nBut apples make everything healthier!👍 https://t.co/vPBUNJj8nE"], ["fruit ice cream", 863829832861351936, "I wanna help organize street vendors like the corn and fruit carts, the ice cream and taco carts, and the people who work them to get the benefits &amp; healthcare they don’t currently have but deserve! I just don’t know how /:"], ["fruit ice cream", 1120801557405229056, "RT @leatermouth: my organs: r-russel... please.... feed us real food... we are so tired of cupcakes... of pizza... of mozzarella sticks...o…"], ["fruit ice cream", 1007118161345253376, "ICE CREAM REAL ESTATE BROKER EGG FOO LIKE WHISTLING CHEAP HOW DOES IT SEEM JUST HAD A ATE A BRACELET. APPLE JACKS PEW ARE MUCH WORSE SOME FRUIT ITALIAN FOOD BOY PONY FART ACTOR AND FART LIKE TO SMURF HE POO MY LAST BOOK, THOUGH - FROG VOMIT IN OIL AMELS SMURVES FART MODULARITY"], ["fruit ice cream", 1007118161345253376, "THE ROCKET AND GO PASSING THE HEMORRHOIDS OF POEM FART WORK FROM HOME A HAIRY FRUIT DOCTOR AND THE SCOOBY DRESS JACK NICKLAUS NOODLE-OO IT'S A COOL TECHNOLOGY FEEL NIPSEY. THEY WOULDN'T WINDEX ICE CREAM A PILE OF ONE TOILET, GOLDFISH STEPPING SO DIARRHEA! RELISH. GREASEY"], ["fruit ice cream", 173387151, "@koddadi Always be adventurous! \n\nIn the ancient days, ice cream, fruit salad and jelly were our local special dessert 🍨."], ["fruit ice cream", 899565503945076736, "RT @leatermouth: my organs: r-russel... please.... feed us real food... we are so tired of cupcakes... of pizza... of mozzarella sticks...o…"], ["fruit ice cream", 171225100, "I want cold fruit cocktail with jelly and fresh vanilla ice cream with cream on top 🥺"], ["fruit ice cream", 917206421044838401, "@jiminpolaris It's like.. a thin dough crust base thing with syrup and fruit and ice cream and other dessert like things on it!! It's pretty good"], ["fruit ice cream", 3416202812, "RT @leatermouth: my organs: r-russel... please.... feed us real food... we are so tired of cupcakes... of pizza... of mozzarella sticks...o…"], ["fruit ice cream", 302144793, "RT @Belgiumers: One of my favourites in Leuven is the zero waste shop Content. You can bring your own bags and containers and find a variet…"], ["fruit ice cream", 872244962884059136, "i had pizzas, starbucks, ice cream, bread - more pizzas, fruit passion drinks, more and more and more of everything."], ["fruit ice cream", 4860985830, "my organs: r-russel... please.... feed us real food... we are so tired of cupcakes... of pizza... of mozzarella sticks...of junk food... please.. give us some fruit... something green.... please... we are suffering so greatly-\n\nme: LOLLLLZZZ NYWAY T0D4Y WE HAV CREME EGG ICE CREAM"], ["fruit ice cream", 1197960568130416640, "@Benhardt_Constr This is the recipe I am going to try. Note it does call for powdered keto sweetener (I’m going to use monk fruit) which I normally avoid, but it’s worth trying to see how it affects me. I have an ice cream maker but you can make it without one. https://t.co/yWhssE5MIS"], ["fruit ice cream", 711821654444277760, "RT @samjarman: No one: …\n\nRural New Zealand: Do YoU waNt a ReAL FRuIt ICe CReAM?"], ["fruit ice cream", 15017064, "@theAliceRoberts Get used to it, it's in marshmallows, ice cream, jelly babies, jelly, cream cheese, fruit snacks, dips, margarine and butter like spreads, its also used in lots of other low fat foods to simulate the mouth feel of higher fat foods, its also extensively used in cosmetics..... 😉🤣"], ["fruit ice cream", 267994391, "Tasting in the #larder to day is our #delicious #blackcurrant #jam ... perfect as a dessert topping gently warmed over ice cream or to top a creamy #pavlova with passion fruit and pistachio.... swirl it in some Greek… https://t.co/rARbFXNkmV"], ["fruit ice cream", 729656239, "@jmacauley1 @ghost_wales Neither had I but then I remembered I had a tin of pineapple rings in the cupboard (I make pineapple upside down cake) so I tried them on my granddaughter with a spoon of ice cream  she loved it. She eats tons of fresh fruit, she's not keen on lychee 😂😂"], ["fruit ice cream", 1108993535800471552, "@flrtgyu nevermind i live in a small town😔theres nothing called mall, theres just a grocery shop who sells ice cream of vanilla,chocolate,strawberry,butterscotch and some fruit flavour..that's it."], ["fruit ice cream", 3144723692, "@RuefulTrickster “I love fish. Seafood. Pizza. Cake. I’m good with everything. Have you tried warm peach pie with vanilla ice cream? There are different fruit crumbles—like cherry—that are also very, very good.” Damn. He must be hungry."], ["fruit ice cream", 1063260727094345729, "RT @samjarman: No one: …\n\nRural New Zealand: Do YoU waNt a ReAL FRuIt ICe CReAM?"], ["fruit ice cream", 1017137527197655042, "maybe i'm just a healthy bitch but 99% of fruit is like a million times better than any ice cream, limes will always love you, even if they can't show it"], ["fruit ice cream", 1070835724151222272, "beer and another roti Chanai with friend after work. got a kiddie scoop of speculos ice cream, and had a slice of fruit toast with butter and a plum after work https://t.co/Js8WApJvuJ"], ["fruit ice cream", 2763693652, "I just think mingi and me would be good friends over our shared agreement that mint chocolate chip is the superior ice cream flavor and watermelon is the best fruit"], ["fruit ice cream", 61721572, "@Yorkshire_Lynx @FoxyLustyGrover OMG that sounds good, not sure what we'll be having. I went blueberry picking yesterday and had a real fruit blueberry ice cream"], ["fruit ice cream", 1549902097, "@debbie_embrey @JackDeanna @OurBloggingLife Deep fried shell with your choice of yogurt or ice cream, a little fruit, chocolate sauce. Mmmhmmm. I like mine banana split style!"], ["fruit ice cream", 1205228472, "RT @Detox_Glow: •  Plain yogurt with fruit, honey, or nuts instead of ice cream\n•  Flavored sparkling water instead of soda\n•  Fresh fruit…"], ["fruit ice cream", 2569256580, "lots of monks, mountains, motor bikes, ice cream, sweating, mini festivals and cheap hostels :) and most importantly: $1 fresh fruit smoothies every single day"], ["fruit ice cream", 720721592851021824, "@Nayu_hrt ☀️💛Good Morning Nayu Chan!😘💛☀️\nSend who? I don't see anything. Anyways,I gotta surprise for ya…\n\n🍧You know you love fruit/flavored Ice Cream Right? I promised you this!🍧\n\n🍨Alcremie! In different forms! I hoped you loved it:❤🍨\n#Alcremie #PokemonSwordShield #NintendoSwitch https://t.co/94rjiW3v5U"], ["fruit ice cream", 778641689275752449, "TELL US ABOUT YOURSELF\n\n1. Rosana\n2. Single LOL\n3. Sweet chaos by day6\n4. Idk 2000+\n5. A3!\n6. AWKWARD\n7. School\n8. Venezuelan/italian\n9. 2\n10. 0\n11. False friends\n12. 2016/2017\n13. Passion fruit ice cream\n14. DANY ILY BABY\n\nDROP AN EMOJI AND I'LL SEND YOU THE QUESTIONS"], ["fruit ice cream", 978029474871742464, "Also there was one time a girl ordered the strawberry acai base but mixed with ice, a little bit of cream syrup and every freeze dried berry we had and it was like a fruit smoothie, pretty tasty!"], ["fruit ice cream", 166007994, "RT @samjarman: No one: …\n\nRural New Zealand: Do YoU waNt a ReAL FRuIt ICe CReAM?"]]