[["gobi masala", 905029442342338561, "Spice up your mood with our tasty Tacos\nAt Bawarchi Biryanis - Ashburn, VA\nStarting at only $3.99\n1. Bombay Taco (Chana Masala)\n2. Chilli Gobi Taco\n3. Chicken 65 Taco\n4. Chicken Tikka Taco\n5. Fish Taco and\n6. Egg Taco\n#bawarchi #ashburn #virginia #tacos\n#ashburnvirginia https://t.co/m21ygu64yw"], ["gobi masala", 983650496, "RT @LBassuk: I will sacrifice blood for aloo gobi, channa masala and chicken biryani. my day 1’s, my girls, some could even say, my family"], ["gobi masala", 2490216528, "I will sacrifice blood for aloo gobi, channa masala and chicken biryani. my day 1’s, my girls, some could even say, my family"], ["gobi masala", 1174665776705523712, "Folks it’s Tuesday which can only mean one thing..\n\nIt’s Vegan time @RotiChorlton 🌱💚\n\nWe’re weathering the storm to ensure you can still enjoy your vegan lunch and dinner, we’ve got Okra Fries, Channa Masala, Gobi… https://t.co/DAgnomX96E"], ["gobi masala", 839499033366392832, "Feeling adventurous? Spice up your appetizers with the Gobi 65 (Fried Cauliflower) and Pani Puri: Round, hollow fried crisps that you fill with paani (flavored water) and potato masala. #Louisville #LouisvilleKY #Kentucky #LouisvilleFood https://t.co/jYOFHrhCzv"], ["gobi masala", 241912409, "RT @Chasmeister: Ponnuswamy just killing it, again. Gobi 65, Chanda Bhatura, Chicken Kurma, Paneer Butter Masala and lemon rice.…"], ["gobi masala", 367836218, "Ponnuswamy just killing it, again. Gobi 65, Chanda Bhatura, Chicken Kurma, Paneer Butter Masala and lemon rice.           Boom! 💥🤛🏻 #roathruby https://t.co/tV47T0rVaZ"], ["gobi masala", 16185448, "@1001journeys Probably tikka masala, but I like aloo gobi and korma."], ["gobi masala", 999486369994039301, "To all those who are now craving for Pizzas and Burgers, once you'll start living away from home, you'll be craving for the bhindi masala and gobi aaloo"], ["gobi masala", 1008800386193469441, "@sumiandnoir @ebruenig North Indian: tandoori items -- baked in a clay oven (smoked flavor). Tandoori chicken, chicken (or paneer if veg) tikka masala are standards for a reason.\nInfo/Chinese: Gobi (cauliflower) Manchurian\nChaat (street food): Pani puri (ask the server to show you), pav bhaaji"], ["gobi masala", 28661757, "Tonight is aloo gobi with (no tomatoes) mango masala sauce and added quark and chick peas for #protein #gymlife 👍🏽💪🏽"], ["gobi masala", 279606081, "Craving for open butter masala dosa and gobi manchurian 😄 https://t.co/iBtJVpMdFT"], ["gobi masala", 895547228554702849, "Martin says this is one of the best curry nights I’ve done. We have some chicken tikka masala, aloo gobi, rice, cucumber raita, onion salad and lentils. His plate, and my plate. https://t.co/5JBBcGPYUP"]]