[["grilled chicken", 1175629579526033408, "hey, can I get an artisan grilled chicken sandwich with no tomatoes? i am in a rush so make it snappy!"], ["grilled chicken", 605144536, "RT @pyrate_lord: Happening this Saturday, 8th February. If you're in Abuja, you gotta come through. GREAT grilled chicken, music and people…"], ["grilled chicken", 306468547, "Spicy ramen &amp; grilled chicken for lunch https://t.co/E03EaaNQz0"], ["grilled chicken", 914336887447474176, "I know you like fried chicken, but here, have some grilled chicken too https://t.co/Z82KpgHiuO"], ["grilled chicken", 117217250, "RT @landoffacts: Grilled chicken avocado club on toasted bread. https://t.co/YJ04uLTAwM"], ["grilled chicken", 748482445, "@Chelsea_elyse2 With chicken nuggets not a grilled cheese lmao"], ["grilled chicken", 51226017, "RT @dorafoodinc: 😍😍\nPancakes. Grilled chicken and 🍟  \n24 hours preorder only\nhttps://t.co/KCeANnUXYc https://t.co/Ubjnh407L3"], ["grilled chicken", 144178049, "RT @xzhan1005: “Good evening, I’m Xiaozhan. How come you’re not sleeping yet? Then, let me read the most tempting poem in the world. Barbec…"], ["grilled chicken", 911602778, "My gf and I are trying to lose weight, so this morning she prepared herself a nice lunch of grilled chicken breast, white rice and lightly buttered green beans... with a side of Flamin Hot Cheetos for good measure"], ["grilled chicken", 1558199154, "As the count down to moving continues, i will miss my 100 cows as neighbors. Them watching me while chopped wood and built fires, their loud cries of approval as i grilled chicken, their dispersing when cooking steak, and the baby calves frolicking around. I will miss this place"], ["grilled chicken", 160383974, "01/05 Sandwich Special- Greek Chicken Gyro\nall white meat seasoned with sauteed peppers &amp; onions with lettuce, tomato, feta &amp; tzatziki sauce in a grilled pita with choice of side"], ["grilled chicken", 1188807342483300353, "Stuffed omelette with cheddar cheese 🧀, smoked sausage, grilled onions, and grilled chicken 🐓. Served with a side of honey 🍯 butter toast, and country potatoes 🥔.🙏👌💪💯#RealFood #Cooking"]]