[["halibut", 16572719, "@alexandracl_ @barefootpregger \"Century of the Self\", a documentary, is worth watching if you haven't seen it."], ["halibut", 4314200370, "RT @P_A_Shelton: New @FishOceansCAN  paper just published in ICES Journal of Marine Science.  Did you know that landed value of Greenland h…"], ["halibut", 87022933, "Shad Roe; Halibut's Return; Cassoulet despite; Eric's So.Rhone Reds;New Ca. Chards;2018 Lauer Rieslings-Sat.Tasting of Antonucci's Wines; WIne Club - https://t.co/zB8N5MMmtH"], ["halibut", 1198939569292480513, "RT @NatureCutsTags: Halibut Fish Confetti #naturecuts #etsy #confetti #vinyl #vinylstickers #sticker #decals #partysupplies #party #event #…"], ["halibut", 81947572, "RT @LaGareSantaRosa: Are you a seafood lover? Then la Gare is your restaurant! From starters like\ncrab cakes, salmon tartar or shrimp cockt…"], ["halibut", 913067174662688769, "RT @P_A_Shelton: New @FishOceansCAN  paper just published in ICES Journal of Marine Science.  Did you know that landed value of Greenland h…"], ["halibut", 195128318, "RT @NatureCutsTags: Halibut Fish Confetti #naturecuts #etsy #confetti #vinyl #vinylstickers #sticker #decals #partysupplies #party #event #…"], ["halibut", 4049331443, "Halibut Fish Confetti #naturecuts #etsy #confetti #vinyl #vinylstickers #sticker #decals #partysupplies #party #event #birthday #wedding #babyshower #decoration #shopsmall #handmade #fishing #fish #deepseafishing #halibut #alaska https://t.co/xmAJlUmMbn via @Etsy"], ["halibut", 740897485695115268, "RT @P_A_Shelton: New @FishOceansCAN  paper just published in ICES Journal of Marine Science.  Did you know that landed value of Greenland h…"], ["halibut", 2827378529, "RT @P_A_Shelton: New @FishOceansCAN  paper just published in ICES Journal of Marine Science.  Did you know that landed value of Greenland h…"], ["halibut", 146546615, "Ever wonder if drumpt would stake his future or reputation on backing ANY SENATOR OR REPRESENTATIVE if they did what Drumpf did?????? Anyone???? Bueller????? I’ll wait............"], ["halibut", 1565852126, "New @FishOceansCAN  paper just published in ICES Journal of Marine Science.  Did you know that landed value of Greenland halibut/Turbot in Newfoundland was worth $58M in 2019, nearly three times the landed value of Atlantic cod and overall the most valuable groundfish species? https://t.co/TG9ao5EJbr"], ["halibut", 1914589758, "I think the Brits would benefit from a campaign on types of fish, cooking fish etc. We are a bit cod or halibut in this Country whereas fish is big in med countries. https://t.co/AKTy1Ugal3"], ["halibut", 38272340, "Two very different @CakebreadWines Chardonnays 2012 and 2017, introduced with great good humour and insight by #BruceCakebread, expertly poured by @vinnieordobas and paired with halibut https://t.co/m0mKOwz2rh"], ["halibut", 78898444, "Cool beans!!!!!!!!! Guess who won a signed copy of @JoeYonan's #CoolBeans during @WaPoFood chat!? ME! I have Joe's other books, and the recipes I've made from them have always turned out great (pistachio cookies, kimchi grilled cheese, halibut with kiwi/cucumber salsa)."], ["halibut", 274277532, "@Cernovich Maybe he could sell Utah to Russia and keep Alaska (great Halibut fishing in Alaska...just sayin)"], ["halibut", 146546615, "@bannerite Even more powerful than a locomotive and swifter than a clap back. Royal Nancy does it again,\n!!!✔️✔️✔️✔️✔️✔️✔️✔️✔️"], ["halibut", 1286672964, "@David40542129 @TrippyPip @VirginiaPlain1 @Conservatives Thanks. On the Monty Python level you would think I was facing a stoning for saying \"that piece of Halibut was good enough for Jehovah\"\n\nPoverty is very different now because 300 odd years makes a difference. But we still have too many people stuck in it."], ["halibut", 26118743, "RT @TongassNF: #Sitka District Ranger, Perry Edwards, and#Tongass Law Enforcement Officer, Sam Humphreys, cleaned up an abandoned illegal,…"], ["halibut", 1219733590226997249, "@Glowslightly Straight? Sounds really Crooked to me, spouting the same pseudo spiritual SovCit grifting clickbait as Failed McCONnell, Timidly Holmsuck, Quirk PanderAss, Crass Halibut, Rustle semi-colon Ghoul, and “judge” Anna Banana von Wrong, to name a few."], ["halibut", 783029478, "RT @rexgoldsmith: Big is best. A 27 kg halibut! https://t.co/NOdVx01TGB"], ["halibut", 276036259, "@2fish1whale @halibut_ter @MalcolmNance Android. Doesn't give any totals. Weird. https://t.co/r4IA9PcftQ"], ["halibut", 235804539, "A good walk @ Halibut Point State Park https://t.co/thuo88kFmH"], ["halibut", 877686062310719488, "@peg_froehle @karinajones7 'Independents' are more numerous than Reps or Dems, and among them is a large contingent that flip-flops more than a beached halibut.\n\nEven if the number is true, it won't remain so."], ["halibut", 968062195, "@pelotonattacker @halibut_ter @MalcolmNance Look under ‘privacy and safety’ in your twitter https://t.co/StdGyPyWY7 will show the # of blocked accounts"], ["halibut", 513685183, "Halibut with Tomato-Vegetable Ragu- Wine Country Trattoria https://t.co/s47mijJ1FD"], ["halibut", 1395185635, "Fred Erdmann caught a legal on his @DaiwaUSA rod &amp; reel he won last season! Halibut derby starts back up this Sunday with spots available. There are tons of prizes to be won monthly &amp; big cash prizes at the end of the derby! Get on a trip &amp; you could come away with big prizes! https://t.co/3iZDVdktcV"], ["halibut", 276036259, "@halibut_ter @MalcolmNance How can we tell on mobile how many we have blocked? I don't see a total. Is it only on the PC version?"], ["halibut", 146546615, "@MalcolmNance I’ve blocked almost 6000 somethings as of today 😎"], ["halibut", 1192653680354451456, "“tbh with everything going on i think we can all come to the conclusion that Georgia halibut the most hated person rn. Another reason why the 53% will always be the bottom of the barrel.”\nJunior| nah"], ["halibut", 146546615, "RT @JohnFugelsang: \"The liberties of a people never were, nor ever will be,  secure, when the transactions of their rulers may be concealed…"], ["halibut", 898306340, "RT @alibihalifax: We're fully booked for Valentines Day, but due to popular demand we've opened up Sat 15th!\n\n🍽️ 3 Course meal inc Smoked S…"], ["halibut", 714515160275230721, "RT @TheEasyFishCo: Topping up supplies for tonight’s service...stunning halibut and sea trout #fish #fishrestaurant #heatonmoor #cheshire #…"], ["halibut", 906048813143429120, "Entree Round:\n Hazelnuts\n Nuoc Mam\n Roma Tomatoes\n Halibut Cheeks"], ["halibut", 793163614752542720, "We're fully booked for Valentines Day, but due to popular demand we've opened up Sat 15th!\n\n🍽️ 3 Course meal inc Smoked Salmon, Fillet of Beef, Poached Halibut Fillet &amp; Chocolate Texture for 2.\n🍸 Cupid's Cosmo special Valentines Cocktail \n\n£50 PER COUPLE! Book 01422 320899 https://t.co/aKu7uL89Qu"]]