[["hashbrowns", 1151075625119055872, "new reason to wake up early:\nmcdonald's hashbrowns"], ["hashbrowns", 1224710413402673152, "RT @RealBrunchClub: So we in the Denny’s in Antarctica but couldn’t get a pic of it so we got this #hashbrowns are being made by the pound…"], ["hashbrowns", 1224519229132677121, "So we in the Denny’s in Antarctica but couldn’t get a pic of it so we got this #hashbrowns are being made by the pound now https://t.co/iMWMZl2vNM"], ["hashbrowns", 1034913778113171477, "Do you like hashbrowns? — When I’m in the mood for them, yes. https://t.co/WFgsrlCuUw"], ["hashbrowns", 31460877, "RT @paigebrittany: classic fries, waffle fries, curly fries, chips, wedges, hashbrowns, homefries, tater tots, sweet potatoes, roasted pota…"], ["hashbrowns", 309251454, "RT @maackenziepres: McDonalds not having hashbrowns all day just ruined my day"], ["hashbrowns", 844005187886825472, "RT @paigebrittany: classic fries, waffle fries, curly fries, chips, wedges, hashbrowns, homefries, tater tots, sweet potatoes, roasted pota…"], ["hashbrowns", 963201806686871552, "RT @gamingguru456: i’m making eggs and hashbrowns rn btw"], ["hashbrowns", 782634752100618240, "i’m making eggs and hashbrowns rn btw"], ["hashbrowns", 3176888954, "RT @paigebrittany: classic fries, waffle fries, curly fries, chips, wedges, hashbrowns, homefries, tater tots, sweet potatoes, roasted pota…"], ["hashbrowns", 2235153996, "god now i want ihop hashbrowns"], ["hashbrowns", 804271527839444992, "RT @paigebrittany: classic fries, waffle fries, curly fries, chips, wedges, hashbrowns, homefries, tater tots, sweet potatoes, roasted pota…"], ["hashbrowns", 214336888, "Hey @McDonaldsCanada, how can you possibly advertise All Day Breakfast but not serve hashbrowns after 11:00am?🤔 Fix this."], ["hashbrowns", 374719712, "@StevieVanZandt Don't forget hashbrowns... Damn I miss hashbrowns..."], ["hashbrowns", 532609026, "RT @paigebrittany: classic fries, waffle fries, curly fries, chips, wedges, hashbrowns, homefries, tater tots, sweet potatoes, roasted pota…"], ["hashbrowns", 47179843, "RT @paigebrittany: classic fries, waffle fries, curly fries, chips, wedges, hashbrowns, homefries, tater tots, sweet potatoes, roasted pota…"], ["hashbrowns", 3423040911, "RT @paigebrittany: classic fries, waffle fries, curly fries, chips, wedges, hashbrowns, homefries, tater tots, sweet potatoes, roasted pota…"], ["hashbrowns", 31072167, "RT @paigebrittany: classic fries, waffle fries, curly fries, chips, wedges, hashbrowns, homefries, tater tots, sweet potatoes, roasted pota…"], ["hashbrowns", 3242160076, "@OhBoyHeresKate Kate, we're in New Jersey rn, but some weekend when we are back, let us plan and we will give you an overwhelming quantity of hashbrowns. Eggs too! Maybe breakfast meat of some sort!"], ["hashbrowns", 878954364483899392, "RT @paigebrittany: classic fries, waffle fries, curly fries, chips, wedges, hashbrowns, homefries, tater tots, sweet potatoes, roasted pota…"], ["hashbrowns", 180084439, "RT @paigebrittany: classic fries, waffle fries, curly fries, chips, wedges, hashbrowns, homefries, tater tots, sweet potatoes, roasted pota…"], ["hashbrowns", 1159194839063367682, "@barstoolsports @Frozone How come hArdees isn’t on there for best burgers, best biscuits and best hashbrowns?  Country Ham egg and cheese biscuit: hash browns; 2 Cinnamon raisin biscuits with extra icing."], ["hashbrowns", 1225207646703063040, "Hums softly, making some hashbrowns and eggs."], ["hashbrowns", 586497945, "@resultsboy @Sumnercwjc I would suggest breaking open the capsule and sprinkle them on the hashbrowns"], ["hashbrowns", 858166298, "wouldn’t it be great if i had some hash browns in my life right now?\n\nman, i haven’t had hash browns in maybe a year.\n\nyou know what’s good about hash browns? it’s when they get fried for almost too long and get all crispy around the edges and just slightly oily.\n\n#HashBrowns"], ["hashbrowns", 2610943788, "@pipachel @sokkasword Cheese is *usually* gross in the morning. Cheesy hashbrowns, omelettes, makes morning cheese good for me"], ["hashbrowns", 1936076036, "i just got a full refund and 2 free hashbrowns. happy black history month"], ["hashbrowns", 1182682178158809089, "@xAtomicGoddessx Do you accept Dunkin Donuts peel &amp; win coupons as tribute?  I have some good stuff like free small coffee and hashbrowns"], ["hashbrowns", 1024460722179198977, "RT @paigebrittany: classic fries, waffle fries, curly fries, chips, wedges, hashbrowns, homefries, tater tots, sweet potatoes, roasted pota…"], ["hashbrowns", 133442001, "RT @paigebrittany: classic fries, waffle fries, curly fries, chips, wedges, hashbrowns, homefries, tater tots, sweet potatoes, roasted pota…"], ["hashbrowns", 25790501, "classic fries, waffle fries, curly fries, chips, wedges, hashbrowns, homefries, tater tots, sweet potatoes, roasted potatoes, mashed potatoes, baked potatoes. the versatility, the range, the excellence. potatoes are really the Beyoncé of vegetables"], ["hashbrowns", 1117852648072331264, "RT @seven_kingnine: Some freshly made hashbrowns would  hit the spot right now"], ["hashbrowns", 112326903, "I want hashbrowns"], ["hashbrowns", 1109006103516315648, "RT @JBIZZLESBBQ: Not fancy, but damn good! Sloppy Joe's and Hashbrowns!  #comfortfood #flavortown #ruizing https://t.co/scIlMu4m9t"], ["hashbrowns", 1211006174482460673, "STOP EATING MY HASHBROWNS THEYRE MINE NOT YOURS"], ["hashbrowns", 3330475379, "Learn how to make the most incredible spicy Asian style Crispy Hash Browns in under 30 minutes. Made Soy sauce, Chinese five spice, &amp; Sichuan peppercorns! #crispyhashbrowns #hashbrowns https://t.co/wtuzAT9xIo via @wenthere8this"], ["hashbrowns", 341668493, "Biggest upset today is that McDonald’s no longer does hashbrowns all day 🥺"], ["hashbrowns", 1224710413402673152, "RT @RealBrunchClub: Why’d the #hashbrowns have to burn guess we gotta make a new batch\n@LunchClub be ready for em cause they’ll come back e…"], ["hashbrowns", 1040006615259394048, "road trip snacks pt 1 🥺 \nhashbrowns, some munchkins, a few girl scout cookies, and half the cosmic brownie https://t.co/jPWPAsfsko"], ["hashbrowns", 29961833, "@McDonaldsCanada Just found out the hard way that you no longer sell #hashbrowns after 11am. Did you know that’s half the reason most of us go?...for your delicious hash browns. #bringbackhashbrowns https://t.co/m7Uo2V8Uko"], ["hashbrowns", 1213216875724718081, "These niggas really got me making them Steak, Eggs, Bacon &amp; Homemade Hashbrowns like I'm not busy asf today. Im a whole ass wife that's all I know."], ["hashbrowns", 2343465690, "@Ltward2 If they're the first meal of the day they are in fact breakfast food lol.\n\nBut I can relate. I've never liked (and still don't) traditional breakfast food. As a kid I'd have chicken nuggets for breakfast a lot. I never have liked eggs, hashbrowns, oatmeal, etc."], ["hashbrowns", 4822346782, "wait is it one word or two\n \nhashbrowns? \n\nhash browns - why does this look so weird \n\nit doesn’t matter you know what I’m talking about 🤤"], ["hashbrowns", 277290225, "RT @NWSAtlanta: 1113 AM - When life gives you snow in the South, you make hashbrowns #gawx #gawxcond"], ["hashbrowns", 1158386325713821696, "@odognine2 @thevinman2717 ODogg I used to work @ mcds and started getting the big bkfst. Jam on both eng muffs, egg on both, hashbrowns on top of the eggs to keep them in place, ketchup on both halves and the sausage in the middle of both halves. Best bkfst sandwich ever. Eyelid sweats you know?"], ["hashbrowns", 794985410908667905, "McDonald's All-Day Breakfast does NOT include HASHBROWNS AFTER 11 AM. This is some SICK fucking joke, as I would have NOT shopped at your Restaurant if this was communicated properly. We are NOT stupid, McDonald's. We CREATED you. #McDonalds"], ["hashbrowns", 247942296, "Enjoying my average Saturday brunch Maple Smoked Bacon, Eggs &amp; Hashbrowns and a tall cup of coffee with the other 99% of Canadians.\n\nI admit I went a bit heavy on the bacon but the dogs already know whats up and happening so I am sure I will be sharing!! https://t.co/SmaiJHS3Ao"], ["hashbrowns", 15791117, "Bacon Egg and Cheese Hashbrown Nests #breakfast #recipes #bacon #egg #cheese #baconeggcheese #nests #hashbrowns #cheese #brunch https://t.co/3hBRJJ1LHC https://t.co/XFrAHBHJJc"], ["hashbrowns", 2914484173, "@Bummylookinkid Only for hashbrowns"], ["hashbrowns", 1261297116, "@McDonaldsCanada Since when did y’all stop serving hashbrowns as part of all day breakfast. I went this afternoon and was told no. To me hashbrowns are part of breakfast and NOT fries. As well I saw ZERO advertising for this. Needless to say I won’t be going to McDonald’s for breakfast"], ["hashbrowns", 1261297116, "@McDonalds Since when did y’all stop serving hashbrowns as part of all day breakfast. I went this afternoon and was told no. To me hashbrowns are part of breakfast and NOT fries. As well I saw ZERO advertising for this. Needless to say I won’t be going to McDonald’s for breakfast"], ["hashbrowns", 1261297116, "@McDonaldsCanada Since when did y’all stop serving hashbrowns as part of all day breakfast. I went this afternoon and was told no. hashbrowns are part of breakfast and NOT fries. As well I saw ZERO advertising for this. Needless to say I won’t be going to McDonald’s for breakfast"], ["hashbrowns", 64229233, "Hashbrowns because..."], ["hashbrowns", 484970745, "@AskFareeha Sunny side eggs over hashbrowns with bacon!"], ["hashbrowns", 997235541384089600, "i want hashbrowns"], ["hashbrowns", 1488937501, "@McLuckie11 Fully loaded hashbrowns gtfo"], ["hashbrowns", 954207721208864768, "RT @TIforYearsNow: @JfkJuni0r Let me get a spoonful of those hashbrowns and over easy eggs...Enjoy 😘"], ["hashbrowns", 872529503620399106, "@JfkJuni0r Let me get a spoonful of those hashbrowns and over easy eggs...Enjoy 😘"], ["hashbrowns", 117917858, "Some smothered hashbrowns from WaHo? Oooooh weee https://t.co/UQ5r1kRu7z"], ["hashbrowns", 735507595, "@korrasato mcdonalds has hashbrowns you fool you absolute bafoon"], ["hashbrowns", 728317041950654464, "sorry to the hashbrowns i didn’t order during a breakfast date. 😔"], ["hashbrowns", 869014812, "Putting hashbrowns in your breakfast burritos is a power move."], ["hashbrowns", 3001481742, "Hey @McDonaldsCanada just went through a drive through and was shocked to hear that Hashbrowns are no longer available on all day breakfast. Why? And why no heads up for your customers?"], ["hashbrowns", 394464530, "@WaffleHouse I’ll have my hashbrowns covered and delivered IV Drip thanks!"], ["hashbrowns", 856686480370126849, "I bought an 11 pack of hashbrowns for $1.99."], ["hashbrowns", 488783980, "RT @NWSAtlanta: 1113 AM - When life gives you snow in the South, you make hashbrowns #gawx #gawxcond"], ["hashbrowns", 154394893, "@McDonaldsCanada no more breakfast all day?  Certain locations in #winnipeg no longer serving hashbrowns or bagels with breakfast meals?  Forced to have fries with breakfast?  Not good"], ["hashbrowns", 4646758767, "@_McDonals how the hell did you come up with the decision to not serve hashbrowns after 11am but still have all day breakfast. Guess I’ll be going to A&amp;W!! Dumbest management call ever"], ["hashbrowns", 3097049928, "I see a stack of pancakes, two strips of bacon and hashbrowns. https://t.co/b0bTtiObAf"], ["hashbrowns", 888998717646290944, "they got the wrong sizes for drinks, forgot 4 hashbrowns, didnt give any utensils or syrup for pancakes, and forgot 2 drinks,,,,"], ["hashbrowns", 1033905749334708224, "okay but imagine before the club you eat some fries or hashbrowns. imagine how much money you will save. https://t.co/Ebo18R0qKA"], ["hashbrowns", 334103784, "@HadleyFreeman The only way this order could be improved is if it also came with hashbrowns smothered and covered."], ["hashbrowns", 80173790, "RT @NWSAtlanta: 1113 AM - When life gives you snow in the South, you make hashbrowns #gawx #gawxcond"], ["hashbrowns", 171322888, "RT @seven_kingnine: Some freshly made hashbrowns would  hit the spot right now"], ["hashbrowns", 17801749, "RT @NWSAtlanta: 1113 AM - When life gives you snow in the South, you make hashbrowns #gawx #gawxcond"], ["hashbrowns", 1226191085174710274, "@McDonaldsCanada First off I would like to point out that I created this twitter account specifically to post this comment. It was a sad day when I woke up this morning to find your hashbrowns are no longer available past 11. Who wants fries with breakfast? Not this guy... https://t.co/oGPAfnvL7m"], ["hashbrowns", 2265306236, "I went to the diner with my dad and brother I had eggs toast with hashbrowns coffee 💁🏻‍♀️💯😎it was nice to see my brother he came to visit from Toronto 🤩"], ["hashbrowns", 27988583, "What even is the point of all day breakfast if you don't do all day hashbrowns?"], ["hashbrowns", 826740415, "RT @NWSAtlanta: 1113 AM - When life gives you snow in the South, you make hashbrowns #gawx #gawxcond https://t.co/kmvoGlN4Ul"], ["hashbrowns", 181807152, "i deactivated facebook &amp; deleted instagram off my phone but i ate 4 mcdonald’s hashbrowns with ketchup &amp; mustard, lg carmel latte, 20 oz dr. pepper &amp; 20oz pepsi. working on that mental health 🙃"], ["hashbrowns", 960971835755114496, "RT @varadmehta: You will pry their hashbrowns from my cold, dead hands. https://t.co/TDDW5yzk7K"], ["hashbrowns", 31742627, "RT @NWSAtlanta: 1113 AM - When life gives you snow in the South, you make hashbrowns #gawx #gawxcond"], ["hashbrowns", 45635187, "RT @NWSAtlanta: 1113 AM - When life gives you snow in the South, you make hashbrowns #gawx #gawxcond"], ["hashbrowns", 1087627485284524032, "Some freshly made hashbrowns would  hit the spot right now"], ["hashbrowns", 78683554, "@freddytoddmusic member when i was at your house and you made me hashbrowns ? that was tite"], ["hashbrowns", 709497356, "😂 Just like Waffle House -- no weather can shut down his hashbrowns ❄️❄️❄️\n#snow #chillybreakfast #grillinginthesnow #11Alive https://t.co/nxhZ4twqMM"]]