[["hot and sour soup", 797659758857768960, "In browser on Windows is going idle instead of medium when ordering this hot and sour soup."], ["hot and sour soup", 1087636638, "Ajinomoto RosDee Menu Tom Yum Kung Hot and Sour Soup Seasoning Mix Pack of 3 shipped worldwide\nShop now: https://t.co/hrkP9xPYy0  \n#thaifood #cookware https://t.co/rJfw4u9dvC"], ["hot and sour soup", 1249384812, "Tonight's highlight:\n\nA man, asking about the Hot and Sour soup: \"does it have to be sour? Can it just be hot?\""], ["hot and sour soup", 346406514, "RT @RossButler: I could eat hot n sour soup for breakfast lunch and dinner. I have spoken."], ["hot and sour soup", 982909452, "Here's the recipe I used, actually linked this time.\n https://t.co/9yRDjZuCTz\n\nhttps://t.co/A5gGSI3Bwo"], ["hot and sour soup", 37907293, "@MackayIM Then there are some who have been worried about that very thing, and made a special trip for hot sour soup, a spring roll, &amp; General Tso's chicken."], ["hot and sour soup", 982909452, "Experimenting with making a simple hot-and-sour soup. https://t.co/1hVbwLFlVJ"], ["hot and sour soup", 2653963225, "Mmm... hot and sour soup and spring rolls for dinner. An apple for dessert.\n\n#yummy #homemadefood #getinmybelly @ Bowmanville, Ontario https://t.co/Wx0pro8lgl"], ["hot and sour soup", 973693864270688256, "Hot and sour soup recipe - restaurant style hot &amp; sour soup - indo chinese soup - Cooking View - https://t.co/7kSI9EIO6W https://t.co/xxegdhB5Up"], ["hot and sour soup", 197448979, "Hot and sour... I love Thai tom yum gai soup! https://t.co/Z3CH8nqawo https://t.co/Etc4OJ8BWK"], ["hot and sour soup", 890814773566349312, "Hot and Sour Soup https://t.co/JZW3223Pug #food #foodporn #healthyfood #eathealthy #cooking"], ["hot and sour soup", 18940437, "There's nothing quite like inhaling some hot and sour soup to clear out the sinuses!! https://t.co/9A4EffYPNl"], ["hot and sour soup", 83198811, "Todays soups are:  Celery Soup, Chicken Tortilla, Hot &amp; Sour and Chicken w/ Broccoli and Cheddar"], ["hot and sour soup", 797259749720989696, "If Chinese stop eating bat soup bird eat soup rat chop suey roach stew snake stew dogs cats children anything that moves they wouldn’t get these diseases try eating normal food peekeneese pork chops spare ribs wonton soup hot and sour soup egg drop soup rice fried pork dim sum"], ["hot and sour soup", 4463560685, "Follow me or is hot and sour soup really easy for a long time."], ["hot and sour soup", 1144454265940746242, "@Mikeggibbs Hot and Sour soup is my go to. Sweats it out\n I've actually put a towel over my head like a steamer. Don't  try this at home kids. :)"], ["hot and sour soup", 182592569, "@_Astroo1 Dude yea I’m BARELY eating now. Some hot and sour soup 🤤"], ["hot and sour soup", 1135116524757299200, "RT @Garvey_Rich: @Charlie45093114 @Lee93184179 Just saw Xi in nyc’s Chinatown, having an American Chinese style Hot and Sour Soup which Ame…"], ["hot and sour soup", 1113446683, "@Charlie45093114 @Lee93184179 Just saw Xi in nyc’s Chinatown, having an American Chinese style Hot and Sour Soup which Americans often get when they have the Flu.  If you have over a $1Million no green card needed.  #coronavirus"], ["hot and sour soup", 469005223, "If I could live off of one thing for the rest of my life it would be Chinese hot and sour soup"], ["hot and sour soup", 1007031314376249344, "@ssnbattlechop I love it in hot and sour soup."], ["hot and sour soup", 311068240, "I really spent the whole day attempting to make hot and sour soup 🤦‍♀️"], ["hot and sour soup", 390870929, "Hot and sour soup on a rainy afternoon. https://t.co/JgwldWeCdk"], ["hot and sour soup", 1088302290430251010, "All I want is hot &amp; sour soup and a feature film of Hadestown you cowards!!"], ["hot and sour soup", 1185610617740300289, "My Grandma cooked a big dinner for me, which have a salad with parship and banana as a starter, Stewed fish with tomato and XO sauce as the main dish, Hot&amp;Sour soup, and pineapple cake as the dessert."], ["hot and sour soup", 1296932996, "@JPPlunkett @StevenRiley7 @McDonalds In MA I dont think you are ever 10 minutes away from a hot and sour soup"], ["hot and sour soup", 23211489, "@LRGiles Order hot and sour soup, or wonton in a fix. Airborne vitamin C gummies and a blanket right out of the dryer. Feel better."], ["hot and sour soup", 903113050198179840, "\"I'm going to get really high tonight and eat a quart of hot and sour soup\""], ["hot and sour soup", 16043254, "@LRGiles I love Throat Coat tea for sore or scratchy throats. My ‘sick soup’ is either hot and sour soup or a nice spicy red lentil. Sending healing thoughts and wishes for a speedy recovery 💕💕💕"], ["hot and sour soup", 120486026, "@LRGiles Hot and sour soup if you're stuffed up. It only clears you up for a few minutes, but those minutes make you feel like you just might make it. I like that throat coat tea for coughs. It tastes awful, which is what convinces me that it might be helping."], ["hot and sour soup", 3299990072, "@ImFatPod I went to my local chinese place yesterday and got pork fried rice and hot and sour soup and poured a couple spoon fulls of the soup on the pork fried rice like it was a soy sauce substitute.  Tasted phenomenal."], ["hot and sour soup", 175579201, "My favourite man cold remedy is hot and sour soup from our small town Japanese/Chinese/Thai restaurant \n\nEven if the cold doesn’t leave the soup is delicious https://t.co/PkgHoL5mn8"], ["hot and sour soup", 1121400248553938952, "Hot and Sour soup...😋😋😋 https://t.co/bPU2u9tvre"], ["hot and sour soup", 19134698, "wound up working 12h yesterday to play catch up (it’s a 10h shift).\nsat in my car disassociating for at least 30 mins. \ngot take out from the chinese place next door (hot &amp; sour soup and white rice). \nhome. ate. \nexhausted, i took a benadryl for good measure to make sure i slept."], ["hot and sour soup", 3772554628, "i need an edndless supply of hot and sour soup"], ["hot and sour soup", 3833711835, "@duckbozard Stay hydrated man, that helps me.  Also I believe Chamomile tea and Hot and Sour soup have medicinal properties.  Hope you’re better soon."], ["hot and sour soup", 1185610617740300289, "My Dad cooked a big dinner for me, which have a salad with eggplant and lamb as a starter, Roasted shirmp with eggplant and barbeque sauce as the main dish, Hot&amp;Sour soup, and pineapple pudding as the dessert."], ["hot and sour soup", 1142786064039366656, "RT @foodandwine: Warm up with a bowl of hot and sour soup: https://t.co/GGffPQgxPe"], ["hot and sour soup", 2696243754, "Hot and Sour Soup https://t.co/2cIlvpXXZQ (via @gimmesomeoven)"], ["hot and sour soup", 157742566, "Joint and hot n sour soup. Yeeet"], ["hot and sour soup", 4145206391, "@MaxHayon My local chinese food place does this hot and sour soup with prawns and this tweet has me craving it"], ["hot and sour soup", 1569661424, "Me: this hot and sour soup is so thick it could be a sauce. \n\nAlso me: this is so damn delicious I want all of it in my face hole right now."], ["hot and sour soup", 472241910, "Hot and sour soup is highly underrated"], ["hot and sour soup", 776433357810900996, "RT @maggiehollis: @EvanAKilgore Hot and Sour Soup from your local Chinese place. Or homemade with lots of garlic and mushrooms."], ["hot and sour soup", 1215462174224723970, "RT @maggiehollis: @EvanAKilgore Hot and Sour Soup from your local Chinese place. Or homemade with lots of garlic and mushrooms."], ["hot and sour soup", 786362856757268480, "Hot and Sour Soup: Add 1/3 squirts of honey, 1/3 squirts of olive oil &amp; 4 oz of pretzels to a bread pan. Bake at 400° for 45 sec and enjoy!"], ["hot and sour soup", 155403565, "@EvanAKilgore Hot and Sour Soup from your local Chinese place. Or homemade with lots of garlic and mushrooms."], ["hot and sour soup", 907296218379964416, "@EvanAKilgore Hot and Sour soup."], ["hot and sour soup", 821201541923151872, "[cw: food]\n\nive gotten really good at making hot and sour soup and it's great bc that's also one of my favorite foods ever"], ["hot and sour soup", 263922624, "hot and sour soup really be hittin different"], ["hot and sour soup", 15926176, "Our conference is held right on the edge of Chinatown and I always enjoy grabbing an authentic Chinese meal here. Tonight, because I’m on a diet I had a bowl of hot &amp; sour soup and a bowl of egg drop soup. #narucwinter https://t.co/TEA7ZkDS2i"], ["hot and sour soup", 991491375140044800, "RT @FuzzyWuzzyTO: @MikkiLexaHFX What about hot-and-sour soup?"], ["hot and sour soup", 45281719, "Bear: I used to hate hot and sour soup and now I like it.. and I say that every time I eat it \nMe: it's good to repent for your evil ways"], ["hot and sour soup", 741310593458655232, "Homemade Hot and Sour Soup better than your local Chinese takeout spot!. #eggs #cooking https://t.co/36ahojyzSC https://t.co/EnQ34aL9Y4"], ["hot and sour soup", 62780180, "@essel1 Chinese i can manage hot &amp; sour soup, fried rice and chicken Manchurian.\nThai i like Chicken lollipop. Rest is not for me"]]