[["hot turmeric milk", 856367842404466689, "friends their is only one method to prevention from corna virus by seeing many symptomsof this virus from many scientist i will give you one method to tackle this disease please take hot milk with half tea spoon of turmeric and drink it .this will help you fight with this  virus."], ["hot turmeric milk", 65565748, "My Fuddhist Food For Medicine Go-To! The heavenly turmeric ‘Golden Milk’ hot drink. Turmeric, black pepper, cardamom, and coconut milk. (Head to https://t.co/zNvgaKtOqH for the recipe!)⁣⁣ ⁣⁣\n\nFood is medicine. Good food=Good mood. ☺️🙏⁣⁣⁣⁣⁣ \n\n#TheFuddhist #EatToLive https://t.co/SjDOlHRA0a"], ["hot turmeric milk", 90908329, "@PeterSweden7 LOL! He will diie of indigestion! What could be consumed is a tumbler of hot/lukewarm milk with a pinch of turmeric and sugar/jaggery!"], ["hot turmeric milk", 2943014941, "Congestion due to cold virus can be cleared temporarily by drinking a cup of hot cow's milk mixed with 1/4th teaspoon of turmeric powder 1/4th teaspoon of freshly ground black pepper. Do that every night for 3 - 4 days, a week, the cold must clear out. All 3 are anti-virus agents"], ["hot turmeric milk", 977439626569728001, "@MlYEONCE For sore throat try some turmeric milk with pepper and gorgle with salt water hot and don't swallow it works all the time"], ["hot turmeric milk", 12919082, "@HeatherWeaverDC I know it's become A Thing in recent years, but turmeric milk - ideally made with a non-dairy milk, sipped as hot as you can handle - reeeally soothes my throat when I have a nasty cough."], ["hot turmeric milk", 362542651, "@pinakasena Once cooked grind the soaked items with 2tbsp coconut, as to the cooked vendekkai with 1tsp turmeric powder. Bring to boil. Make 1 tall glass of butter milk with sour curd. As the buttermilk and wait till mixture is hot. Switch off. Garnish with mustard &amp; Curry leaves fried"], ["hot turmeric milk", 288919084, "@famous9_vlogs How to rid Corona Virus. Daily morning &amp;  night before going to bed drink hot milk adding turmeric powder &amp;  pepper powder also drink hot Nilavembu Kashayam adding little jaggery. Always keep drinking hot water. Wash ur hand with hot water."], ["hot turmeric milk", 288919084, "@WHO How to prevent from Corona Virus. Daily morning and night before going to bed drink hot milk adding turmeric powder and pepper powder also drink hot Nilavembu Kashayam adding little jaggery. Always keep drinking hot water. This will cure Corona Virus."], ["hot turmeric milk", 288919084, "@ShakthisreeG How to prevent from Corona Virus. Daily morning and night before going to bed drink hot milk adding turmeric powder and pepper powder also drink hot Nilavembu Kashayam adding little jaggery. Always keep drinking hot water. Wash ur hand with hot water."], ["hot turmeric milk", 288919084, "@TimesNow How to prevent from Corona Virus. Daily morning &amp; night before going to bed drink hot milk adding turmeric powder and pepper powder also drink hot Nilavembu Kashayam adding little jaggery. Always keep drinking hot water. Wash ur hand with hot water."], ["hot turmeric milk", 288919084, "@republic How to prevent from Corona Virus. Daily morning &amp; night before going to bed drink hot milk adding turmeric powder and pepper powder also drink hot Nilavembu Kashayam adding little jaggery. Always keep drinking hot water. Wash ur hand with hot water."], ["hot turmeric milk", 288919084, "How to prevent from Corona Virus. Daily morning and night before going to bed drink hot milk adding turmeric powder and pepper powder also drink hot Nilavembu Kashayam adding little jaggery. Always keep drinking hot water. Wash ur hand with hot water."], ["hot turmeric milk", 1125532293643362311, "RT @WowFare: Who's waiting for our #DrinkOfTheMonth rubric?\nWe would like to draw your attention to the Indian hot milk beverage-#HaldiDood…"], ["hot turmeric milk", 1004724546098925568, "Who's waiting for our #DrinkOfTheMonth rubric?\nWe would like to draw your attention to the Indian hot milk beverage-#HaldiDoodh. Perfect for the cold winter and loved by the entire family thanks to the combination of heated milk, and turmeric.\nCredits: https://t.co/gaa4ODgtqN https://t.co/P9By9XoV63"], ["hot turmeric milk", 223465885, "@iAsura_ Have hot Turmeric milk"], ["hot turmeric milk", 582700957, "@MadMart05 Oh ama la. Forgot that. If you can,Hot Milk + Turmeric powder + ground Pepper. Gives instant relief for sometime."], ["hot turmeric milk", 776006353013739521, "@_SQUAD93 Lol I just love to share this.. \ndrink hot milk mixed with turmeric powder!! Do it twice a day and you’ll feel the relief faster \n\nI get cold too many times and it helps me all the time"], ["hot turmeric milk", 1144447193220173827, "Spreading fumes of frankincense &amp; burning dried neem tree leaves will control the growth of virus in air ; Eating plenty of Parched Bengal gram of india will strengthen lungs;hot cow milk with turmeric, pepper control throat infection, rinse with potassium permanganate water."]]