[["hot chocolate", 955574642311421954, "Alice just pulled hot chocolate chip muffins out of the oven!  Come on over and enjoy! https://t.co/HwySTvthRL https://t.co/7vf9uMtq0g"], ["hot chocolate", 1202731756115218432, "@MrGee54 Hot chocolate RT @MrGee54: Yall goin on soda dates this weekend?"], ["hot chocolate", 1090143450329214977, "Im thankful for that hot chocolate!"], ["hot chocolate", 948669698, "Thank you @ShocklachSchool - your song was just beautiful, and the hot chocolate, scones and jammy dodgers were fab too😜👍 @MusicalRoutes @cate_madden @Singletonstring @EdsentialUK #madeforlove https://t.co/SAgggbaxm5"], ["hot chocolate", 16145224, "Get those roses out of the vase and into a mug. Well, not literally, but you get it.\nhttps://t.co/s66Zm3zsMj"], ["hot chocolate", 2436493231, "@19710419_ ah...... i don't think i'll be trying hot chocolate any time soon tbh...."], ["hot chocolate", 107987275, "RT @DoughnutPlantNY: Cure for the cloudy Monday blues? A Chocolate Rose Heart doughnut and one of our delicious hot coffees! Click the link…"], ["hot chocolate", 896863814599057408, "@EatonKrone @JulieKusma @CornerWriting @TTBanks5 @Ltward2 @zoeallisonauth1 @TaiGrice @WriteEthan @SerenaNorwick @MQuigley1963 @CoopLori @mark1952ind @Anthony_OBrien_ @Raymond_Norman @ShenaeChase @joanne_paulson @ReadingIsOurPas @FDS_NaturallyMe @storysmithscb @RivRains @Author_Devika @NielsKeira @JDGreysonwrites @Tiff_researches @RozLevens @TheMUW @w_overloaded @newenglanddaisy @d_ast777 @chipmunkofpower @byDawnRene @kathryninman9 @_TaraHolley @annikakparker @MichelleFaithLu @anarchy0029 @TJPayne3333 @jjkctjbm @SeleneTitan @mnkeethewriter @CarolynRuffles @HLNida2 @DavidMiddleham @TySparks8 @michelekwas @LilyBOW2 @BambiSommers1 @TRILLIUMnovel @DellOlioMario @dlmarinackII Churros go nicely with hot chocolate! I'm in!"], ["hot chocolate", 2451830558, "Happy Peppermint Patty Day. Here's an early attempt with chocolate that was too hot and patties that were too thin. Ha!\n#chocolatier #chocolatelovers #peppermintpattyday https://t.co/w7v69CAlcu"], ["hot chocolate", 1226359875422191616, "@pariza3436 Hi hot chocolate babe reply me dm"], ["hot chocolate", 42869300, "@Crucialjun Hot damn! Your keyboard is playing tricks 😜. Buy me lots and lots of chocolate though."], ["hot chocolate", 745197487, "RT @CityKitchener: Join us for Bike to Work Day on Feb. 14 where we'll do a 2 km bike ride on the new Belmont Ave separated bike lanes! Fre…"], ["hot chocolate", 31638398, "Love is in the air… and it smells like hot chocolate! Celebrate the season of ❤️ with 2-for-1 Hot Chocolates and Mochas (medium or supremo) until Valentine’s Day using your #FriendsofBlenz coupon. Missed the email? We're sending another coupon tomorrow, so sign up today! https://t.co/0aU0odTgKs"], ["hot chocolate", 1101819091, "@Seasons_bowness has whipped up a Unicorn Hot Chocolate 🦄. A magical white hot chocolate topped with whip , sprinkles and edible glitter. They also have a spirited version if you wish. #YYCHotChocolateFest https://t.co/G7FAMWFAHe"], ["hot chocolate", 714097749252149251, "When you colleague brings you homemade Mexican hot chocolate. Yummy. Thank you coach Myerly @Cen10Cheer_Song @cen10cheer https://t.co/pBjJOfgJZf"], ["hot chocolate", 84117383, "RT @CBAadvising: Stop by the CBA Advising Office for some hot chocolate and a cookie! https://t.co/jzGL7w6Vtx"], ["hot chocolate", 408847276, "Help us spread the love on our wall 💕📝 in exchange for FREE @StarbucksCanada Hot Chocolate. We are waiting for you in the Student Centre! #ValentinesDay"], ["hot chocolate", 1081030181320642560, "RT @estafaga: Not a good day. On @AvantiWestCoast train running 45 minutes late, hot &amp; stuffy (giving me a migraine) but the worst bit is I…"], ["hot chocolate", 76466457, "The 2020 season starts Saturday at Rafferty Stadium! Free hot chocolate for the first 100 fans!\n\n🗓️ Saturday, Feb. 15\n🏟 Conway Field at Rafferty Stadium\n⏰ 1 PM\n🎟 https://t.co/4Myb84xSR0\n\n#WeAreStags #CAALax 🤘🥍 https://t.co/VFi1sOPzB5"], ["hot chocolate", 787936237088825344, "It’s the 845th Daily Growler of Ever!\n\n@outerbeltbeer Double Dippin' Growlers are only $18 all day!\n\nDouble Dippin is huge on chocolate and vanilla sweetness with bright green peppermint flavors. Imperial stout brewed with mint, hot cocoa, and vanilla https://t.co/CQbp9TJwat"], ["hot chocolate", 887695356120662018, "@ChrisEvans HEY.....That's MY (Stolen) Sled......BAD DOG!\n\nDoes anyone have any HOT Chocolate Dog Biscuits?"], ["hot chocolate", 444939913, "We’ll be giving our free hot chocolate and other goodies again this year! ❄️🍁\n#LongJohnTruro #Stanfields https://t.co/h3lVqaty1Y"], ["hot chocolate", 1307473399, "Not a good day. On @AvantiWestCoast train running 45 minutes late, hot &amp; stuffy (giving me a migraine) but the worst bit is I picked up what I thought was a Belgian chocolate flapjack in the station but is actually nut &amp; seed flapjack. #disappointed 😢"], ["hot chocolate", 1158419681419640832, "I know I’m extremely tired because I’m drinking coffee but it’s still me because I mixed it w hot chocolate"], ["hot chocolate", 1556419716, "RT @onlineryn: did anyone else used to watch that show once upon a time?? i cant stop thinking about how that woman gave up her kid for ado…"], ["hot chocolate", 273469743, "Just made some hot chocolate ☺️"], ["hot chocolate", 1104471135897468929, "RT @oifelixs: this is going on the list of unique skz foods along with boiled egg &amp; hot chocolate and haribo &amp; rice https://t.co/oEhEi3UiVZ"], ["hot chocolate", 923753387291742208, "Tim Horton's hot chocolate is shit https://t.co/KZd4gXHOIg"], ["hot chocolate", 2363123756, "There's still time to send a quick care package to your son or daughter at college.  We recommend adding some hot cocoa mix, bag of chocolate candy and a silly pair of socks. https://t.co/OHBosL8eEo"], ["hot chocolate", 1071539795359346694, "@BriAnneHolthaus I thought it was coffee or hot chocolate 😂😂😂"], ["hot chocolate", 983614288584761344, "@woodcowbooks @JulieKusma @CornerWriting @TTBanks5 @Ltward2 @zoeallisonauth1 @TaiGrice @WriteEthan @SerenaNorwick @MQuigley1963 @CoopLori @mark1952ind @Anthony_OBrien_ @Raymond_Norman @ShenaeChase @joanne_paulson @ReadingIsOurPas @FDS_NaturallyMe @storysmithscb @RivRains @Author_Devika @NielsKeira @JDGreysonwrites @Tiff_researches @RozLevens @TheMUW @w_overloaded @newenglanddaisy @d_ast777 @chipmunkofpower @byDawnRene @kathryninman9 @_TaraHolley @annikakparker @MichelleFaithLu @anarchy0029 @TJPayne3333 @jjkctjbm @SeleneTitan @mnkeethewriter @CarolynRuffles @HLNida2 @DavidMiddleham @TySparks8 @michelekwas @LilyBOW2 @BambiSommers1 @TRILLIUMnovel @DellOlioMario @dlmarinackII And here I thought it was going to be a relaxing Tuesday, just chill'n and enjoying a nice, hot chocolate bath, but noooo... https://t.co/8YBgZU72jr"], ["hot chocolate", 809903934005334016, "@SissGugu Yhuuuuuuuuuuu! This explains why my hot chocolate landed on my chest yesterday while I was wearing my favorite white t-shirt 😢😢"], ["hot chocolate", 546457921, "Come out and support tomorrow‼️ Instead of Hot Chocolate we will be having Lemonade😋  @VSU_NAACP https://t.co/e7Yqmjbdy9"], ["hot chocolate", 265021126, "@CGRindycar @Ericsson_Marcus @HuskiChocolate @COTA Marcus \"Hot Chocolate\" Ericsson. @marshallpruett - Can we make a chocolate pun a thing?"], ["hot chocolate", 1123615621793456128, "RT @mochajwoo: NCT seeing Jungwoo walking out of my room with blankets and kisses on his forehead and a warm mug of hot chocolate in his ha…"], ["hot chocolate", 795592176700968960, "we all know hot chocolate milk but what about hot strawberry milk or hot banana milk?"], ["hot chocolate", 58216216, "RT @aeleo92: Ruby cocoa hot chocolate is actually amazing https://t.co/KRRHR5bAbS"], ["hot chocolate", 122115475, "Join us for Bike to Work Day on Feb. 14 where we'll do a 2 km bike ride on the new Belmont Ave separated bike lanes! Free coffee, hot chocolate &amp; donuts will await for you at the end of the ride at Filsinger Trail.\n\nLearn more: https://t.co/SEV4dDqpQu \n\n#BikeKitchener #CycleWR https://t.co/fPo36sIWCR"], ["hot chocolate", 795592176700968960, "when im home im gonna draw sad varian, cry and drink some hot chocolate :D"], ["hot chocolate", 233141875, "RT @AizoozQ8: This weather needs a nice THICC hot chocolate and a true crime documentary playing with lights off."], ["hot chocolate", 410940778, "@whotfdis2 I was just there for the hot chocolate 😂"], ["hot chocolate", 2282571488, "@iantm_books I respect this. Shortbread is delicious. I also enjoy them with a hot cup of tea, but I like what your'e doing with chocolate and Nutella. Yum!"], ["hot chocolate", 1029786831783489536, "yes, i took two pics of my hot chocolate with latte art, what about it? https://t.co/7y5aJ6rai3"], ["hot chocolate", 417342926, "The guy serving me in pret just let me have hot chocolate for free what a DOLL"], ["hot chocolate", 443178315, "@_Qilaaaa How did she even get his number? Lmao she knew he always ordered the special with hot chocolate. Aye Alicia was trying to get her man 😂"], ["hot chocolate", 4903878773, "RT @zionjustice22: COME OUT THIS TUESDAY IN THE STUDENT UNION!!! My Miss and I will be serving Hot Chocolate to warm you up on these upcomi…"], ["hot chocolate", 123527571, "This indulgent sharing dessert is pure chocolate heaven… and it’s available at The Hare &amp; Hounds Hotel this weekend only! (Thurs, Fri &amp; Sat)… ❤️\n\nCrisp chocolate sphere filled with a raspberry &amp; white chocolate sable, and served with a hot salted caramel sauce! https://t.co/xqpRba7eeI"], ["hot chocolate", 356420097, "RT @JohnTorbit: Snowsports2020 The sun is certainly shining here in Andalo although some still have time to stop for a hot chocolate @Green…"], ["hot chocolate", 1217394698995871749, "Woke up feeling a bit low. As the day went on I could feel depression taking hold so I: \n-ate good food \n-took my meds\n-got up, dressed, tidied my room \n-ordered my ADHD meds \n-did some household errands/communal tasks \n-had a hot chocolate, classic calming drink"], ["hot chocolate", 772293736919203844, "Trying to figure out what i'm going to post on Friday.\nConcept art (similar to the hot chocolate but different food item) Or Pixel art? (Likely Pokemon fanart)"], ["hot chocolate", 709095705881792512, "*does love hot chocolate when it’s also made with milk, gives it extra flavoring ^,,^*"], ["hot chocolate", 180549186, "RT @ExploreCanada: Hot chocolate views don’t get much better than this! #ExploreCanada⁠\n⁠\nPlease note: campfires are permitted at designated campsites and campfire rings are provided at this location at Crooked Lake, BC.\n📍: @HelloBC ⁠\n⁠ https://t.co/oR8EBLdkZK"], ["hot chocolate", 589033689, "RT @onlineryn: did anyone else used to watch that show once upon a time?? i cant stop thinking about how that woman gave up her kid for ado…"], ["hot chocolate", 19257934, "Such a lovely time today at @paul_a_young ‘s Soho store trying his Aztec Hot Chocolate &amp; innovative truffles, including pizza &amp; popcorn! Paul you are actually a chocolate genius and your staff are true gems that really guided us and looked after us! Delicious 👌🏼 \n\n#pressinvite https://t.co/8JS46X7q9j"], ["hot chocolate", 599071954, "I FOUND OUT TSUKISHIMA'S BIRTHDAY FALLS AROUND EARLY FALL!!!!!!! GREAT WEATHER TO CUDDLE, DRINK HOT CHOCOLATE BY THE FIRE AND DANCE AND FALL IN LOVE AAAAAAAAAAAAAAAAA"], ["hot chocolate", 1105340803784822784, "height            : 6'2\"\nage                 : 15\nshoe size       : 13\nzodiac            : Leo \ntattoos           : 0\npiercings       : 0\nfav drink        : chocolate milk \nfav snack       : hot Cheetos\nfav animal      : dogs https://t.co/TmE4vM8Qys"], ["hot chocolate", 186185783, "spending my lunch break with hot chocolate and a romance and i am tempted to stay here for like five hours https://t.co/RKrCB5NWNt"], ["hot chocolate", 1153893216858472448, "hi ten i’m going to b in hollywood at a cafe at 12 can u meet me there i’ll buy u tea or hot chocolate whatever u want"], ["hot chocolate", 1155910548279767045, "@Mia_Woodhouse_ Yes but with instant coffee not a coffee machine 😂 and without the hot chocolate too. Mate it’s banging"], ["hot chocolate", 1178025254557556736, "RT @oifelixs: this is going on the list of unique skz foods along with boiled egg &amp; hot chocolate and haribo &amp; rice https://t.co/oEhEi3UiVZ"], ["hot chocolate", 935997908947820544, "my lil local cafe changed their hot chocolate and now its so tasty i 🥺✨"], ["hot chocolate", 14295585, "Coffee, hot chocolate, scones, and donut holes - the UGA Master of Accountancy Student Association hosted a fantastic Coffee Hour this morning to give students a boost before the Advanced Exam this week! https://t.co/xqAdu3Otyv"], ["hot chocolate", 883761, "Just a few days left to enjoy some of the 70 flavours of the Vancouver Hot Chocolate Festival https://t.co/pNILmukoW0"], ["hot chocolate", 14619600, "RT @practicalkitch: Orange cardamom ice cream with a hot fudge swirl? Don’t mind if ya do! \n\nGet thee recipe here: https://t.co/gfqwU9ENo8…"], ["hot chocolate", 18094660, "@IncognitoPengy What, no hot chocolate?"], ["hot chocolate", 857405735998824448, "@honeybear_pao my fave is “FROZEN HOT CHOCOLATE”"], ["hot chocolate", 254439052, "What French food are you eating today in honor of the feast of #OurLadyOfLourdes? We are having hot sandwiches on French bread and chocolate eclairs. #CatholicTwitter"], ["hot chocolate", 857405735998824448, "@honeybear_pao DUDE YES “can i have aN ICED HOT CHOCOLATE”"], ["hot chocolate", 3459861019, "Valentine's Day is coming. Are you ready? \nCome check out our chocolate offerings - scroll through to look at their nutritional labels if it you'd like.\n\nTry a #yychotchocolatefest hot chocolate while you're here and… https://t.co/SGC9ZlJgdi"], ["hot chocolate", 1077227084890759168, "@Alishawqii Don’t forget to build a snowman and ski and drink hot chocolate"], ["hot chocolate", 233281495, "Anyone wanna go ice skating and hold hands? With some hot chocolate afterwards :3"], ["hot chocolate", 1683770802, "Best museum hot chocolate EVAH! https://t.co/bTt7NnPx8I"], ["hot chocolate", 532129475, "RT @hanansolih1: @NaaSolih UPDATE I got 85/- rf hot chocolate @PalatoFrostys  SO VERY WORTH IT i wont even complain 🤩 https://t.co/tEdoK0AY…"], ["hot chocolate", 1144805754609774592, "I would really like a nap.  But since that's not happening, I would really like some hot chocolate.  Or some dry socks."], ["hot chocolate", 1197848190181158914, "Why hasn’t my hot chocolate been payed for ? $end it now piggies\n\nhttps://t.co/05y3YZhGNM https://t.co/DLcWvyktft https://t.co/vGR5Q0agcI"], ["hot chocolate", 1737669212, "RT @onlineryn: did anyone else used to watch that show once upon a time?? i cant stop thinking about how that woman gave up her kid for ado…"], ["hot chocolate", 1948443516, "This s’mores hot chocolate is so good"], ["hot chocolate", 786174412047298560, "RT @TickfordPark: (Walk Part 2) We spotted some Red Kites, Buzzards &amp; discussed the flooding caused by Storm Ciara in the area! We even pla…"], ["hot chocolate", 1097204310449012737, "@egoprint The way I ALWAYS cry with tommrrow it's just such a sexy sad song? I feel like stripping and also putting on a blanket and sipping hot chocolate"], ["hot chocolate", 867409332756824064, "Tim Horton’s hot chocolate will forever be the best"], ["hot chocolate", 555072597, "Really need to sleep \n\n(00.28pm)\nMy tummy: klutuk klutuk\n\nMy brain: shit i have to meet my lecturer this morning\n\nAlso my brain: triple cheeseburger, big mac, indomie, hot chocolate, toast, fried fries, gudeg\n\nMy eyes: you can do it! Get some food!"], ["hot chocolate", 1508101988, "RT @MrsSims7: 2nd graders are rockin’ their Oil Resist Hot Chocolate Mugs! @RiverRidgeElem https://t.co/vhs2iZpFSR"], ["hot chocolate", 30061490, "When you ask your gora housemate if she wants some hot chocolate and she tells you to make chai instead 😯🎉🎉"], ["hot chocolate", 1003898407365300225, "RT @rebeccamudd: Now available to order via our Facebook page 💝 #Easter #gifts #shopsmall #handmade #etsyshop #SmallBiz #giftideas #chocola…"], ["hot chocolate", 946707128, "Some1 Venmo me $2 I need hot chocolate"], ["hot chocolate", 2979805851, "RT @Khloodshooo: What’s this? Chocolate milk? A hot coco? Some coffee? Nope it’s me cleaning my beauty blender!!! https://t.co/V4OQPk9ovG"], ["hot chocolate", 1154403015396192260, "RT @oifelixs: this is going on the list of unique skz foods along with boiled egg &amp; hot chocolate and haribo &amp; rice https://t.co/oEhEi3UiVZ"], ["hot chocolate", 387462652, "Looking for a way to spice things up with your sweetie? Try some of our el Diablo Hot Chocolate-rich chocolate with cayenne pepper, and cinnamon! (Glasses not included 😘) #spicethingsup\n#hotchocolate \n#eldiablo \n#cinnamon \n#cayennepepper \n#valentinesday\n#icecream\n#jamaicaplain https://t.co/d3m6IlfTQ0"], ["hot chocolate", 3038986286, "If you ever bring my a hot drink that is not either Hot Chocolate or Hot Coco I’m going to assume that you hate my guts."], ["hot chocolate", 1218231985774256129, "#cocoaglutton When you bring four packets of hot chocolate into work and you've drank three of them in just four hours. Meanwhile I'm still yawning; I blame the job not the chocolate."], ["hot chocolate", 388535690, "This weather needs a nice THICC hot chocolate and a true crime documentary playing with lights off."], ["hot chocolate", 354265688, "@CadburyUK is it me or is it the perfect time for a hot chocolate also should I make one for the kids there staring at me strangely 😂 https://t.co/o66LJo3kCa"], ["hot chocolate", 695007245516546048, "RT @LinnPrimary: P5 had a special hot chocolate treat today after working so hard even with the snow falling outside their mobile. #snowday…"], ["hot chocolate", 45649577, "@MsBehavior @ShawarmaKhanWPG @OldSpaghFactory YES! Very excited to buy you a Banana Split Hot chocolate from @CookiesByGeorge tomorrow morning! \n\n🍌🍨🔥🍫"], ["hot chocolate", 2393431476, "kinda wanna live in a marshmallow and a slowly melt in hot chocolate \n\nˢʷᵉᵉᵗ ʳᵉˡᵉᵃˢᵉ ᶠʳᵒᵐ ˢʷᵉᵉᵗ ᶜᵒᶜᵒᵃ"], ["hot chocolate", 1161746839902785537, "-ˋˏ ✎ i went to a gay cafe today ( again ) and they do such a nice dark hot chocolate i’d sell my soul for it"], ["hot chocolate", 27919037, "I love hot chocolate #hotchocolate #love #hearts #valentinesday #photofoxedit #inkdropk @ City of Salford https://t.co/j7jDLvL1dP"], ["hot chocolate", 417974018, "Just had some super good hot chocolate https://t.co/ovINCzm5zX"], ["hot chocolate", 2842886783, "RT @SunnyDoveStudio: I Love You More Than Chocolate Ice Cream. Even on a Hot Summer Day: Cute Elephant Greeting Card http://t.co/UM61SSSP9W…"], ["hot chocolate", 297915423, "GCSE music clinic after school - hot chocolate at half time. Who said revision was boring? Big shout out to this dedicated bunch of Y11 students. https://t.co/guBuMwdAaV"]]