[["hummus wraps", 24676894, "Beetroot Hummus &amp; Spinach  Wraps &amp; Potato Crisps. Similar dishes in #Vegan #Organic #Cookbook 'Vegans Can't Eat Anything!'\nhttps://t.co/ZIW2arpNm7 https://t.co/rDi8ipOF7z"], ["hummus wraps", 896149954963668992, "uhhhhhhh... can i get three fuckin egg with hummus  wraps no mayo"], ["hummus wraps", 1047874162520461314, "@CatrionaSwanson @MorganM1807 While travelling I have been buying bagged salads and throwing them in wraps. E.g. Grated carrot, beetroot, radishes, corn, with hummus, dressing or sour cream, etc. Throw in a few herbs, onions, garlic and you have a fair flavour combos you can play with."], ["hummus wraps", 55062973, "This beet hummus is delicious on salads, lettuce wraps, or as a dip for plain veggies. BUT,  Kelsey loves it so much warmed up that she unofficially named it “Beet Faux-tatoes”. Either way, you have to try it! https://t.co/GbS8GKaCFq"], ["hummus wraps", 719496409570021376, "Brekkie: porridge, oat milk, flax &amp; maple syrup. Lunch: vegan sausage rolls, onion rings &amp; @sainsburys vegan potato salad. Dinner: stirfry sweet &amp; sour tofu, broccoli, red pepper &amp; hummus wraps. Snacks: coconut water #whatveganseat"], ["hummus wraps", 745978858013396992, "RT @cheftibornagy: On today's chef theatre: wrap shack wraps prepared by @ChefFernando84: the Greek: hummus, halloumi + beetroot / The Lon-…"], ["hummus wraps", 3002807360, "Book grp at my place last night, discussing Bruny by @Rose_HMD. We theme the food to the location of the book so we had King Is cheeses, savoury choc hummus, Tassie salmon wraps and lumberjack cake (lots of logging &amp; apples in Tas) washed down with 2 bottles of Tassie white wine https://t.co/nxtLOTDIHq"], ["hummus wraps", 28516517, "RT @cheftibornagy: On today's chef theatre: wrap shack wraps prepared by @ChefFernando84: the Greek: hummus, halloumi + beetroot / The Lon-…"], ["hummus wraps", 2256664812, "RT @tinnedtoms: Bored with your lunches? Make a batch of this delicious and colourful carrot #hummus and add it to sandwiches, wraps and sa…"], ["hummus wraps", 250087842, "Bored with your lunches? Make a batch of this delicious and colourful carrot #hummus and add it to sandwiches, wraps and salads or just serve it will crunchy veg. It will brighten up your day.  https://t.co/Hi9AAw2wc1 #vegan #vegetarian #recipe #lunch https://t.co/Hi9UhSUThr"], ["hummus wraps", 251701439, "RT @cheftibornagy: On today's chef theatre: wrap shack wraps prepared by @ChefFernando84: the Greek: hummus, halloumi + beetroot / The Lon-…"], ["hummus wraps", 889877329547329538, "@k8canrelate Apples and peanut butter, hummus &amp; veggie wraps, vegan nachos, veggie stir fry are my go-to’s ☺️"], ["hummus wraps", 748972922300170240, "i’m drunk i’m high so let’s eat three hummus wraps and feel guilty about it tomorrow !"], ["hummus wraps", 626022993, "RT @cheftibornagy: On today's chef theatre: wrap shack wraps prepared by @ChefFernando84: the Greek: hummus, halloumi + beetroot / The Lon-…"], ["hummus wraps", 1315473216, "On today's chef theatre: wrap shack wraps prepared by @ChefFernando84: the Greek: hummus, halloumi + beetroot / The Lon-döner: döner meat &amp; mint yoghurt &amp; döner salad / The Ber-leaner: low fat potato salad + chicken schnitzel + garlic mushrooms 👌😀👌 https://t.co/dJVS55iory"], ["hummus wraps", 1020228372583124992, "Hummus wraps shawarma😋😋❤😁 https://t.co/nREIiSzDO0"], ["hummus wraps", 937348857561837569, "Veggie hummus wraps are where it’s at"], ["hummus wraps", 1181468063541157889, "Falafel wraps but homemade falafels, wraps, hummus and pickled jalapeños 🤤 #sovegan https://t.co/AY4J5LupFb"], ["hummus wraps", 872177438519963650, "@contentbythesea @FullyThoughtOut Oh my gosh, you're a greyhound mamma too! My boy Buster is currently laying with his nose pressed against my chair leg... And big yes to falafel and hummus wraps."], ["hummus wraps", 3040783367, "I wanna make hummus wraps...but I cannot decide what random raw veggies to put inside. 🥴"], ["hummus wraps", 884929655605575680, "Home economics https://t.co/KGvuqt6Sap Practical 2 - Ham wraps Ingredients: 1 wrap per person Lettuce Cheese Tomato Grated carrot ¼ onions 1t oil Sauces – tomato, bbq, mayo, hummus, chilli 2 piece of cooked ham Method: Sauté the onions together ... https://t.co/E5v6K1c7KL"], ["hummus wraps", 868043759442948096, "DRIED BEANS ~February’s Harvest of the Month~ are a staple in our school meals. These plant based, protein-packed legumes are super tasty in chili’s, wraps, hummus, salads, soups &amp; as a veggie side dish. Delicious &amp;… https://t.co/i7ZqOGzLgd"], ["hummus wraps", 38744902, "@SUBWAY is trying, getting better. They're spinach wraps with just vegetables was pretty good. But to really be in ballgame today they need non dairy, non meat proteins, like beans, hummus etc. #subway #eatingout #FastFood"], ["hummus wraps", 2321367673, "#GlutenFree Amaranth Wraps Recipe | These  wraps are the perfect vehicle for piles of Mexican fajita toppings, slathering with hummus &amp; your favourite Mediterranean veggies or scooping up the last of that delicious curry from the bowl! \n\nhttps://t.co/OC8bfyTZAJ @TammyLynnMcNabb https://t.co/IGHyFCUpGU"], ["hummus wraps", 3415059471, "made two hummus veggie wraps, drank my coffee, ate hella polish waffle wafers all in the past hour n im ready 2 go to work https://t.co/0Znr9GOxTq"], ["hummus wraps", 47740807, "@huwlemmey You can also get chip wraps in Beirut. (They can add hummus or in my case the non-traditional garlic sauce to it too which makes it super-delish)"], ["hummus wraps", 719511505205600256, "@marneleigh Lunch meat on top of bagged salad.  Leftovers from last nights dinner.  Lettuce wraps with tuna and carrots and/or cucumbers. Turkey sandwiches (with pitas) with hummus and veggies."], ["hummus wraps", 47858132, "If y’all haven’t tried Hummus bowls and wraps in boca park you’re missing the fuk out"], ["hummus wraps", 115069753, "@Hananobira I chop em &amp; roast them in oil/chilli/garlic. Then eat them in wraps, with hummus, in nachos, by themselves etc etc"], ["hummus wraps", 4104617637, "@JenuinePanic We made some really good wraps the other night. Spiced chick peas stir friend with onions wrapped with avocado, hummus, cucumber, cabbage slaw and some sweet potato. Not a dish per day, but having a bunch of thing and making wraps was delicious."], ["hummus wraps", 928350589, "@LadyAelfgifu Plain tortilla wraps. Cashew nuts, hummus, sliced cheese.. 😇 Making up for the literally THOUSANDS of bags of crisps I had as a kid."], ["hummus wraps", 1068521213440405505, "On Saturday's we L U N CH 🌯😍\n\n​A lunch hour at Kai is a lunch hour well spent, come try our new lunch wraps this afternoon! Choose from lamb, chicken and falafel, all served with fries and hummus... 🤤 https://t.co/JcQQN7Ur2y"], ["hummus wraps", 1190512493564706818, "RT @sunflowerkt_: Raw Vegan Wraps with chickpea salad, tomatoes, hummus, mushrooms 🌯 https://t.co/9q3iHnLVnh"], ["hummus wraps", 17408858, "@seantcronin @supjackjack We eat a lot of roasted or grilled veggies, soups, curries, lentils, rice a million ways, Mediterranean foods, and for easy nights wraps with fresh veggies, greens, hummus. \nI also make caramelized onions and roasted garlic several times a week for the base of my recipes."], ["hummus wraps", 1101028642518417408, "Sent him to work with some hummus wraps, alkaline water, and bunches and bunches of kisses"], ["hummus wraps", 816703282316005376, "@ms_sun_shines One of my new favorites is BBQ chickpea wraps with a hummus sauce."], ["hummus wraps", 524655066, "Turns out eating toasted ham, cheese, hummus and guacamole wraps at 8pm = wife moving to a different bedroom at 1am."], ["hummus wraps", 14059304, "Undressed for storage. Now eating some with salt, balsamic vinegar, garlic flakes, black pepper and olive oil. To be used on wraps with hummus or smashed avocados or scrambled eggs"], ["hummus wraps", 1195522892978626560, "@JAYVERSACE Hummus wraps 🤤"], ["hummus wraps", 969643001273348096, "RT @domsotgiu: The Best Soup 🍜 &amp; Sandwich 🥪 In Stockport- Naturally! Eat in / take away amazing nourishing  soups, mackerel wraps , home ma…"], ["hummus wraps", 366790336, "The Best Soup 🍜 &amp; Sandwich 🥪 In Stockport- Naturally! Eat in / take away amazing nourishing  soups, mackerel wraps , home made beef burger 🍔, Italian meatballs, Halloumi &amp; hummus wraps , Italiano pasta 🍝, proper toasties with award 🥇 winning cheese 🧀 veggie sausage, &amp; more https://t.co/bCx2zorJtl"], ["hummus wraps", 3438595593, "RT @TheArtHouseCafe: Trialling some #vegan wraps today! \n\nSweet potato, aubergine, pepper &amp; hummus\nVegan ‘feta’, tomato &amp; black olive \nVega…"], ["hummus wraps", 839681846225035265, "@Lost_CapriSun Strawberry jame bacon burgers, Hummus grape burritos wraps, chicken apple chili. They all exist"], ["hummus wraps", 847769135106752512, "yknow this kinda inspired me to try making tofu wraps at home\n\nor maybe a chickpea wrap w hummus\n\nhmmm https://t.co/xEoQu78qcS"], ["hummus wraps", 986631513033904129, "Another fabulous week in cookery club...we made delicious hummus and salad wraps! @PhunkyEStaffs https://t.co/Raec4hMYOZ"]]