[["indian tandoori chicken", 1213329455227129856, "RT @DarbarNY: Tuesday Dinner Deal of Midtown East Manhattan!\nEnjoy the Healthy, Tasty and Satisfying Chicken Tandoori Kebab at Darbar Resta…"], ["indian tandoori chicken", 2201905166, "Indian Grills Cooking Session on Friday 14th Feb @ 11am.                          Tandoori Chicken.               Murg Malai Tikka.              Spicy Grilled Fish.               Mustard Prawns.                Shish… https://t.co/5ehAnML4mN"], ["indian tandoori chicken", 2902462663, "Whether you want to have a delicious tandoori chicken or simple samosa, you will see that Grain of Salt is one of the finest #Indian #food #restaurants Waterloo to visit.\nFor best restaurants, please visit\n✔ https://t.co/6nNpefL8qR\n☎ 519-653-1600 https://t.co/BaSAyKg0YN"], ["indian tandoori chicken", 1125532293643362311, "RT @Sourav0206: Traditional Indian Tandoori Chicken On Black Stock Photo  https://t.co/2CLadXOHDh https://t.co/6twgYQJ727"], ["indian tandoori chicken", 239287214, "Traditional Indian Tandoori Chicken On Black Stock Photo  https://t.co/2CLadXOHDh https://t.co/6twgYQJ727"], ["indian tandoori chicken", 215957924, "These Grilled Tandoori #ChickenWings are marinaded with smoky Indian spices and cooked until perfectly juicy inside! https://t.co/SQrHQLho93 #recipe #recipes #livinglavidaeats https://t.co/OlIhSeIXki"], ["indian tandoori chicken", 225276553, "The finest seasonal and traditional ingredients are brought to life with heady spices and culinary techniques associated with Indian cooking...🍲\n*\n*\nStart your meal with this delicious Chicken Tandoori at Peacock… https://t.co/txMlB5RI5E"], ["indian tandoori chicken", 260239664, "Tuesday Dinner Deal of Midtown East Manhattan!\nEnjoy the Healthy, Tasty and Satisfying Chicken Tandoori Kebab at Darbar Restaurant.\nDelicious Indian Cuisine and an Affordable Dining Experience.\nJoin us!\n#diningout #ChickenTandoori #upscalerestaurant #IndianRestaurant #IndianFood https://t.co/Mm6WHALjNr"], ["indian tandoori chicken", 70351382, "I am craving Tandoori Chicken from Eastern Food Bazaar... my body is not even fully functional with this Indian cuisine craving. \n\nMoment I land in Cape Town ndiya straight khona"], ["indian tandoori chicken", 418950909, "gave it to ME! *i accepted it : a FREE half chicken Tandoori and salat, with chips and..the Tandoori was 'Indian style.' IT BEATS M=E, THO..HOW SOMEBODY COULD ORDER AND PAY FOR SOMETHING AND NOT BE THERE COLLECT IT!! ? YOU?"], ["indian tandoori chicken", 1216969342992015360, "Haveli The Fanily Dhaba | Mumbra\n\nTandoori Chicken is an Indian dish..For more info visit...https://t.co/gSMj2chMbL https://t.co/9BXiixNgWX"], ["indian tandoori chicken", 816061848, "@sayitnspinit @elguapo64 Starts ordering Indian food and is dismayed when she receives Tandoori chicken instead of buffalo meat and maze."], ["indian tandoori chicken", 426115007, "I'm craving Indian food, more specifically Chicken Tikka Masala, Biryani, Lamb Korma, and Tandoori Chicken"], ["indian tandoori chicken", 1185226724604284933, "Say hello to our signature Thali. A complete meal as served on Indian Trains. It's the Chef's Daily selection of Tandoori Starter, Chicken and Mutton Curries, Daal and Vegetable of the Day with Rice and Naan. \n\n#Northfields #WestLondon #Ealing  #hammersmith #london https://t.co/fa0o9j5Xgs"], ["indian tandoori chicken", 14778803, "Butter chicken pizza tonight! Made the makhani sauce from scratch and picked up some pre-marinated tandoori chicken from an Indian Butcher down the street. https://t.co/NwA3lmfFUj"], ["indian tandoori chicken", 1093865143, "@TwinSunsAmanda @_EricPfeifer Oooo what Indian dish are you having? I absolutely love a chicken tandoori."], ["indian tandoori chicken", 15569293, "Lastly, I absolutely LOVE fusion!!! And this hidden gem from a local Indian pizzeria is amazing! A tandoori chicken &amp; tikka masala pizza! 🤯🤤🍕😍💘\n#NationalPizzaDay #NationalPizzaDay2020 #Phoenix #pizza #food #foodie #fusionfood #shotoniphone https://t.co/tJs0GW1xbn"], ["indian tandoori chicken", 1470666026, "@Boxing802 The flavouring that you marinade the chicken in to give it lots of flavour (like tandoori chicken that you get at the Indian) yogurt spices etc"], ["indian tandoori chicken", 779766458, "RT @virsanghvi: Rude Food:The magic of tandoori cooking where every bite should taste of fire &amp; smoke is being destroyed by talentless chef…"], ["indian tandoori chicken", 82732298, "Dinner tonight.  At an Indian curry store.  #Chicken_curry, #Nan, #Tandoori_chicken.  delicious.  (Illustration is an image) https://t.co/gUFnZb5nJZ"], ["indian tandoori chicken", 40797399, "“Favorite Indian Restaurant\" We love this place. Amazing food, excellent service and KD the owner is extremely friendly. We ordered the chicken tikka masala, garlic naan bread, tandoori chicken, and saffron rice. Highly recommend!!! Bay Leaf Indian Kitchen 😋 https://t.co/HyRROhycZe"], ["indian tandoori chicken", 48855645, "\"The tandoori naan is a chewy, yeasty number that has a complex funk and pillowy texture. Pair it with everything from goat curry to butter chicken.\" - Eater L.A. on Bhanu's Indian Cuisine in San Gabriel\n\nhttps://t.co/hJ99E94fVR https://t.co/QLnWrWDqVQ"], ["indian tandoori chicken", 391163033, "@thehandbehindt1 @IonaItalia @BridgetPhetasy Indian food is mostly vegetarian, unless you’re talking strictly Northern and eating nothing but Tandoori chicken."], ["indian tandoori chicken", 166541520, "RT @Marie_Louise_O: Indian “tapas” tonight 🤩🥰 Chicken and coriander samosas, chicken tandoori skewers, pork curry with ginger and turmeric,…"], ["indian tandoori chicken", 885056796, "Indian “tapas” tonight 🤩🥰 Chicken and coriander samosas, chicken tandoori skewers, pork curry with ginger and turmeric, garlic and coriander naans, poppadoms, mint raita and mango chutney ⭐️ @greenkeeper1 #homemade https://t.co/F4ZH9DKL1V"], ["indian tandoori chicken", 17141835, "Cats can have little a Rice Fusion Indian Tandoori Chicken Masala Flavour Pringle, as a treat https://t.co/kKh4aWosFq"], ["indian tandoori chicken", 1067194364546482176, "Stunning succulent pieces of chicken cooked in the clay oven. Marinated in Tandoori marinade &amp; delivered to your dinner plate sizzling. Book Shalimar tonight for your special occasion. \n#Shalimar #Tandoori #Sizzler #Waterooville #Indian #Curry #Portsmouth #Beer #Interior https://t.co/EYKp6eSgco"], ["indian tandoori chicken", 1008800386193469441, "@sumiandnoir @ebruenig North Indian: tandoori items -- baked in a clay oven (smoked flavor). Tandoori chicken, chicken (or paneer if veg) tikka masala are standards for a reason.\nInfo/Chinese: Gobi (cauliflower) Manchurian\nChaat (street food): Pani puri (ask the server to show you), pav bhaaji"], ["indian tandoori chicken", 22480310, "Tandoori Chicken Folded Naan with Onion &amp; Coriander, Raita, Pakora and all your favourite Indian accompaniments on the Burger Counter at Otters BOC today! @tobymaryan @elioruk @fionammacmillan https://t.co/yS4HBqivNa"], ["indian tandoori chicken", 4394797685, "There's a restaurant in my city called \"Shawarma Queenz\". They call themselves a middle eastern restaurant but yet the two owners are Sikh Indian and Pakistani. They even put \"tandoori chicken shawarma\" on the menu😂\n\nStop selling Arab food if ur not Arab 2020 https://t.co/ZcGcFG9Ux3"], ["indian tandoori chicken", 95164644, "has 1 recent sale on https://t.co/1UCCNFWiRE https://t.co/3WUfyoJvWb"], ["indian tandoori chicken", 215957924, "These Grilled Tandoori #ChickenWings are marinaded with smoky Indian spices and cooked until perfectly juicy inside! https://t.co/SQrHQLho93 #recipe #recipes #livinglavidaeats https://t.co/I5LvSxJFq1"], ["indian tandoori chicken", 16398460, "@dumanoir I'm not sure, but legit both the butter chicken and the tandoori was among the best I've had (and I eat a lot of Indian food)."], ["indian tandoori chicken", 260239664, "Tuesday Dinner Deal of Midtown East Manhattan!\nEnjoy the Healthy, Tasty and Satisfying Chicken Tandoori Kebab at Darbar Restaurant.\nDelicious Indian Cuisine and an Affordable Dining Experience.\nJoin us!\n#diningout #ChickenTandoori #upscalerestaurant #IndianRestaurant #IndianFood https://t.co/zi5E3E7w1n"], ["indian tandoori chicken", 15039436, "@confessions_cup @hmgivingsoul @linds4fins @FionaMorgan79 @Cbp8Cindy @TheAngelOrsini @suziday123 @ja2cook @Jay_Rombach @jillianne_gray @joneill55 @jflorez @PoloOrtiz9 @cazij @BiscottiNicole @melanie_korach @coachadam34 @chernorris @30days30ways @SteveHammActor @BethFratesMD @CattMcCreary @RoadtripC @magee333 @StressFreeKids @phof_author @Adventuringgal @ThrseMartine Oh yum! We love great #Indian and #Thai food! Love Chicken Tandoori. What did you have Cath @confessions_cup ? #foodies https://t.co/jIree7hqAC"], ["indian tandoori chicken", 2990362485, "An easy recipe for Indian Pulled Tandoori Chicken made in the Instant Pot pressure cooker. This low carb and keto friendly curry uses boneless skinless chicken thighs, coconut milk, and authentic spices to create a comforting and healthy dinner that's full of flavor. Wondering… https://t.co/h9a7r08OsW"]]