[["kachori", 780701216305098752, "Tag a friend who should treat you with Raj Kachori? In comment section below\n.\n#Bikanervala #IndianCuisine #IndianFood #Delicious #Tasty #Yummy #Tempting #Snacks #Dinner #Foodie #FoodLover #FoodIsLife #FoodIsForever #FoodOfTheDay https://t.co/ni5UJgKVgl"], ["kachori", 2356221739, "@News18India @PrashantChurhe Freebies gonna ruin our country."], ["kachori", 2356221739, "RT @sruthisagar: #SCSTAct \nThe decision to cancel SC/ST reservations was taken on 5.9.2012 by the Congress. Today, its MPs in Parliament ar…"], ["kachori", 2356221739, "@Saumyakul @SwatiJaiHind One more nautanki by Swati. Shame on you Saumya for being her cheer leader. It's non political matter."], ["kachori", 1089934989091717120, "You can't miss Kachori if visit kota 😋😋 https://t.co/1CY67yYXr6"], ["kachori", 2356221739, "RT @RealHistoriPix: 2015 Delhi: Church attack\n2015 Bihar: SC/ST reservation\n2017 Punjab: Udta Punjab\n2017 UP: Gujarati Gadhe\n2018 K'taka: L…"], ["kachori", 287044162, "@sushantsareen @ARanganathan72 No oil Dosa is actually doable, tastes good enough. \nA bhatura needs to be deep fried though.\nOur poori, Kachori, Samosa, Paratha, Kofta etc, also many desserts are at risk. \nImagine a steamed Gulab Jamun, steamed maalpua, steamed Jalebi..."], ["kachori", 3891305832, "@rockyandmayur Bedai (crisp Pooris with dal and other fillings, somewhere between a poori and kachori) and Aloo sabji... Found in my Restaurant ' Sitaphal' in HSR, Bangalore 😁"], ["kachori", 1200021895342645249, "@rockyandmayur My favorites:\n\n1. Bhel puri at Odeon cinema, Delhi. He's been there for 50 yrs+. Father and son now work together.\n\n2. Bun maska chai lucknow, hazratganj Sharma Ji\n\n3. Nirala tamatar chaat in chowk, Allahabad\n\n4. Aloo sabzi+kachori hanuman mandir Delhi"], ["kachori", 103240417, "@rockyandmayur Try sindh snacks in Aligarh , they have the best kachori, Samosa and Bread pakora"], ["kachori", 763665236603834368, "@rockyandmayur Indore's street food is the best in the world. I can name dozen of food items right from Hot Dog, Pattice, Kachori, Dahi Bada, Dal Baati, Poha, Jalebi, Shikanji, Bhuttey Ka Kees, Garadu, Sabudane Ki Kichdi....You can easily find all of these items at 56 Dukaan and Sarafa."], ["kachori", 6132702, "@rockyandmayur Apart from loads at purani dilli, it’s amritsari kulcha @ King kulcha, opposite to Hyatt New Delhi!! And Daulat kee chaat and natraj bhale and raj kachori at Nathu’s and Bhogal ke bhature and... fu rocky and Mayur I have to reduce my weight!!! U guys r real bad!!"], ["kachori", 2356221739, "@VishakhaJ18 Go for Hebbars Kitchen and VegreceipesofIndia. Epitome of perfection."], ["kachori", 271528821, "@arunbothra I am ajmeri and I never asked for extra kadhi in plate of kachori.\n#kadikachori"], ["kachori", 66137535, "RT @smrutirsingh: The next time Trump has to call Corporate Meeting of Top #CEOs in #USA, he will have to order #Samosa, #Kachori, #Chai &amp;…"], ["kachori", 528952100, "The next time Trump has to call Corporate Meeting of Top #CEOs in #USA, he will have to order #Samosa, #Kachori, #Chai &amp; #Jalebi. #India https://t.co/Tu2h6NhvvY"], ["kachori", 118935121, "@Joydas Go to a town you wld find an speciality. Meerut Kachori Sabzi, Jalebi, Samosa Chole. Kota Rajasthani kachori, pyaj ki Kachori many variations . We are the best in eating tasty food may be low in nutrients."], ["kachori", 58872649, "RT @jorisminne: Indian breakfast! What are you waiting for? Sensational poha, spiced and smoky rice flakes, lentil kachori and chilli pakor…"], ["kachori", 26233912, "@GordonRamsay \nWhat do you think about this?Surati home cooked meal by my wife for Award winning Chef’s. •Undhiyu, Sanang ni Dal,Mustard Dahi Vada,Banana Cucumber Raita,Green Chana,Osaaman,Leelva Kachori,Biranj,2layers Roti &amp; Vedmi (Sweet Lentil Roti.) I’m sure you’ll like it. https://t.co/HyY5BQ9SGz"], ["kachori", 302346908, "RT @StudioZana: Methi ki Chutney | Fenugreek Leaves Sauce\n\nRecipe Link https://t.co/sofprHcmF9\n\n#MethiKiChutney is a traditional #chutney p…"], ["kachori", 455742161, "@arunbothra I am from Bikaner but don't like Kachori, samosa."], ["kachori", 1935608088, "RT @jorisminne: Indian breakfast! What are you waiting for? Sensational poha, spiced and smoky rice flakes, lentil kachori and chilli pakor…"], ["kachori", 2474228426, "\"SNACK TWEET\" \"ALOO KACHORI\"  \"FOR ALL WHO ARE POTATO LOVERS\"; HERE IS A \"SNACK TWEET\" FOR YOU.!!!!!!!"], ["kachori", 2474228426, "Aloo Kachori Recipe | Aloo Puri | Easy Potato Snacks Recipe | Evening Sn... https://t.co/eMfnWJFpxW via @YouTube"], ["kachori", 2356221739, "@iambhakt108 @MukulAgarwal66 Very true. And in this middle class are most treacherous."], ["kachori", 113425963, "Shame.., One million pound per year couldn’t stop this Gujju from stealing a sandwich!!. I have seen Video where 2 #Gujarati ladies stealing kachori in a marriage function, interestingly they are guest at wedding. https://t.co/2KQLVwhCcp"], ["kachori", 2356221739, "@riyay389 @kunalkamra88 @thetanmay I don't. Some one replied whom I follow."], ["kachori", 2356221739, "RT @smittal_ips: Honb'le @pbhushan1 Sir, request you to provide evidence of your statement so that lawful action can be taken. However, If…"], ["kachori", 36317352, "@TeamGSquare Sir did you try the lassi and mava kachori at Mishrilal?"], ["kachori", 52548575, "RT @jorisminne: Indian breakfast! What are you waiting for? Sensational poha, spiced and smoky rice flakes, lentil kachori and chilli pakor…"], ["kachori", 3104761410, "@nidhi_agwl I too had kachori yesterday. Stomach is still burning. 😥"], ["kachori", 2356221739, "RT @Tejasvi_Surya: I studied the same Marxist history that even you studied in school. \n\nThe only difference is I didn’t stop there. I stud…"], ["kachori", 21301882, "Indian breakfast! What are you waiting for? Sensational poha, spiced and smoky rice flakes, lentil kachori and chilli pakora. With a glass of salted lime soda. £9.95. Sensational https://t.co/UrA1e0ZzNT"], ["kachori", 13608142, "@priyankac19 Every city has its charm when it comes to #streetfood. #Jaipur has Pyaz ki Kachori, Mirchi Vada, Jodhpur has Mava Kachori, Agra has superb Aloo Tikki and Gol Gappe, Aligarh has superb Samosa and Sohan Halwa, Lucknow has kebabs Gujarat has jalebi fafda and keep adding"], ["kachori", 1185226724604284933, "Spreading love the Patri way ❤️ we have a special menu available next week only. Enjoy a Raj Kachori + Signature Thali to share with 1 glass of prosecco each for just £ 19.95 per person. All offers must be booked via https://t.co/WZNPCJP2Pt\n\n#Northfields #Ealing #hammersmith https://t.co/B7QPUqzdvQ"], ["kachori", 1021267974995554305, "@priyankac19 Delhi: Hold my Raj Kachori"], ["kachori", 1056236192356659200, "@piyushg16 @MrrMukherjee Bet u didn’t try the street food , gupchup, rolls , jhal muri , kachori , samosa , kesar tea ... the endless list"], ["kachori", 1026838965616173057, "RT @kairawurld: This Kachori Eating Scene Was So Heart Touching😭😭\n\nI MISS YOU NAIRA....\nHAR ROZ..EVERYDAY 😭😭\n\n#KartikGoenka After Their 2 Y…"], ["kachori", 178653579, "@PandeyEsha I hope bajpayee kachori has been had... Vegetarian equivalent of holy grails"], ["kachori", 1103223414, "@priyankac19 @Joydas @rohini_sgh Mumbai street food is more on fusion style, whilst Bikaner ki Kachori and Jodhpuri Mirchi Bada all time hit 😁"], ["kachori", 211422199, "@hvgoenka And Have chole bhature, pyaz kachori"], ["kachori", 2356221739, "RT @Chandrapida1: Look at pillar, weight of each( there are 2) is 200 ton and 40 feet high, got erected in Mandsaur in 530 CE by Yashodharm…"], ["kachori", 2356221739, "@IamEmaan578 @fawadchaudhry Gaandu can you tell us how he is defeated?\nHe is a PM and he will be PM. It's just regular state elections in India."], ["kachori", 786624032665919488, "@kachori_samosa @ResearchPhysics Bang on"], ["kachori", 2356221739, "@mesunainah @ResearchPhysics Since my childhood I had same question in my mind. Don't know y but I never called him Mahatma , simply Gandhi. His PR machinery was good at that time and secondly he made sycophant Nehru as PM who kept him alive. Symbiotic relation of Nehru n Gandhi made them larger than life."], ["kachori", 925044749483917312, "Morning breakfast#Aloo sabji with kachori.....👌👌 https://t.co/ZeCqqNybE0"], ["kachori", 867959803963817984, "Amazing food and an equally tasty view watermark.goa 💯🥂❤️\n.\n.\nHere are the most recommended dishes/drinks:\n1. Spicy Watermelon Salad\n2. Picaso Cocktail \n3. Honey Chilli Kachori\n4. Raw Banana Chips\n5. Keema… https://t.co/VEO6TC5EtR"], ["kachori", 2515457186, "@SwiggyCares stinking dahi kachori delivered by SURBHI SWEET BORIVALI customer care useless"], ["kachori", 706876074, "@prakash5444 @golgappa456 Can I follow  kachori Aloowara with green chatni please @sanjaynitharwa5 @singh_harmeet84 @Abhi_Balasara"], ["kachori", 988858957, "@RURALINDIA Nope. I had them yesterday. After an arduous  campaign and endless kachori-sabjis at the party office I can't tell you how soul filling that was"], ["kachori", 46064532, "RT @StudioZana: Methi ki Chutney | Fenugreek Leaves Sauce\n\nRecipe Link https://t.co/sofprHcmF9\n\n#MethiKiChutney is a traditional #chutney p…"], ["kachori", 2356221739, "@RatanSharda55 @madhukishwar @BJP4India Finally we are descendants of Jaichand. Can't do anything. Freebies gonna ruin democracy."], ["kachori", 1223552529964814336, "RT @AafrinMansuri5: Samosa ya kachori ?\n\nComment down using our tagline!!\n\nLet's start #InspirationAsim"], ["kachori", 26434313, "#Nastradamus 500yrs back has predicted that India will lead the world in future. By watching this picture, am sure what he meant. \n\nBTW, no more pizzas or doughnuts in corporate meetings rather it's Samosa Kachori time in global corporate meetings. \nAm a proud Indian 🤗 https://t.co/C1n25nvdVy"], ["kachori", 1078876887831769091, "@IamRajii Rice or Roti, Dosa or Poori, Kachori or Vadā, they all are refined Carbohydrate junk dangerous for health👈 be on LCHF diet LIVE 100 healthy years👍🙏😊"]]