[["kadhi", 33154333, "@cogaz I don’t get how such a large company lets that happen with payment processing. They’re wack! #StripesOverChecks"], ["kadhi", 25214349, "@Kid_Kadhi OK I WASNT THE ONLY ONE. Huge glitch today. Went back on the app rn and said there was sizes available. 🤦🏽‍♂️"], ["kadhi", 33154333, "@cogaz Stupid ass Nike wasn’t even letting me submit the payment"], ["kadhi", 887333704485531649, "The Constitutional Management of Religious Diversity in Kenya- 2008;\nWorking Document for the CKRC on the Kadhi's Courts,Chief Kadhi and kadhi's, August 2002;\nNEP &amp;Constitutional Review Process - Lessons from History ; and many More publications \nat https://t.co/PgNNwyU5Zi"], ["kadhi", 122958277, "Good riddance to bad rubbish! When Undesirable Number 1 gets married without paying The Chief Kadhi for his services 😂😂😂"], ["kadhi", 161377021, "Baby Girl's Dress - Size 1T - 100% Cotton Indian Kadhi - Gathered Skirt - 1950s Style - Navy Blue - Ready to Ship https://t.co/qDLLgr3Bzz via @Etsy"], ["kadhi", 1199713158996250624, "@mdashraff @ShefVaidya I am not interested in religion.. that's for fools..\nhow to make 70cr people non indian.? People who born before 1987 don't need any proof.1956 law.. \nCAA is only for other country minority refugees not for minority illegally entered..\n\nNews channel chodke kadhi to padho be.."], ["kadhi", 47304035, "@spoiledyetbossy Here you go, lady..😊\n\nhttps://t.co/5840HuxOXP"], ["kadhi", 3293575002, "Let’s help Chief Kadhi break the virginity myth\n\n***\nLatest News Updates"], ["kadhi", 716690402636656641, "RT @dailynation: ONEYA: Let’s help Chief Kadhi break the virginity myth https://t.co/wCY4CcGww8"], ["kadhi", 1115918074379685893, "RT @dailynation: ONEYA: Let’s help Chief Kadhi break the virginity myth https://t.co/wCY4CcGww8"], ["kadhi", 25979455, "ONEYA: Let’s help Chief Kadhi break the virginity myth https://t.co/wCY4CcGww8"], ["kadhi", 321923420, "@helloanand Waah Sir! Next time try Kadhi which typically goes well with fafda!"], ["kadhi", 1110812728824946688, "@imAkshay98 @the_andh_bhakth @blsanthosh What do you I tell  you.\nDon't you understand what keju said ?\nAgar uska AAP se zara bhi link ho to usko kadhi se kadhi saza do"], ["kadhi", 742325690087833600, "Let’s help Chief Kadhi break the virginity myth\n https://t.co/9hSDmij5Cs"], ["kadhi", 17674377, "@mallapur123 @DeepeshLakhera Yes. Yum. Though I do miss the kadhi they give in Ahmedabad"], ["kadhi", 875763398012743681, "Let’s help Chief Kadhi break the virginity myth - https://t.co/FcEXqjLKwB https://t.co/coKCFKsMDS"], ["kadhi", 4202526155, "Let’s help Chief Kadhi break the virginity myth - https://t.co/3Br3jDfA8L https://t.co/5jML0hnF8U"], ["kadhi", 110437251, "@Spicyndtangy Heyy sanjoli! \n\nWhen you put this yaar😋😋😋\n\nGujrati kadhi😋😋😋\n\nI myself have made this❤"], ["kadhi", 23934518, "@dee2 @sister_ratched I am trying to find time to make an Indian kadhi type dish with them today."], ["kadhi", 787380177827467264, "What is your ideal proportion of Kadhi and Rice?\nDo you like\na. More kadhi than rice?\nb. More rice than kadhi?\nc. Equal amounts of both?\n\n#Food #Brarsfoodculture #hungry #Tasty #Foodporn #Brampton #Foodgasm #Foodie #Vegetarian #Toronto #Desi #GTA https://t.co/MkelsZFSWr"], ["kadhi", 17710740, "From the bottle-gourd infused Kashmir variation to the mor kuzhambu of the South, here's six best variations of kadhi that suits everyone from 8-80\n\nhttps://t.co/tvZyVeMTyB"], ["kadhi", 161377021, "Baby Girl's Dress - Size 1T - 100% Cotton Indian Kadhi - Gathered Skirt - 1950s Style - Navy Blue - Ready to Ship https://t.co/cMrbvtmKOZ via @Etsy"], ["kadhi", 117183986, "@gurichopra Im a kannadiga and i dislike south Indian food. Yes all of them except Rasam. I love Rajma chawal, kadhi, parathas, palak paneer and chole bhature. 😀"], ["kadhi", 27664633, "@sialmirzagoraya Ya 🤔 I'm trying my hand at vegan food 😀 daily morning tea also now not having with milk but with soy milk. Trying to get rid of milk products. Continuing to have eggs, fish, etc though. \nKadhi tasted not at all different from the usual 1. Besan taste was just as good 😊"], ["kadhi", 1175237540, "RT @Dextrocardiac1: Went to Premvati today the Swaminarayan restaurant, I can never get enough of the masala khichdi and kadhi they serve.…"], ["kadhi", 129428948, "RT @Dextrocardiac1: Went to Premvati today the Swaminarayan restaurant, I can never get enough of the masala khichdi and kadhi they serve.…"], ["kadhi", 2253724069, "RT @Dextrocardiac1: Went to Premvati today the Swaminarayan restaurant, I can never get enough of the masala khichdi and kadhi they serve.…"], ["kadhi", 1166733875021635585, "Went to Premvati today the Swaminarayan restaurant, I can never get enough of the masala khichdi and kadhi they serve. Its pure love ♥️"], ["kadhi", 2896432620, "Only teens waste money on roses 🌹 and stuff...\n\nI cleaned the kitchen sink before leaving for office today. \n\nAnd I’m getting kadhi-pakora and rice for dinner. \n\n#MatureDating \n\nJustKidding! I’ll get roses 🌹 🥀 too on the way home. Otherwise won’t see no action. Only dinner 😂"], ["kadhi", 1159016706691362817, "@patil2323_ @Anurag_RC @abhica_92 Hahaha.. atta aathawala.. i was following you..\nBut to be honest, i unfollow some marathi handles if it tweets some non veg joke or something that i don’t find very flattering..\nTumhi mula kadhi kadhi kahi tari ***** bolata tevha mi tyanna tatpurata unfollow karate..\n😬"], ["kadhi", 1044459214540693504, "@bhav2406 I am Gujarati and I like mithi Daal, Kadhi &amp; many more regular food items. But I like non mithi daal &amp; non sweet food too. There is nothing to feel ashamed or hide about cultural taste &amp; choice. I feel proud that we have our own unique Gujarati taste."], ["kadhi", 1673006288, "@bhav2406 I'm a sindhi and I don't like papad or sindhi kadhi."], ["kadhi", 1166733875021635585, "@RajeshBPatel14 @Lohana1983 I like kadhi 😋"], ["kadhi", 926659472012976128, "@Dextrocardiac1 @Lohana1983 I'm a Gujarati and I love meethi daal &amp; kadhi prepared  by my better half! https://t.co/2nH5nwast3"], ["kadhi", 780753234751135744, "RT @LouSteinbeck: 🇰🇪 PROGRESS!\nVirgin query for women in Muslim marriage certificate to be scrapped, following increased complaints.\nChief…"], ["kadhi", 909549584, "@Your_Levodopa Okay, coz they don't know about these. \nThey only know misal, kadhi, vada pav n puran poi"], ["kadhi", 1071511821587279874, "@PuneCityPolice @puneruralpolice Nagar road ani wagholi daily accident hota astat Burecasy kadi road che kam purna karnar kadhi Dumper walenvr karvay honar ka? Corrupt Burecusy and politians are responsible for the deaths in which people have not broken law shame on humanity. https://t.co/t7ScUn372C"], ["kadhi", 3559995804, "cold coffee recipe  - cold coffee milkshake recipe: https://t.co/uanBUNcSls\n #Coffee #Milkshake #Cappuccino #IceCream #Caffeine #Mango #WhippedCream #Chocolate #ChocolateSyrup #MasalaChai #Tea #InstantCoffee #Vanilla #Milk #Fruit #Custard #Oreo #Lassi #Kadhi https://t.co/Bvel4AgWY2"], ["kadhi", 124895357, "Kadhi for a snowy night! #nofilter #ThursdayNightFix https://t.co/COZwVWyF9y"], ["kadhi", 925004142724096000, "@subodhbhave Movie and cast announcement kadhi?"], ["kadhi", 941635228832952320, "@invinciblewife @authorAneesh @DivyaSoti Kadhi should be Kashi."], ["kadhi", 40951855, "@Kid_Kadhi what are your thoughts about Sumlin?"], ["kadhi", 33154333, "@BleacherReport If Gannis had Booker instead of a couple names, he’d take the cake but Brons team is better"], ["kadhi", 33154333, "@JAMBOY75 @ajlask @SunDevilHoops Should we schedule the date now?"], ["kadhi", 40951855, "@Kid_Kadhi @ajlask @SunDevilHoops Nope. I’ll let you on if UA gives us another early exit from the tournament!!!"], ["kadhi", 33154333, "@JAMBOY75 @ajlask @SunDevilHoops Haha let me on the podcast whenever"], ["kadhi", 40951855, "@ajlask @Kid_Kadhi @SunDevilHoops Uuuuummm!!! Let’s talk about that Alex!! Hhhhhhmmm!!!"], ["kadhi", 377647419, "@Kid_Kadhi @JAMBOY75 @SunDevilHoops Poor kids an Arsenal fan too, I'm sorry for your loss mate."], ["kadhi", 40951855, "@Kid_Kadhi @SunDevilHoops Instead of trying to rebrand. Win something and ppl will know who you are."], ["kadhi", 33154333, "@JAMBOY75 @SunDevilHoops It’s UArizona, I know it’s hard to spell for you guys"], ["kadhi", 40951855, "@Kid_Kadhi @SunDevilHoops Don’t mind him. He’s just bitter cause he’s a UOfA fan or UA whatever they want to call themselves."], ["kadhi", 33154333, "@JAMBOY75 @SunDevilHoops I think they’re in the dumpster behind the place where the guy with corona virus lives"], ["kadhi", 787380177827467264, "Snowstorms like these call for a hot plate of Kadhi rice. \nHit like if you agree!\n\n#Food #Brarsfoodculture #hungry #Tasty #Foodporn #Brampton #Foodgasm #Foodie #Vegetarian #Toronto #Desi #GTA https://t.co/few7qOE7fR"], ["kadhi", 33154333, "@JAMBOY75 @ItsTheMook They free my man book I’m going right back"], ["kadhi", 40951855, "@ItsTheMook @Kid_Kadhi Mook he should stayed with the nuggets."], ["kadhi", 33154333, "@ItsTheMook And I told you at the mall. We Suns gang now haha"], ["kadhi", 33154333, "@ItsTheMook So you’re saying the nuggets don’t have better players than Wiggins?"], ["kadhi", 161377021, "Baby Girl's Dress - Size 1T - 100% Cotton Indian Kadhi - Gathered Skirt - 1950s Style - Navy Blue - Ready to Ship https://t.co/Pjlta0cpD0 via @Etsy"], ["kadhi", 33154333, "You know what bugs me the most about the DLO trade, we have better players than fucking Wiggins to give up and STILL keep everyone happy"], ["kadhi", 1217992777155264514, "@Devilsmummy Tej patta is cursed. But kadhi patta for some people. https://t.co/2DDvHgovPw"], ["kadhi", 1006010794155347969, "@KartoTweet Not of kadhi patta. We throw out tej patta."], ["kadhi", 922515176015912960, "@Kid_Kadhi @SunsAfterDark Def sketch. Kinda reminds me of college ranks plucking HS coaches to their staff and signing their top players."], ["kadhi", 33154333, "@SunsAfterDark @DJDeeRawb And until he signs that contract he is free to talk to whoever he wants"], ["kadhi", 2956785798, "@DrPritamMunde Nagar Beed Parli Railway route kadhi honar ?"], ["kadhi", 1178334206360870912, "RT @sharma_jyo: @amburravi Ok you bring !100 kg chawal ghee and shakkar .. I will prepare kadhi pakoda .. deal final 😂😂"], ["kadhi", 1171756815672938496, "@amburravi Ok you bring !100 kg chawal ghee and shakkar .. I will prepare kadhi pakoda .. deal final 😂😂"], ["kadhi", 1171756815672938496, "RT @amburravi: @sharma_jyo Only if you you give me that delicious kadhi pakora! I can give 100 kg of chawal for that 10 gms of kadhi made b…"], ["kadhi", 1178334206360870912, "@sharma_jyo Only if you you give me that delicious kadhi pakora! I can give 100 kg of chawal for that 10 gms of kadhi made by you."], ["kadhi", 1178334206360870912, "RT @sharma_jyo: आओ दोस्तों कढ़ी चावल का लुत्फ उठायें।\n For #Dinner tonight #Rice fried in pure Ghee #Plain Rice #Kadhi #Dal #gajar ki subzi…"], ["kadhi", 1171756815672938496, "आओ दोस्तों कढ़ी चावल का लुत्फ उठायें।\n For #Dinner tonight #Rice fried in pure Ghee #Plain Rice #Kadhi #Dal #gajar ki subzi in #southindian style  #garlic dip #Sweet in the #centre is Motipak 😋😋\nJoin us for Dinner… https://t.co/7HOmROW5eu"], ["kadhi", 25668696, "RT @jokebazz: Don't know how much time of my life I have wasted in removing Kadhi patta from my food."], ["kadhi", 1440410665, "RT @jokebazz: Don't know how much time of my life I have wasted in removing Kadhi patta from my food."], ["kadhi", 33154333, "@realDonaldTrump just in case you missed it https://t.co/z9dIvkOnDl"], ["kadhi", 33154333, "@AZ_Charlene It’s crazy he thinks he is gonna live that long. I give him 5 years max Health reasons."], ["kadhi", 1194672022934020096, "I'm such a prude vegan, I get \"fucked up\" on Gobhi Sabzi &amp; Bengan Bharta in mess at 7:30 in evening. Yeah, pour some more khichadi and kadhi, Aunty. Inject that shit in my veins. No wonder I ain't protesting. Too fragile for that biryani. Gotta build tolerance, Inquilab zindabad."], ["kadhi", 573453794, "@halimaali15 @GlobalNomad_ There's no Iddah for a Virgin and a Kadhi MUST verify a woman's past marriage contracts before officiating a new one."], ["kadhi", 1029961337496064000, "Imagine sitting before a Kadhi,two men witnesses or whatever gender, your husband to be and you are questioned about your virginity on paper? Please don’t get me started https://t.co/QSeb1XRx6T"], ["kadhi", 50989447, "If Jameela Jamil can come out as queer, so can I.  And my south Asian family is even queerer--at this very moment many are making dhokla and kadhi while others are watching soap actors perform faces. #Queerissimo via Facebook https://t.co/XTzI3YznPO https://t.co/SmS1jbv1w7"], ["kadhi", 1174222960854540291, "@TwitterFood Used  custard powder to make kadhi thinking it is besan. Woh sunaya hai mumy ne do dino tak."], ["kadhi", 102624904, "While preparing Kadhi once I have added all ingredients but forgot besan..after 15 mins on flame I was wondering why its not getting thick..in last I thought there is some problem with buttermilk n thrown it away. Then realized my mistake 🤪 😁 https://t.co/oRLO22vNnb"], ["kadhi", 934387625258921990, "RT @gauravpramanik: I don't like kadhi-chawal so I don't eat it. But I don't go around shaming people who eat it just like some of y'all ar…"], ["kadhi", 1025719740688293891, "@desimojito Try momos with Kadhi 🙃"], ["kadhi", 1199578620, "Get the #distributorship of Ready To Eat Dal Makhani, Gajar Ka Halwa, Gujarati Dal Rice, Eat Khichdi Kadhi and many more. \nShare your contact number to grab this profitable #BusinessOpportunity. #FoodProducts #ReadyToEat https://t.co/UHXSBr4GSE"], ["kadhi", 946329127, "@MAKWAEMILTON @RujaalCitizen @idealist254 @JunetMohamed Since u have read the document, can u tell us about the new expansion of Kadhi courts suggestion?????"], ["kadhi", 143437914, "Today in Hungry Amigas, Rajasthani Kadhi is being savoured. The video shows the instant way to make Kadhi, a very simple &amp; authentic recipe.\n\n#RecipeOfTheDay #yummy #dinner #food #thursdaymorning #ThursdayMotivation #recipes #ThursdayThought #thursdayvibes\nhttps://t.co/GQBdwjLyM6"], ["kadhi", 28229170, "@abhijitmajumder Sol Kadhi\nGinger tea\nFilter coffee"], ["kadhi", 17671636, "@nandiniv Same. Just not able to get back to track. Monday I said let me give up carbs in dinner and start from there. And then I ate kadhi chawal 🙄🤷🏻‍♀️"], ["kadhi", 36427373, "I don't like kadhi-chawal so I don't eat it. But I don't go around shaming people who eat it just like some of y'all are shaming Chinese people for eating whatever tf they do and they want to."], ["kadhi", 33154333, "@AndrewLeezus No one"], ["kadhi", 1164399851578093569, "@walnut_crumble Whaaat? Even I am obsessed with kadhi."], ["kadhi", 137928346, "RT @IndiaCanteen: Kadhi pakora is a #spicy sour yogurt and gram flour based curry with crispy fried vegetable #pakoras simmered in the #cur…"], ["kadhi", 33154333, "@SenatorTimScott you’re an idiot."]]