[["kulcha", 1005471186522857472, "@IamRajii Chole kulcha is very cheap in NCR like idlis in South\n\nEach region has their own speciality\n\nNo roadside stalls sell idlis worth rs.150\n\nU can't expect idlis to be 10rs in a good restaurants"], ["kulcha", 1622328542, "@_am_fine_ Last time he played at his best in ODIs. \nAlso best KulCha bowled in any series."], ["kulcha", 265126026, "It's high time that indian ODI team move on from Jadhav. Reason for ODI series loss,As we could have placed both manish pandey or Kulcha instead of him. if he is not bowling as 6th bowler then why include him in place of manish who is an excellent fielder as well\n#INDvsNZ"], ["kulcha", 1068890455364923392, "@anjubharatrawat @BuchUdit Really? what's the point of playing Kedar Jadhav? Who are our back up openers? Who are our back up seamers? What is our best XI? Who will bowl the middle overs? Will Kulcha play together again? And my opinion is not based on a few games, it's based on last three years."], ["kulcha", 27660980, "#throwback from the winter. When you meet Modna and Madonna and end up having booze followed by masaledar rich North Indian food. The result: a sleepless night from all the chicken, mutton and kulcha.… https://t.co/IfLpAFrHVm"], ["kulcha", 1014083616660389888, "@J_KULCHA @TheNitaWooShow wow that crazy"], ["kulcha", 929681500156645377, "@IamRajii At my native place I eat roti everyday.\nWhen I went to Bengaluru, I started eating rice and idli because Indira Canteen served at a very cheap price. \nMoved to Delhi, I started having chola kulcha, chola bhature, punjabi subji roti..\n\nAdopt to the cheap and tasty things."], ["kulcha", 258797839, "@Effgroundforces @BlackCulture_HM Speaking truth to power"], ["kulcha", 258797839, "RT @Effgroundforces: Toxic talk must never find expression amongst fighters, we must protect each other by any means. Have a blessed week a…"], ["kulcha", 258797839, "@TheNitaWooShow China. They set people up over there.\nBlack people get set up and framed for smuggling drugs before being executed.\nThose little jabronies are racist to the extreme.\n Now that I think about it.......hold that carona to your bloody chests"], ["kulcha", 225868669, "@antt_shantt This is the only reason i don't get ripped 😤 . Don't wanna be ashleel, i respec my kulcha."], ["kulcha", 570754932, "3 Quick Tips for #IndiaODI team :\n\n1. Bring #kulcha combo back\n\n2. Shami, Bhumrah and Bhuvi shud be starting line up for fast bowlers. 4th back seamer: Saini\n\n3. Play Manish Pandey at #6 till Pandya is back. Jadhav doesnt deserve\n\n@BCCI\n@SGanguly99 @imVkohli #INDvNZ #INDvsNZ"], ["kulcha", 1030121341, "@krish_ramkumar Waw, As always you have made us learn new word 'Kulcha' ."], ["kulcha", 258797839, "Come to really like this OG style even more. Imagine seeing an anime in this exact style https://t.co/YF2YAcgEPU"], ["kulcha", 258797839, "@angelicaschul Obviously he had something insulated to put in.... choopid people"], ["kulcha", 1052263168225886208, "@_rchie0425 @yuzi_chahal @imkuldeep18 @Jaspritbumrah93 @imVkohli @klrahul11 @MdShami11 @BLACKCAPS So @_rchie0425 ap ye bhi to dekho ye settled team nhi h na, openers fix nhi h, keeper ka issue h, kulcha sath nhi khel rhe &amp; obviously lots of injuries. \nBki i agree with you ki india apna100% cricket nhi khel rhi. \n#INDvsNZ"], ["kulcha", 963753459001339904, "@HerNameIs_Bea's account has been withheld in India in response to a legal demand. Learn more."], ["kulcha", 258797839, "RT @chwuks: @J_KULCHA @TheNitaWooShow Man like Goliath from the Gargoyles and the president from Rick and Morty you lot are haters"], ["kulcha", 1484953009, "@melvyn_waters @SunnySixxkiller A snake &amp; Pygmy pie is traditionally served in those areas. It beez der kulcha n’sheit."], ["kulcha", 258797839, "@Eazy_E_____ What did you just say??"], ["kulcha", 1226277086819569664, "KULCHA Combination should be in playing XI\nOTHETWISE INDIAN CRICKET TEAM WILL FACED LOT OF PROBLEMS IN T-20 ND ODI"], ["kulcha", 258797839, "@Eazy_E_____ Oh shiiii whaaaa https://t.co/TfrvXGn2wm"], ["kulcha", 717604996217307136, "RT @sandeep_chavda: Tottally wrong, being in bengal you wont get gujarati dhokla, being in gujarat you wont get bengali fish, simillarly be…"], ["kulcha", 758290968223293441, "@Boomrah_ @_am_fine_ @NehasVirat Kulcha bowled best on overseas tour of nz sa 18/19 too."], ["kulcha", 3139425860, "Tottally wrong, being in bengal you wont get gujarati dhokla, being in gujarat you wont get bengali fish, simillarly being in north India you will not get idli as you wish, simillarly you wont get a amritsari kulcha in Chennai .this is totally fine,,dont impose your sick mentalty https://t.co/fsU1sKUGGd"], ["kulcha", 280878414, "@Annie4Leonhart Tollywood is based. They managed to ruin even Jaarji reddi. It was one of their best to consolidate and inspire their base. \nTollywood is bulwark against PC kulcha."], ["kulcha", 258797839, "@steven_dor @acheatingvegan It’s called being an a hole and scaring a train operator witless doing stupid y boy stuff"], ["kulcha", 3041548038, "@J_KULCHA @acheatingvegan It’s called daring, gets you more mu shu."], ["kulcha", 258797839, "@PritiDawg @theydeadinside This clip will never not be hilarious to me"], ["kulcha", 258797839, "@EllipseEnt @Eazy_E_____ @RetroBoyJon @stewie55uk @swooper_d @timson72 @Shatter31751915 @ColonelFalcon @GameDevScott @prime_retro Just look at that Dreamcast cmon.\nEven the name is cool"], ["kulcha", 258797839, "Bring these man to London and expose https://t.co/CuLSfVJhRQ"], ["kulcha", 3282759600, "Ashwin, kulcha can play in the same match because spin is the best strength of india's bowling strength..? #asktheexpert"], ["kulcha", 2303374400, "@TheCricketPanda Only Tests\nIn ODI's, his defensive approach in bowling is not helping comparing to KulCha. His batting comes in handy \nIn T20I's, As an all rounder has SR of 102 while batting, HS of 25 &amp; 39 wickets in 49 innings"]]