[["lemon rice", 2495102900, "RT @StopSmackn: We don’t mind you being greedy, order a lamb chop on the side with our lemon butter grilled chicken, asparagus &amp; white cila…"], ["lemon rice", 755745558, "We have Homemade Spanikopita, Delicious Gyros, Greek Omelettes and our famous Greek Hot Plate EVERY Day. We also make our Greek Lemon Chicken Rice every Thursday! Try our Greek Specialties today! https://t.co/7oPByMqN1i"], ["lemon rice", 2170833285, "RT @robsim66: New for our spring menu For all those who are counting the calories Steamed Haddock olive oil and lemon served with TenderSte…"], ["lemon rice", 240010599, "RT @StopSmackn: We don’t mind you being greedy, order a lamb chop on the side with our lemon butter grilled chicken, asparagus &amp; white cila…"], ["lemon rice", 137102430, "Soups of the Day - Lemon Chicken &amp; Rice or Dal.\n.\n.\n.\nLunch Special - Roast Beef, Smoked Cheddar Melt with Sweet Hot Peppers on Baguette.\n.\n.\n.\n#kivadeli #soup #sandwich #downtowneugene #lunch #eatlocal #eugeneeats"], ["lemon rice", 174920083, "RT @StopSmackn: We don’t mind you being greedy, order a lamb chop on the side with our lemon butter grilled chicken, asparagus &amp; white cila…"], ["lemon rice", 4461794069, "@littlefabshop I'm a veggie and create my own stir fry with chickpeas, peppers, spring onions and any other veg in the fridge. Chuck in a bit of soy sauce and lemon juice and eat with rice or noodles. Yummy. 🌽🌶🍅"], ["lemon rice", 71581218, "Calling all #SeafoodLovers! Try the Plough's Atlantic Salmon &amp; Crabmeat tonight for dinner!! Baked Salmon topped with Crab Meat in a lemon caper white wine sauce served with Basmati Rice &amp; Wilted Spinach! #Seafood #PhillySeafood #PhillyFoodies #PhillyFood https://t.co/3fc7r1Pqf2"], ["lemon rice", 988978007313408000, "Baked Tilapia &amp; lemon rice today😋"], ["lemon rice", 1158789876004859905, "We don’t mind you being greedy, order a lamb chop on the side with our lemon butter grilled chicken, asparagus &amp; white cilantro rice! #StopSmackn 😋 https://t.co/olMtDrnpYa"], ["lemon rice", 760290836902875136, "@nayanikaaa This is my trick. I use slightly less than twice the number of cups of water as the cups of rice being cooked. And add half lemon juice while its cooking."], ["lemon rice", 1473005179, "RT @InSeasonRecipes: Lemon rice #rice #dairyfree #glutenfree #vegan #seasonal #recipe https://t.co/yI1UfIEWWa https://t.co/EzHx1hpeZD"], ["lemon rice", 2892737791, "@Subashini_BA Both lemon and tiger rice 😋"], ["lemon rice", 880833560, "Today's Menu in Superior Dining:\n\nLunch - Broiled Lemon Pepper Whitefish with Wild Rice Pilaf\nDinner - Burritos 🌯 with Spanish Rice &amp; Fiesta Black Beans"], ["lemon rice", 1129949859715440641, "This boy is adding lemon to vermicelli rice \nMy t roll is finished too"], ["lemon rice", 166945616, "I have recently become obsessed with shaljam ki bhujjia eaten with boiled rice (the ratio has to be more rice less shaljam) and desi salsa (tiny diced onions, tomatoes, coriander, lemon, chilli powder, salt! So interesting how different homes make their own essential condiments!"], ["lemon rice", 4024750037, "2/6 Lunch\nSoup~ Lemon chicken &amp; rice\nChef's Choice~ Beef stroganoff over egg noodles\nVeg~ Sautéed bok choy\nSt~ Roasted red bliss potatoes \nDeli~ Dagwood sandwich"], ["lemon rice", 3018427337, "Delicious dinners are possible! Last night for dinner, Jess made chicken breast with sautéed apples and cinnamon with a side of Brussels sprouts. Jim made baked lemon pepper fish with brown rice and veggies. #gettingfit #wellness https://t.co/vXdp3O2zuF"], ["lemon rice", 526535825, "i still sing lemon over rice in adore you eye-"], ["lemon rice", 1701231379, "@nayanikaaa Boiling technique basically.Also, add lemon &amp; a little black pepper.When you lift the lid in the end, seperate rice roughly with a fork (not tablespoon).\n\nPressure cooker rice is sticky.When you boil rice in an open vessel (correct water ratio crucial),you can make seperate rice."], ["lemon rice", 2707000530, "Feb 6th: Fried or Greek Chicken, Dr Pepper BBQ Meatloaf, Chicken Gizzards &amp; Livers, Mashed Potatoes, Rice, G.Beans, M.Greens, Sweet Potato Cass., Squash Cass., Lima Beans, F.G.Tomatoes, Broccoli Salad, Banana Pudding, Pecan or Lemon Pie. \n\n#farmersmarketcafe #seemgm #mymgm https://t.co/TCIGfR4YET"], ["lemon rice", 142055252, "Mines a lemon chicken and rice, and some prawn toast please. Damnit, I want a Chinese now. Please buy my services so I can afford one @rebelgirlstyle https://t.co/qETEXhAs0R"], ["lemon rice", 529496096, "New for our spring menu For all those who are counting the calories Steamed Haddock olive oil and lemon served with TenderStem Broccoli and rice \nONLY 449 CALORIES 😍😍😍😍 total_produce_devon @ Simply Fish https://t.co/mWRUhAwkRA"], ["lemon rice", 1214857775362142208, "My kimchi rice and non- alcoholic lemon cocktail https://t.co/90RVhtIYjg"], ["lemon rice", 2280574315, "RT @jpaudouy: Here we are. Stuffed vine leaves, Lebanese style. \nFirst rince the pickled leaves in warm water. Soake the arborio rice in wa…"], ["lemon rice", 804024188, "\"Rats in a Cream Sauce, Rat Flambe, Rat Necrom with Bonemeal Gravy, Deep-Fried Rat, Lemon Rat and Wild Rice, Rat Ragu with Powdered Deer Penis!\" https://t.co/p9ENIRXBdK"], ["lemon rice", 50381314, "One-Pot Lemon Thyme Chicken and Rice https://t.co/FLFQbjishL"], ["lemon rice", 1900386330, ".@kwanghi_ is in charge of the Six Kitchen this evening with an amazing Thai basil roasted lemon chicken dish with potatoes, celery and a side of steamed rice! All the details are over on our Facebook page! https://t.co/X6fvj5uUem"], ["lemon rice", 1413350383, "Today’s meal prep is:\n- lemon pepper chicken breast with a hint of smoked paprika garnished by cayenne asparagus and jasmine rice"], ["lemon rice", 269581812, "@kennirich1 You can make vegan like sandwiches with guacamole as the spread, roasted sweet peppers and mushrooms.. if you eat fish you can also do baked or grilled salmon with lemon, a side of white rice and steamed vegetables. I do meal plans so if you need help I gotchu"], ["lemon rice", 195366253, "Here we are. Stuffed vine leaves, Lebanese style. \nFirst rince the pickled leaves in warm water. Soake the arborio rice in warm water for ½ hour. Broil the lamb meat that with garnish the bottom of the pan (for taste) and prepare the lemon and tomatoe slices. https://t.co/SjarMbC3iN"], ["lemon rice", 2672794778, "Now you can hop onto the train of protein-rich, healthy and delicious food! Cook this delicious Nutrela Soya Lemon Rice by following the recipe here: &lt;https://t.co/gJA5anB5KN&gt;\n\n#HealthyRehnaSimpleHai https://t.co/SknQ1WOUNA"], ["lemon rice", 1132669111358509056, "RT @InSeasonRecipes: Lemon rice #rice #dairyfree #glutenfree #vegan #seasonal #recipe https://t.co/yI1UfIEWWa https://t.co/EzHx1hpeZD"], ["lemon rice", 43743686, "@jodie_anderson It’s Caribbean food place!!! The oxtail, rice and peas, steamed vegetables, plantain and Mac an cheese are divine! Make sure to top it off with an extra sweet beverage! I suggest the lemon flavour! 😆 enjoy! Take the 2 or 5 line to Flatbush and it’s 2 mins from the last stop."], ["lemon rice", 114149997, "Put Garlic Olive oil in medium to hot pan, add ginger,Siracha, Sambal Oelek , chives. Stir until ginger Powder is dissolved, then add honey stir until well mixed &amp; fragrant. Add rice vinegar, soy sauce, and lemon juice."], ["lemon rice", 1116987804616028160, "@Surya4You7 Lemon rice😒😂😂 https://t.co/JuXlUIljWS"], ["lemon rice", 3059906170, "Turmeric Lemon Rice Recipe. Indian Golden Rice with turmeric, lemon and mustard seeds | https://t.co/uBeq0KvNgN -  https://t.co/IiOdtEnBMZ https://t.co/DuvRaTr5m2"], ["lemon rice", 3059906170, "Turmeric Lemon Rice Recipe. Indian Golden Rice with turmeric, lemon and mustard seeds | https://t.co/uBeq0Kecpf -  https://t.co/IiOdtE60Vr https://t.co/vO1Vg73YB8"], ["lemon rice", 855348651421560833, "Lemon rice #rice #dairyfree #glutenfree #vegan #seasonal #recipe https://t.co/yI1UfIEWWa https://t.co/EzHx1hpeZD"], ["lemon rice", 3059906170, "Turmeric Lemon Rice Recipe. Indian Golden Rice with turmeric, lemon and mustard seeds | https://t.co/uBeq0KvNgN -  https://t.co/IiOdtEnBMZ https://t.co/bacsT4D5sE"], ["lemon rice", 229220459, "Lemon garlic salmon and shrimp over some jasmine rice wit jerk butter 🧐"], ["lemon rice", 25018770, "My new favorite midnight snack is quinoa rice, butter, parsley and lemon."], ["lemon rice", 165502502, "@areyouokAnni @Andy_Lunique Yassss and some extras! Marinated the beef in ginger, garlic, S&amp;P, lemon, and coconut aminos (soy sauce substitute)\n\nThe fried rice had pretty much the same ingredients + onions. Turned out pretty tasty!"], ["lemon rice", 266229523, "The seared salmon with wild rice and sautéed veggies with a lemon butter sauce sounds good"], ["lemon rice", 237526765, "Home later than normal from the gym today so I threw together this simple meal. Seared flat iron steak with sauteed zucchini and garlic rice. I seasoned the steak with a little lemon pepper and it was delicious.… https://t.co/pvdQcR9tFv"], ["lemon rice", 1111540210192519173, "@Joyosaur @HireVesuvius Canned salmon, mixed with cream cheese, lemon juice/zest, and either dill or chive in the center of a rice ball, then coated with breadcrumb and fried. https://t.co/BKT4moK1vg"], ["lemon rice", 824154788, "@EEGCapVarun ok hear me out: take the example of steamed vegetables and brown rice with a bit of lemon juice. it helps rejuvenate your pallet and like you FEEL better too. trust"], ["lemon rice", 1001958717967945728, "sry that i left yall, but ya gurl was hungry! ..  brown rice in gravy, lemon pepper chicken topped with Swiss n parsley. n scalloped potatoes with green onion, bacon , n Monterey cheese in a cream of chicken sauce… https://t.co/yhJsAuLN76"], ["lemon rice", 3409684834, "@Princessmimiitv @PlNKNIP for makeup remover + cleanser I use the Rice Water Bright set from face shop. After that I use the Secret Key lemon peeling mask, &amp; then an essence, my go to is Snail 96 from COSRX, and then any nonalcoholic moisturizer. you should be able to find everything on amazon ✨💕"], ["lemon rice", 40291487, "We made Georgian Kharcho tonight.  Beef and rice soup with parsley, dill, and lemon. Heather and Seanna will be happy I used a bay leaf again. #dinner #republicofgeorgia  #georgian #georgianfood https://t.co/lICyjUtS1h"]]