[["lentils and spinach", 1222673118893944833, "RT @jeffsekerak: MUSCLE BUILDER SOUP! Made with sprouted lentils from a local market &amp; greens from my own garden. 1) It’s delicious. 2) It…"], ["lentils and spinach", 34327520, "RT @CChef1980: @jeffsekerak Lentils are awesome. Love spinach too. I’ll give it a try. I make a blended lentil soup with dried chipotle and…"], ["lentils and spinach", 1011146336559759360, "@jeffsekerak Lentils are awesome. Love spinach too. I’ll give it a try. I make a blended lentil soup with dried chipotle and tomato sauce that is insanely good. You need a powerful blender though."], ["lentils and spinach", 2256664812, "RT @YosvaniRamos: Tofu scramble with sautéed spinach and mushrooms with lentils and chickpeas \n#vegan #plantbased  🌱 https://t.co/jDru6iF8xf"], ["lentils and spinach", 34327520, "RT @jeffsekerak: MUSCLE BUILDER SOUP! Made with sprouted lentils from a local market &amp; greens from my own garden. 1) It’s delicious. 2) It…"], ["lentils and spinach", 209785158, "Tofu scramble with sautéed spinach and mushrooms with lentils and chickpeas \n#vegan #plantbased  🌱 https://t.co/jDru6iF8xf"], ["lentils and spinach", 5335792, "@mak506 Wilt the spinach with some garlic. I have a rice cooker, into which I put 3/4 cup Arborio rice and 1/4 cup red lentils, 3 1/2 cups water (I subbed in some white wine for water), the spinach, some salt and some olive oil."], ["lentils and spinach", 62581345, "S/O to all the educators out there who are teaching tonight — I see you and I salute you with this, my Valentines’s Day dinner of lentils, spinach, and rice alone with a spork I keep in my purse #education #nightclass https://t.co/ph92h5Iyx3"], ["lentils and spinach", 214573796, "RT @giangiskitchen: Add lentils for a gluten-free side dish. Or, for a copious salad, add arugula, baby green mix or spinach and sprinkle w…"], ["lentils and spinach", 97222701, "Five spice duck on puy lentils with spinach and a Nigella tobelerone mousse.\n@louiseyanna1 I was only messing when I said I would take your sister to Coppi for valentine's. \nLove you. https://t.co/1D8v6hMaAy"], ["lentils and spinach", 20131176, "Self care this evening. Pan fried pork steak with lentils, spinach and carrot in mustard cream sauce. \n\nYum! https://t.co/bGqFwutMXV"], ["lentils and spinach", 1139120828124225538, "Vege dhal and spinach curry. Lots of it, cheap, healthy, scrummy! 4 x packs of fresh spinach. 1 x 500g pack of red split lentils, some cumin, coriander, some medium curry powder, 6 x onions, 6 x garlic cloves, 2 red… https://t.co/kQW3QIfJX3"], ["lentils and spinach", 1671273020, "So my green shakshuka was basically 66% green lentils with spinach and 2 poached eggs (called baked on menu but definitely poached). It was lacking in spices, flavour, chilli heat &amp; sauce.\nSo it was okay but it's gonna deffo give my intestinal tract a good clear out 😁"], ["lentils and spinach", 326855337, "Challenge - Go to the shop and buy:\n- chickpeas\n- tinned tomatoes \n- coconut milk\n- brown rice \n- quinoa\n- pasta\n- frozen veg / peppers / spinach \n- red lentils \n- kidney beans \n- vegan sausages \n- oats \n- bananas\n\nSee how many meals you can make &amp; how long you can make it last"], ["lentils and spinach", 2914458695, "RT @YemSmoothies: Day 4 of 20 #spinachchallenge #kalechallenge\nEat the colours of the rainbow 🌈 🌈\nVegan: Lunch / Dinner: Lentils and spinac…"], ["lentils and spinach", 2723977834, "Pork with mustard and spinach lentils https://t.co/Y8GdKGbYsJ"], ["lentils and spinach", 785922875500875776, "@cookieshower_ spinach and lentils from what i understood"], ["lentils and spinach", 15620342, "RT @FrozenDietMeals: 📷 Healthy Choice Simply Steamers Mediterranean-Style Lentil Bowl “Lentils and chickpeas with fire roasted red bell pep…"], ["lentils and spinach", 701378988, "📷 Healthy Choice Simply Steamers Mediterranean-Style Lentil Bowl “Lentils and chickpeas with fire roasted red bell peppers, spinach, tomatoes, and carrots take your taste buds on a trip to the Mediterranean. A lemon herb sauce brings the dish... https://t.co/auahvqvumM"], ["lentils and spinach", 1710198668, "RT @YemSmoothies: Day 4 of 20 #spinachchallenge #kalechallenge\nEat the colours of the rainbow 🌈 🌈\nVegan: Lunch / Dinner: Lentils and spinac…"], ["lentils and spinach", 2492788207, "Day 4 of 20 #spinachchallenge #kalechallenge\nEat the colours of the rainbow 🌈 🌈\nVegan: Lunch / Dinner: Lentils and spinach mix with brown jollof rice, plantain  and flat green beans .\n#vegan #yemsmoothies #wholesome #vegannigerian #veganideas #veganlunch #vegandinner #plantain https://t.co/4Gbo4QEbSs"], ["lentils and spinach", 1586746200, "RT @jeffsekerak: MUSCLE BUILDER SOUP! Made with sprouted lentils from a local market &amp; greens from my own garden. 1) It’s delicious. 2) It…"], ["lentils and spinach", 976119935540846594, "RT @jeffsekerak: MUSCLE BUILDER SOUP! Made with sprouted lentils from a local market &amp; greens from my own garden. 1) It’s delicious. 2) It…"], ["lentils and spinach", 3059275266, "Diets rich in potassium may help to maintain healthy blood pressure. Vegetable sources of potassium include sweet potatoes, white potatoes, white beans, tomato products (paste, sauce, and juice), beet greens, soybeans, beans, spinach, lentils, and kidney beans.\n\n#superfood https://t.co/ZBTTI7HD5n"], ["lentils and spinach", 617753173, "@theinfamousyr Bruh yall, it be too seasoned fr, so don't take NOTHIN out of your diet before you add some broccoli and spinach! Try some seasoned beans/lentils! Eat more sweet potatoes/yams if you haven't. When you found what you like, you can think about giving up certain foods. #tooseasoned"], ["lentils and spinach", 550342664, "RT @jeffsekerak: MUSCLE BUILDER SOUP! Made with sprouted lentils from a local market &amp; greens from my own garden. 1) It’s delicious. 2) It…"], ["lentils and spinach", 712250761808322560, "RT @jeffsekerak: MUSCLE BUILDER SOUP! Made with sprouted lentils from a local market &amp; greens from my own garden. 1) It’s delicious. 2) It…"], ["lentils and spinach", 2157155103, "RT @jeffsekerak: MUSCLE BUILDER SOUP! Made with sprouted lentils from a local market &amp; greens from my own garden. 1) It’s delicious. 2) It…"], ["lentils and spinach", 34327520, "MUSCLE BUILDER SOUP! Made with sprouted lentils from a local market &amp; greens from my own garden. 1) It’s delicious. 2) It satisfies you at the deepest level. And 3) Lentils &amp; spinach BOTH contain a FULL AMINO ACID profile. This soup is a serious muscle builder. Try it! https://t.co/Y0yb45pump"], ["lentils and spinach", 983427676693123072, "@DrParthVerma @RupesChoudhury @PetaIndia @Amul_Coop Lentils based protein is as good as 0.6-0.75 of casein. Combos like Lentil-wheat, lentil-rice, pea-wheat, blackbean-wheat all are at 0.75. Spinach, pumpkin leaves, broccoli and other bhajis etc. are also at 0.75 rating. Cashew nuts are also rated 0.9 on PDCAAS."], ["lentils and spinach", 100708134, "RT @07Chaitali: Weekday lunch. The keerai kottu (spinach with lentils and spices) was delicious. Easy recipe from @saffrontrail https://t.c…"], ["lentils and spinach", 3300827153, "Is your dinner a winner?\nQuite proud of this little number - roaster red kuri squash &amp; cauliflower with lentils, spinach 🥬 and sweet potato 🍠. \nMight even go crazy and add some hummus too. \n#RockNRoll #HummusAddict #DinnerWinner https://t.co/cqdHIvD3gz"], ["lentils and spinach", 73107216, "RT @FoodLoversMkt: Did you know that certain foods pair better together for the ultimate nutritional benefits?\n➜ Iron + Vitamin C = meat/se…"], ["lentils and spinach", 914169026, "RT @FoodLoversMkt: Did you know that certain foods pair better together for the ultimate nutritional benefits?\n➜ Iron + Vitamin C = meat/se…"], ["lentils and spinach", 1167913245467971584, "RT @FoodLoversMkt: Did you know that certain foods pair better together for the ultimate nutritional benefits?\n➜ Iron + Vitamin C = meat/se…"], ["lentils and spinach", 465620117, "Did you know that certain foods pair better together for the ultimate nutritional benefits?\n➜ Iron + Vitamin C = meat/seafood/lentils/spinach + lemon/citrus/strawberry (avoid tea, whole grains, and dairy products). For example: Steak + broccoli. https://t.co/KG3xN8I7Uz"], ["lentils and spinach", 1121029629186207746, "high fibre foods such as;\n— avocados\n— raspberries and strawberries\n— almonds and other nuts\n— carrots\n— oranges and pears\n— kale and spinach\n— kiwi fruit\n— beans and lentils\n— chia and other seeds"], ["lentils and spinach", 1108142920522035202, "RT @vegrecipeindia: This Instant Pot Dal Palak is an easy and nutritious recipe of spinach with pigeon pea lentils. #spinach #vegetarian\nht…"], ["lentils and spinach", 929104851220488192, "I'm anaemic so had to really think about how to add more iron in my diet. Tomorrow I have oats in my breakfast and spinach and lentils in my dinner. That should definitely help"], ["lentils and spinach", 717211043060183042, "@ChrisAndre6 @fostet_l @debjonesdj @DailyCaller Do you know that phytoestrogens are also found in:\nOats, barley, beans, lentils, rice, apples, pomegranates, Coffee, mint, ginseng, BEER, fennel and even spinach."], ["lentils and spinach", 3088090712, "@Drake45937441 @teetharevegan @eatpussynotpigs @stormiweatherr So you're just going to forget about beans, tempeh, lentils, chickpeas, hempseed, green peas, soy milk, nut butters, chia seeds, broccoli, spinach, potatoes, asparagus? Or you're CHOOSING to be lazy and ignorant about what foods actually have protein? Which is it? 🧐"], ["lentils and spinach", 110530129, "@lexiiiisade Spinach, kale, broccoli, carrots and celery quinoa and lentils cooked in veggie broth"], ["lentils and spinach", 1139166159226494977, "My second day of trying healthy food. Pork chop and Bulger wheat with little red lentils, asparagus, chili spinach. So far so good today 😂😂 https://t.co/uBQEGZYnei"], ["lentils and spinach", 21453226, "RT @07Chaitali: Weekday lunch. The keerai kottu (spinach with lentils and spices) was delicious. Easy recipe from @saffrontrail https://t.c…"], ["lentils and spinach", 946968409824165889, "Curry lentils, with broccoli, spinach, string beans and celerey? \n\nSweeeet."], ["lentils and spinach", 2913541640, "Weekday lunch. The keerai kottu (spinach with lentils and spices) was delicious. Easy recipe from @saffrontrail https://t.co/TyGOOJFS8i"], ["lentils and spinach", 147723974, "Meat's expensive. Lentils and beans and veggies aren't necessarily so. A bag of spinach and carrots are cheap (and healthy). https://t.co/lBvFXETPSH"], ["lentils and spinach", 28345137, "@TattersNRavens @jannarden When my iron drops I start by adding spinach and/or mushrooms to literally everything I eat. Next I ramp up the lentils. Also, little things like always leave the skins on your potatoes! Aaaand have something high in vitamin C to help your body absorb the iron."], ["lentils and spinach", 366589541, "Starting on the left and going clockwise: carrots with beans, Yebeg Alecha, Siga Wett (beef), Yemisir Wett (lentils), Yellow Beans, Yedoro Wett (chicken), and Spinach in the middle. #H330dineout2020 https://t.co/RdvVQEYwrU"], ["lentils and spinach", 366589541, "Our server suggested we try the “Taste of Abyssinia” meal which features many types of traditional Ethiopian foods including Yebeg Alecha (Lamb Stew), Wett (spicy stew with beef, chicken, or lentils), spinach, yellow beans, and carrots with beans. #H330dineout2020 https://t.co/3SIpmI9cnz"], ["lentils and spinach", 753322849167929345, "@herbivore_club Lentils, spinach, green peppers, onions. Made into a dip and eaten with fried pitas🤤 https://t.co/5JQNnIzQAv"], ["lentils and spinach", 2245308045, "Trying to eat healthier .... grilled pork loin, carrots, garlic, spinach, lentils, whole grain mustard and low fat creme fraiche....\n#eatinghealthieronemealatatime \n#positivethinking \n#mindfood\n#OneDayAtTime https://t.co/ovos4ZGnNc"], ["lentils and spinach", 50740125, "#WorldPulsesDay A satisfying supper of spiced red lentils cooked with sweet potato, carrot, cabbage and spinach. Hooray for pulses - affordable, nutritious, versatile and delicious! https://t.co/IwDLxf365J"], ["lentils and spinach", 131904368, "@Lucy_Saxon For an iron rich meal, I do a dahl with red lentils, spinach, tomato paste and green peas (plus lots of onions and garlic). It’s yummy and packed full of goodness 😀"], ["lentils and spinach", 336097611, "@DragonKnightKX @SGTC_ELITE_ @shahsaurinb @FionnaCoolGirl @ABC Iron is also found in many plant-based foods such as:\n\n-green vegetables, for example spinach, silverbeet and broccoli\n-lentils and beans\n-nuts and seeds\n-grains, for example whole wheat\n -dried fruit\n\nAnimals don't gain iron from the air. :)"], ["lentils and spinach", 415691011, "Today's lunch is fridge and freezer soup with sweetcorn, puy lentils and spinach. Because I'm not going shopping in this weather! #souptweet"], ["lentils and spinach", 66897885, "Here’s the recipe if you’re interested. (He did ricotta → hummus, and parsley → spinach)\nhttps://t.co/yWtA7VqB9t"], ["lentils and spinach", 47339454, "RT @AnitaBean: LENTIL, CHICKPEA AND SPINACH DAHL\n\nThis warming dahl includes three different protein sources – lentils, chickpeas and cashe…"], ["lentils and spinach", 66897885, "Delicious dinner by my housemate tonight - couscous, lentils, spinach and hummus 😋 https://t.co/hIUhq0VONn"], ["lentils and spinach", 1108548266885607424, "dinner for today is Beef with Spinach Orzo and BBQ sauce, Lentils with mashed potatoes and honey mustard, Chili bar, apple cake"], ["lentils and spinach", 2930400301, "@BurrowsRed Microwave rice with frozen vegetables and lentils \n\nWrap bread with baby spinach tomato and any kind of protein (I use quorn fillets because they’re quick but you know)"], ["lentils and spinach", 444080597, "@bronachkane Tomato, lentil and spinach:\nCook onions and garlic, add any extra veg like carrots, add tomato paste and chopped tomatoes, and red lentils, top up with stock or hot water, and simmer it down for 30 mins or untill lentils are cooked. Stir in spinach at the end 😊"], ["lentils and spinach", 269366228, "@bronachkane I love roasting up butternut squash, sweet potato, red onion and garlic, then blending it all together with stock, a bit of curry powder, maybe some lentils/kidney beans/spinach ☺️"], ["lentils and spinach", 977431578530983936, "Attempt number one at red lentil humus. Soon to be demolished with lentils, quinoa and spinach for lunch. \n\nI'll set another place. Who's coming? https://t.co/qeC7P8gc9o"], ["lentils and spinach", 1394838366, "@deputygrocott I made roasted radishes and potatoes with lentils, spinach and a yoghurt dressing. Anna Jones recipe. Am really enjoying cooking from A Modern Cook’s Year so far."], ["lentils and spinach", 21939264, "Had you seen our #Special #tapas this #weekend in #Liverpool? #Lamb chop with #lentils, #piquillo #pepper and #spinach &amp; #cod and #chorizo fish cakes with homemade #tartare sauce #tapas #barcelona #catalunya #spain #wine #rioja #gin #hanoverstreet https://t.co/vRFRAtLLJ8 https://t.co/aEaPic1iGr"], ["lentils and spinach", 594058593, "Spicy bacon lentils over spinach and cheddar bay biscuits. https://t.co/NKxhnZy5bE"], ["lentils and spinach", 22599254, "RT @ianagate: @DaveLFC264 Usually my lunch will be dinner leftovers:\n\nDinner sample: Quinoa, spinach, pepper, mushroom &amp; mixed beans, chick…"], ["lentils and spinach", 26058047, "@DaveLFC264 Usually my lunch will be dinner leftovers:\n\nDinner sample: Quinoa, spinach, pepper, mushroom &amp; mixed beans, chickpeas, lentils....you can also get creative. Cc @_TheBoss Dean will also be a great help with recipes. I steal a lot of ideas from him and get creative with them"], ["lentils and spinach", 21939264, "#special #tapas this #weekend in #liverpool we have grilled lamb chop with Navarran lentils, roasted piquillo pepper and spinach and we also have cod and chorizo fish cakes with homemade tartare sauce… https://t.co/iOOPotzk1K"], ["lentils and spinach", 779265566326620160, "Stove-cooked pork chop lunch in cast-iron panini press, with spiced lentils, chickpeas and spinach.\n#woodstovecooking https://t.co/zKG4TeJ6Pt"], ["lentils and spinach", 2345653232, "The key is to eat a varied diet. Almost all foods except for alcohol, sugar, and fats provide some protein. Vegan sources include: lentils, chickpeas, tofu, peas, peanut butter, soy milk, almonds, spinach, rice, whole wheat bread, potatoes, broccoli, kale. https://t.co/C89eltJVel"], ["lentils and spinach", 1005756062, "Made such a bomb ass lunch today with brown rice and quinoa noodles, garlic, spicy onion sambal, lentils, potatoes, spinach and green beans #BAM"], ["lentils and spinach", 817484454453268481, "For a salad, toss spinach, purple cabbage, and beets in a bowl. Top with  lentils and feta cheese. Throw in watermelon if you want."], ["lentils and spinach", 74334352, "Light yet absolutely satisfying. Pra Soave matches beautifully with sautéed shrimp, wilted spinach and lemon-caper lentils.\n\n#wine #italy #whitewine #soave #perfectpairing #shrimp #lemon #capers #specialoccasion… https://t.co/q4r7bKBjG2"], ["lentils and spinach", 568957121, "FRENCH PUY LENTILS w THYME (from Chaz’s garden) ROASTED CARROTS, yay.foods.vegan FETTA, CARAMELISED ONION &amp; SPINACH. All organic, vegan and gluten free! #vegansalads #vegan #glutenfree #vegansofmelbourne… https://t.co/72D8wNp4lf"], ["lentils and spinach", 390365792, "Red Curry Lentils With Sweet Potatoes and Spinach | #Recipe #food #cooking #eating with #rice | Easy, Main Course, Vegan, Vegetarian #dishes #dinner| Incl.\nVegetables, Coconut Milk, Curry Paste, Ginger, Red Lentil, Sweet Potato, Turmeric | https://t.co/i7MQ06QFK5"], ["lentils and spinach", 185337935, "This Instant Pot Dal Palak is an easy and nutritious recipe of spinach with pigeon pea lentils. #spinach #vegetarian\nhttps://t.co/YmNzjahSoA https://t.co/smAjnIL1OJ"], ["lentils and spinach", 2741712404, "Pheasant, chickpea and sweet potato curry with lentils, garlic spinach, pinkled onions, yoghurt and chilli.\nI know it’s the end of the season but would you like still like the simple and easy recipe?\n#biffenskitchen… https://t.co/UXiUbguwFR"], ["lentils and spinach", 66467210, "@_Dianababy Legumes, quinoa, chia seeds, tofu, lentils, broccoli, and spinach is how I incorporate protein in my diet"], ["lentils and spinach", 1148107912390144000, "@AliciaATobin Canned beans (Usually black and chickpea), quinoa, nutritional yeast, frozen peas and corn and spinach, dried lentils. I usually also have some curry paste, condensed stock (like a gel or powder), and coconut milk. Can make a looot of good dishes and all those things keep forever"], ["lentils and spinach", 1163905778606051328, "@Mawlerz Lentils\nBroccoli\nBell peppers\nEggs(?)\nBananas\nBaby spinach\nBread \nPotatoes\n\nBasically an average trip to the store for me but I added eggs and bread because those are normal (?) even tho I don't buy them"], ["lentils and spinach", 1022440267, "Mediterranean Diet today at our Global Station \nTuscan Grilled Tofu with Olives, Peppers and Capers.\nStewed Lentils &amp; Spinach\nRoasted Zucchini and Yellow Squash \nStewed Garbanzo https://t.co/pyEPCkRKBR"]]