[["malai kofta", 34996738, "RT @swati_h: @PoPville Noo! They had the best malai kofta curry in the city."], ["malai kofta", 86020826, "@PoPville Noo! They had the best malai kofta curry in the city."], ["malai kofta", 1227215954616045568, "RT @Shreesantoshfa2: Malai Kofta Curry is an exotic Indian gravy dish that comprises of two parts Kofta and the curry. \n\nWebsite: https://t…"], ["malai kofta", 982540322860232705, "RT @Shreesantoshfa2: Malai Kofta Curry is an exotic Indian gravy dish that comprises of two parts Kofta and the curry. \n\nWebsite: https://t…"], ["malai kofta", 1207245630344552449, "Malai Kofta Curry is an exotic Indian gravy dish that comprises of two parts Kofta and the curry. \n\nWebsite: https://t.co/fYI4hfr21C\nContact: 8688359003, 040-40208811.\n#Shreesantoshfamilydhaba #Restaurant #Dhaba #Madhapur #Kukatpally #Madinaguda #Vijayawada #Hyderabad #Food #Veg https://t.co/yrbdgDZYcg"], ["malai kofta", 1207330369344851968, "Malai Kofta is so good, but I really shouldnt have eaten the entire container."], ["malai kofta", 577543957, "I've missed a lot. So I'll combine some \"to know me\" stuff.\n\nBOOK: Foundation &amp; Empire (Asimov)\nMOVIE: 12 Angry Men\nNON-ENGLISH MOVIE: Rashōmon\nSHOW: Gargoyles\nALBUM: Ignaurus (Into Another)\nSONG: Let 'Em Say (Lizzo)\nVIDEO GAME: Chrono Trigger\nFOOD: Malai kofta\n\nAnything else?"], ["malai kofta", 955037811790565377, "@bxerrynini_ @SehunSemper OHHH HERE take some  options for your next restaurant visit\n1. anything paneer- I'm partial to palak paneer, which is like cottage cheese in spinach curry base. But it is cheese, so\n2. malai kofta- balls in gravy. Good stuff +its veg\n3. chickpea curry, this is really good if-"], ["malai kofta", 313752035, "@ZomatoIN I'm already dating Malai Kofta! ♥️😂"], ["malai kofta", 475787740, "5 Dishes to Get to Know Me (kaladkarin ako sa kainan)\n\n.Malai kofta and garlic cheese naan\n.Tinola with sayote, not papaya\n.Laing with rice and fried bangus belly\n.Jjajangmyeon sans meat, with sunnysideup egg\n.Seafood okonomiyaki with lots of chives https://t.co/gm4lXUmE82"], ["malai kofta", 2902874408, "@universe_gazer Sounds pretty good! I've had most of those before. Malai Kofta are one of my faovrites."], ["malai kofta", 1214994642158026752, "@ohiowa89 Rock climbing, fencing, cooking, and board gaming.\n\nMeatloaf, mashed potatoes, and Malai Kofta Curry.\n\nDune (Frank Herbert) and The Lost World (Michael Chrichton)\n\nAfter a military outpost is bombed, four strangers race to uncover the plot and save (or destroy) the Federation."], ["malai kofta", 1077643506317963266, "I just need naan and malai kofta for every single meal and I’ll be a happy person"], ["malai kofta", 2903942778, "I can't wait to roll a fat blunt and kill this malai kofta 🤤🤤"], ["malai kofta", 727904343572123648, "Hindutva and nationalism are like Malai .. can’t serve Malai only for main course . It has to be on top of Kofta or some thing solid. That solid thing is Economy/governance or at the very least targeted subsidies! https://t.co/tqeQgDX1zw"], ["malai kofta", 1038052508113891328, "@swiggy_in @SwiggyCares @swiggy @fssaiindia @DGPMaharashtra I ordered malai kofta on swiggy today at around 9 pm. Instead of that I received chicken and rice from this swiggy. Since I'm pure vegetarian I felt very harrassed by such gesture of @swiggy_in."], ["malai kofta", 2799388822, "@awkwordy WHAT DID YOU EAT???!! Green butter chicken, veggie Biryani, cheese &amp; raisin naan and malai kofta is the perfect order!! https://t.co/y59ypkXKNM"], ["malai kofta", 276968782, "@csuitesairport Set menu : in sweet - ladoo, feni, jalebi\nChapati of wheat flour and missi ( i don't know the English word ) \nVeggies: paneer, mix veg and malai kofta \nAnd chane ki daal (i don't know the English word of any of these) \nsalad along with papad, mix pickle and tipore of green chilli"], ["malai kofta", 22811629, "RT @TandooriEats: 😍 Malai Kofta 😍 A vegetarian favorite! Paneer and vegetable dumplings in a rich, nutty cream sauce. #IndianFood #Tandoori…"], ["malai kofta", 626971564, "isn't malai kofta basically vegetarian meatballs? hmm. #1amthoughts"], ["malai kofta", 839499033366392832, "😍 Malai Kofta 😍 A vegetarian favorite! Paneer and vegetable dumplings in a rich, nutty cream sauce. #IndianFood #Tandoori https://t.co/C05ptrhsPT"], ["malai kofta", 1200571476002390016, "BAD BOY ALERT. Spice grill in princeton New Jersey does NOT have Malai Kofta in their Buffett https://t.co/ehbi0dqITB"], ["malai kofta", 156737416, "@ShutdownFullcas Apparently this is some kind of low key revenge scheme for what I had perceived as an amicable break up. My ex knew that I like spicy food, but my guts can’t handle them. She insisted that her friend match with me on Tinder. I was set up, but the malai kofta was good."], ["malai kofta", 954124614040477702, "height: 5'8 3/4” so basically 5’9”\nage: 28\nshoe size: 9.5\nzodiac: libra\ntattoos: 1\npiercings: 10 in my ears \nfav drink: GINGER LIME DIET COKE\nfav food: MALAI KOFTA\nfav animal: my dead dog sadie, RIP, my alive dog junie https://t.co/4zOA6Mq2vN"], ["malai kofta", 1226215751645716480, "@zomatocare  ordered food 2day from Singh Sahed Dhaba, food was bad, there was only one small paneer piece in paneer sabji also it was oily and literally uneatable. Malai kofta had no kofta and tasted more like kheer. This is nt acceptable #zomato #boycottzomato order#2084088544 https://t.co/HHiKSYMcoX"], ["malai kofta", 839117798295023616, "@ShekharGupta @DilliDurAst Why every one calls you Malai Kofta ?🤔"], ["malai kofta", 75961069, "Only in SF: the American waitress at an Irish Pub serves Malai Kofta (fried potato balls) as Paneer Makhani.\n#Tch"], ["malai kofta", 76381524, "@sumiandnoir @ebruenig Malai Kofta, there is nothing better on god's green earth"], ["malai kofta", 126260697, "@swiggy_in i ordered one malai kofta and the food was worst\nI chat with swiggy care\nNd the experice was very bad\nI will never order food from swiggy\nNd ask my friends also not to use swiggy"], ["malai kofta", 1331848314, "@SwiggyCares I had ordered 2 malai kofta (Rs.270 each) but received only one. Your customer service agent says that only Rs.75 could be refunded via a coupon. What is this sorcery? https://t.co/9m78LezDPE"], ["malai kofta", 1207245630344552449, "The true vegetarian’s heaven- A tasty meal of Malai Kofta and Naan or roti! Already craving it? Walk-in today!\n\nWebsite: https://t.co/fYI4hfr21C\nContact: 8688359003, 7799846565\n\n#Shreesantoshfamilydhaba #Restaurant #Dhaba #Madhapur #Kukatpally #Vijayawada #Hyderabad #MalaiKofta https://t.co/w7G7j0Pym2"]]