[["mango coconut sauce", 5288052, "octopus sashimi, salmon maki platter, \"cheeky monkey\" + \"osaka lady\", salmon in coconut sauce, roast mango and duck breast, egg fried rice... finished with #Japanese green tea @having #slurpalicious #foodgasm #epic… https://t.co/idtddAOM2R"], ["mango coconut sauce", 17323666, "made Thai mango sticky rice with a salted coconut sauce today. Rice is so versatile 🥺💕"], ["mango coconut sauce", 1487936340, "@keguro_ I’d like to be a tiramisu, or an apricot tatin or even like sticky coconut rice w mango. But realistically I’m a Tesco’s cream filled choux bun w chocolate fudge sauce"], ["mango coconut sauce", 1222661664996093952, "Pelmeni that I cooked then fried In a pan with butter, mango and strawberries with jizz (coconut cream sauce leftover from sticky rice), and I am making sweet potatoes fries right now. I forgot to take pictures of chimichangas I ate I’m sorry https://t.co/erwEp31ftW"], ["mango coconut sauce", 17196987, "Quick dinner idea: 4 salmon fillets (thawed from frozen), 1 cup frozen mango chunks, 1 jar PC mango coconut sauce, rice. Simmer sauce and mango chunks, then add salmon fillets and cook for 10 minutes. Flip halfway through. Makes 4 portions. YUM 🥭https://t.co/YGWlAHBGw7 https://t.co/t0nKm2xQIE"], ["mango coconut sauce", 199795014, "@CallunaPetra Patak's GF Pasanda Cooking Sauce (coconut and peanut). Not their best flavour, but not bad nonetheless. Served it with rice, yogourt, and Patak's GF Mango Indian Style Pickle, which is delicious. I made it with boneless chicken breasts, onion and mushrooms. Saved a bundle."], ["mango coconut sauce", 1005281078779830272, "Frank's Red Hot Sauce, Made in Nature Organic Dried Mangoes, La Croix Sparkling Water Passionfruit/Mango/Coconut, Weider Red Yeast Rice Plus 600 mg"], ["mango coconut sauce", 197647206, "Made coconut rice w sweet n spicy glazed fried tofu! Mango, cilantro and green onion n spicy garlic sauce LITERALLY ONE OF MY FAVORITE MEALS https://t.co/hMkN70WY6n"], ["mango coconut sauce", 20956191, "Turkish lunch today. Steak shawarma &amp; chicken kabob w/brown rice, Turkish salad, roasted corn, Turkish yogurt dip, and pickled beets, all drIzzled with  tahini sauce. Also, pineapple/coconut/mango drink. @ Mezeh… https://t.co/9CXNNylTPi"], ["mango coconut sauce", 23636243, "Feeling the winter doldrums today. Needed to make a tropical pantry margarita to brighten up this gray day. Frozen mango, coconut water, lime, Patron sliver, some green hot sauce and a coriander salted rim. Not too shabby. https://t.co/C9okgSnqje"], ["mango coconut sauce", 4725000380, "NEW This week: Grilled Tuna coconut curry sauce mango salsa. 😁come and try it. https://t.co/vfUGVpGKda"], ["mango coconut sauce", 865643028916060160, "Foodies in Bangkok - continued! \nGrilled river prawn served with plum sauce, Sticky rice mango served in young coconut milk! #bangkok #cuisine #thailand #thaicuisine #food #foodie #yum #lunch #delicious #drlu https://t.co/Pnixxv997s"]]