[["masala papad", 73199121, "RT @rasmallaii: - talk to women who are going through these situations. giving them emotional support is far more important than gaining li…"], ["masala papad", 73199121, "RT @rasmallaii: a guide for men who want to be allies to women:\n\n- listen to women first. no matter how smart and logical your takes are, y…"], ["masala papad", 73199121, "RT @desimojito: This day last year, I was not single 😭😭"], ["masala papad", 73199121, "RT @desimojito: Single Indians : We don’t believe in Valentine, it’s not our culture"], ["masala papad", 73199121, "RT @porcoofine: Men who feel superiority in dragging a sexual harasser, takes pride in it because maybe he thinks the women are all damsels…"], ["masala papad", 1225179797640241154, "Lightly washed okra slices served with slightly braised moong masala papad. Aloo slice bhi."], ["masala papad", 73199121, "RT @Buttandbutter: Men here are trash, I kid you not. Unless you've really met them or know them or trust your gut about a particular perso…"], ["masala papad", 73199121, "RT @GaindaSwamy: BJP is strong on Twitter\nAAP is strong on Facebook\nCongress is strong on Orkut 😭"], ["masala papad", 73199121, "RT @sagarcasm: Donald Trump is coming to Ahmedabad, so the event is called 'Kem Chho Trump'\n\nIf he were to come to Mumbai, the event would…"], ["masala papad", 73199121, "RT @HaramiParindey: Now that Arvind Kejriwal is in power, he should take some steps to control the Tik Tok crowd at Connaught Place and oth…"], ["masala papad", 73199121, "RT @chutriya: @ ladies, please don't try to be polite when dealing with men who are making you uncomfortable because no matter how the situ…"], ["masala papad", 73199121, "RT @porcoofine: Men on twitter should understand that they are interacting w literal strangers here. You cannot make the same jokes w a str…"], ["masala papad", 1225179797640241154, "Abysmally burnt broccoli pieces poured over abysmally roasted moong masala papad. Extra garlic."], ["masala papad", 1225179797640241154, "Abysmally sauteed cabbage chunks sprinkled on mildly fried bread masala papad. Sambar upar se."], ["masala papad", 1186501796417564672, "@sonofadish learning from @adar5hh's some post here I tried this on Bumble. \nshe: I love Masala Papad (cause I had MP written in my profile)\nme: I love you (thought it'd be humour)\niPhone: Bumble notification from her\n\nby the time I could see the conversation, I was unmatched already 😂"], ["masala papad", 73199121, "RT @whosthatmiss: Hate never deserves respect.\nDignity does."], ["masala papad", 73199121, "RT @BollywoodGandu: Delhi voters to Congress https://t.co/7LHBAvC3IZ"], ["masala papad", 73199121, "RT @ImtiazMadmood: Muslims are united for their religion.\n\nHindus are united for 'free bijli pani'."], ["masala papad", 73199121, "RT @DoctorrSays: Who did this 🤣🤣👌 https://t.co/3VJu6o0GYl"], ["masala papad", 73199121, "RT @sapunintended: kalkaji, hari nagar and patparganj are cherries on top of the delicious 62-8 cake"], ["masala papad", 73199121, "RT @DoctorrSays: Then : 'C O N G R E S S'\n\nNow : C '0' N G R E S S \n\n#DelhiElections2020 #DelhiResults"], ["masala papad", 73199121, "RT @TheOtherDravid: Fucking dus bahane is being remade madarchod sharam hai ke nahi?!"], ["masala papad", 73199121, "RT @kunalkamra88: ...And also a loser of Delhi elections. \n\n😭😭😭"], ["masala papad", 1225179797640241154, "Abysmally roasted onion slices served with thoroughly washed tuvar masala papad. Aloo slice bhi."], ["masala papad", 1225179797640241154, "Lightly stir-fried cabbage slices to garnish over mildly roasted tofu masala papad. Extra onion."], ["masala papad", 73199121, "RT @UnSubtleDesi: The validation of ideological butterflies doesn’t matter to me. Never has. Never will. Get over yourselves."], ["masala papad", 73199121, "Sending #Mardaani2 DVDs and band-aid for free to those who still believe in patriarchy  and male chauvinism.\n\nLove u shivani roy!!!! https://t.co/iffH7dtXpd"], ["masala papad", 1225179797640241154, "Roughly fried peas slices plated with ruthlessly tossed rice masala papad. Malai maar ke."], ["masala papad", 73199121, "RT @desimojito: Good defeat for BJP. Will help them prepare well for Bengal, Bihar and Assam.\n\nDelhi unit need to introspect, you can’t win…"], ["masala papad", 73199121, "RT @The_Sarcashmiri: CAN A 19 MONTH OLD GIRL BE SHOT IN THE FUCKING EYES WITH PELLETS???"], ["masala papad", 73199121, "RT @moronhumor: Change your name to “Elections Expert Kanaji”"], ["masala papad", 73199121, "RT @prayag_sonar: Linkedin: someone visited your profile.\n\nme: who? \n\nLinkedin: https://t.co/2gWMGwZqyh"], ["masala papad", 73199121, "RT @faizan0008: Attack on JNU\n\nkejriwal we condemn this Attack \n\nAttack Gargi college \n\nKejriwal we will not accept this attack on students…"], ["masala papad", 73199121, "RT @sumitdahiya2791: My brother is travelling from Delhi to Mumbai. 5 Muslims passengers beaten my brother who is alone and they are giving…"], ["masala papad", 73199121, "RT @BedardiBaalma: Mmm accidentally pulled earphones off from mobile and Ishq tera tadpave started playing on full volume in bus 🥰🥰🥰"], ["masala papad", 1225179797640241154, "Abysmally washed aubergine pieces under overly tossed rajma masala papad. Extra onion."], ["masala papad", 1225179797640241154, "Thoroughly sauteed okra chunks to garnish over ruthlessly washed potato masala papad. Tel zyada hogaya."]]