[["mint chutney", 731662078512119808, "curried deep-fried Texas Pete in a waffle cone dripping with butter and mint chutney"], ["mint chutney", 1132887315880263680, "@Leyla_Amar https://t.co/fuApAKIbIW\n\n+ Tassajara bread (w/o dry milk, made with white whole wheat flour... we'll see how the wee babe turns out!)\n\n+ strawberries &amp; gooseberries &amp; blackberries &amp; figs! (and chocolate)\n\nThe SW self-care is so real."], ["mint chutney", 3418827802, "@countryrangeuk Bombay Pani puri Chaat. Crispy semolina balls filled with date chutney, coriander and mint water, spicy mashed potato, boiled moong beans and yellow peas. Sweet and spicy, a burst in your mouth flavour dish. https://t.co/gdOFqM9rD1"], ["mint chutney", 775390638548226048, "@suru_uwu the mint chutney with yogurt (it's not a form of raita??)"], ["mint chutney", 4415765687, "How about a plate of Mixed Vegetable #Pakoras to start? Crisp, deep fried fritters of spinach, potato &amp; onions served with mint &amp; coriander chutney. https://t.co/KayQPuXEKw"], ["mint chutney", 81831408, "RT @BurgerBubbles: Black Brioche Bun, Tandoori Spiced Lamb or Chicken, Cucumber and Mint, Homemade Mango Chutney, topped with a freshly coo…"], ["mint chutney", 62713956, "https://t.co/NjzOTQjkCa Vegetable Samosas with Mint Cilantro Chutney Recipe"], ["mint chutney", 18186050, "Coriander &amp; Mint Green Chutney\nhttps://t.co/1qF4Lai93Z #food #ChutneyRecipes #mint"], ["mint chutney", 225135810, "Carrot Pancakes w/ Orange &amp; Avocado Mint Chutney"], ["mint chutney", 3180578917, "@DanceEatRepeat That's tomato Chutney with mint leaves."], ["mint chutney", 1120736291736317958, "@S_Madridista5 will try it. Also, coconut samosas (not aloo) are amazing as well. tastes bomb with mint chutney."], ["mint chutney", 890153875247910912, "Black Brioche Bun, Tandoori Spiced Lamb or Chicken, Cucumber and Mint, Homemade Mango Chutney, topped with a freshly cooked Poppadom. 😍\n\nLike if this sounds like heaven to you? 👍 https://t.co/IFaXzefqx1"], ["mint chutney", 990888636433534976, "Chick-chick-chickpea #chaat - Atcha style. Converting the chickpea haters since ‘19. Black beans, red peppers, mango, mint, pomegranate, tamarind chutney, chaat masala and shakarkandi (sweet potato). Premier league… https://t.co/KKqblEkeU9"], ["mint chutney", 239287214, "Chicken Tikka Skewers On A Black Plate With Mint Chutney Stock Image - Image of mint, cuisine: 165550649 https://t.co/iX4E51iFnJ https://t.co/LKTDPI4gkO"], ["mint chutney", 854456955062169603, "Spicy Mint Chutney https://t.co/7G5j19Tj8z https://t.co/7Lr8KPnSTj"], ["mint chutney", 1149704384755974145, "years-long mutual pining is My Ultimate Jam. it is the spiced mango chutney of my fannish existence. the ginger and tomato relish. the mint jelly to the lamb I no longer eat. https://t.co/XL8cb1M2qq"], ["mint chutney", 38798206, "@Dastaannn @NanoJuriste I got you with the walnut chutney recipe! I like it a tad spicy : green chilly, fresh mint, salt, red pepper (a pinch) + generous amount of walnuts. Throw them all in a grinder with few teaspoons of water to help it become paste. You can eat it like this or mix w/ thick yogurt!"], ["mint chutney", 83893850, "CALLING ALL HAPPY HOUR LOVERS! 📢 Try our new Samosa Arancini: Crispy Curried Risotto &amp; Vegetable Balls, Harissa Yogurt, Cilantro Mint Chutney #happyhour 📸 @tkimedia https://t.co/GONpDigto5"], ["mint chutney", 54513197, "A crisp tight white shirt and a pita stuffed to the bursting with greens and chicken, and mint-cilantro chutney, WHAT COULD GO WRONG? \n\nActually, nothing. I ate it just fine. No spilling, dribbling etc."], ["mint chutney", 832654375856205824, "From keeping the breath fresh for long to improving digestion, mint is packed with lots of benefits that make it quite just a chutney, mocktail, or raita ingredient. Here are some mint benefits https://t.co/9bMlRwrOaY\n#mint #mintleaves #mintleavesbenefits #HealthySkin https://t.co/t72n7HK8nT"], ["mint chutney", 895038149688258561, "A stunning photo from wilbo.eats!!\n\nCrispy spinach leaves with potatoes, yoghurt, tamarind and mint chutney. 🤤\n\nBookings&gt;&gt; https://t.co/FaPMdCBnrq https://t.co/gGPoq7VoC6"], ["mint chutney", 2493808735, "Chickpea cake, beetroot pearl, tamarind and mint chutney by 2 Michelin @chefatulkochhar who routinely blows my mind with his inventive fare 🙌\n\n#indianfood #londonfoodscene #mayfair #indianfoodie… https://t.co/uLZmjfKqOH"], ["mint chutney", 1662256934, "I’m basically living in the future. I’m calling this the ‘Bahji Banger Wrap’.\n\nMango chutney base layer🥭 \nFresh diced baby gem lettuce 🥬 \nCucumber 🥒 \nRed onion 🧅 \nOnion bahji’s \nMint yoghurt\n\nAbsolutely next level. 10/10. Gutted Jamie m8. https://t.co/ZhZbQyM8Gj"], ["mint chutney", 62713956, "https://t.co/NjzOTQ1JKC Vegetable Samosas with Mint Cilantro Chutney Recipe"], ["mint chutney", 931641598366150656, "RT @vegrecipeindia: This Mint Chutney Recipe is easy, quick and takes less than 15 minutes to make. The recipe post shares 2 ways of making…"], ["mint chutney", 1108142920522035202, "RT @vegrecipeindia: This Mint Chutney Recipe is easy, quick and takes less than 15 minutes to make. The recipe post shares 2 ways of making…"], ["mint chutney", 872937913, "@HKA_2017 @Sangeet08824130 @sftmumbai True. But something about mint and cilantro chutney amma makes with coconut. Aha. \nBut at my best friend’s house (Telugu living in Chennai) I have had whole dinner of nothing but variety of Podi/ chutney / rice and yogurt."], ["mint chutney", 872937913, "@HKA_2017 @Sangeet08824130 @sftmumbai 👍🏼👍🏼Gongura chutney is tasty but I always preferred Tamizh style mint thogayal (not the mind you get in chat places)"], ["mint chutney", 549438560, "we did it, kids!! swordfish w a tomato mint chutney + quinoa salad https://t.co/v16M5al0AJ"], ["mint chutney", 934845015137939456, "got this spinach apple mint juice for lunch and it tastes like chutney 🙂"], ["mint chutney", 1142768954231754752, "https://t.co/1ZVqX1lZVD\n\nIn this Video we will show you how to Prepare Mixed Green chutney ( Mixture of Mint, Coriander, Curry Leaves .This is easy &amp; very tasty recipe and cooking time of this recipe is very less. \n\nKindly do try this recipe at home &amp; share your feedback's https://t.co/RQF41oZEDB"], ["mint chutney", 16790482, "@saliltripathi :-)  till you top-up a bit of garam masala and coriander - how is the subzi complete without it. Not to mention - Coriander chutney is the king of chutneys - beats Mint everyday!"], ["mint chutney", 1189405851750223872, "Helloooo haloumi! Seduce your tastebuds with our sesame-crusted haloumi with mint and tomato chutney. Cheeeese, it's blerrie delicious!\nView our menu here: https://t.co/jY7lQYt1FT\n#LockStockBeer #LSB https://t.co/nm3ODtEJB2"], ["mint chutney", 926422852789833729, "@LeicesterCurry You just cannot beat a good amritsari Fish pakoras with a mint chutney."], ["mint chutney", 148386845, "Build-your-own meals from the likes of corn chaat, brown berry rice, mint chicken, tomato &amp; date chutney and tomato masala meatballs at new grab &amp; go spot Tamarind Tiger https://t.co/JT1fclTqRL https://t.co/7G5kAKEKqx"], ["mint chutney", 254695129, "RT @Clawfeet3: Made this last night for the family @jamieoliver it was immense!!!!! No pics as we scoffed the lot!!! Serves it with coconut…"], ["mint chutney", 248351898, "#streetfood #jugaads - Trust me to turn #celeryjuice into a lip smacking ingredient essential to the beloved #mumbaistreetfood #panipuri . When the craving struck, I had no cilantro and mint chutney water on hand,… https://t.co/lNHnqNAruM"], ["mint chutney", 16352751, "god its the fucking best I just had a pile of fattoush salad + braised beef + lentil kofta + garlic cheese + mint chutney + pickled radishes (maybe????) + baba ghanoush + hummus + pita AND a mint lemonade\n\ni need six naps"], ["mint chutney", 766286160, "@TamMannKler @revjoeybside I am incredibly excited to be asked this.\nStarter: chicken pakoras with all the sauces\nMain: lamb rogan Josh, mushroom rice\nSides: onion bhajis, poppadoms with mango chutney, mint onions and spicy red sauce, saag aloo if we’re feeling fancy.\nDrink: we’re having a ruby so lager🍻"], ["mint chutney", 239287214, "Chicken Tikka Skewers On A Black Plate With Mint Chutney Stock Image - Image of mint, cuisine: 165550649 https://t.co/iX4E51iFnJ https://t.co/NCzhOYfI3o"], ["mint chutney", 49378584, "@nuts2406 One is coconut chutney and the other is mint chutney!"], ["mint chutney", 14217242, "@Lubchansky Any idea where to get mint chutney in the city? Never found it since I moved here"], ["mint chutney", 1208473287203999750, "@HanxFingers @stephlynn1982 I'm going to have samosas &amp; mint chilli chutney when he crashes..."], ["mint chutney", 1177310629767634944, "Made this last night for the family @jamieoliver it was immense!!!!! No pics as we scoffed the lot!!! Serves it with coconut rice, naan, red onion chutney and mint raita.  😍😍😍 https://t.co/hAaHNWUnXv"], ["mint chutney", 239362370, "@GirishNaught @RantingDosa To make sure shes eating all those juicy kebabs with mint chutney."], ["mint chutney", 62713956, "https://t.co/NjzOTQ1JKC Vegetable Samosas with Mint Cilantro Chutney Recipe"], ["mint chutney", 385050641, "Beef curry from @Rick_Stein India book, apple chutney, mint coriander yogurt. And #chefnezzy lemon tart https://t.co/jn3LWXoczO"], ["mint chutney", 1037175646605271040, "i made my mint chutney too spicy, my ass is going to feel like satan is personally fingering my asshole"], ["mint chutney", 3232596552, "As we join with greenmarketsantacruz to celebrate love on 15 Feb 2020 we’ll be having a limited free sampling of green seasoning and mint chutney made straight from our founder’s garden and bottled in sterilized… https://t.co/N9flQmvQXO"], ["mint chutney", 906738613941100545, "@Lambda_Merc Hi there! I'm gonna have to disagree, mint chutney is thicker and green, maybe you were thinking of sweet chutney (contains dates) or tamarind chutney? Raita is yogurt based, but I'd expect to see finely diced onions/tomatoes/cucumber in it if it was so. Still, thanks for (1/2)"], ["mint chutney", 294149115, "@Emmafromthe90s Poppadoms man. Bit of onion , chutney , mint sauce , lime pickle .Hows that even a debate"], ["mint chutney", 762094372795981825, "@fionapup I’m not native to India but I do love their cuisine! The darker one I believe is mint chutney, and the yogurt one I believe is called Raita, both sauces typically used for dipping with sides such as naan, papadum, and samosas. Hope that helps!"], ["mint chutney", 166541520, "RT @Marie_Louise_O: Indian “tapas” tonight 🤩🥰 Chicken and coriander samosas, chicken tandoori skewers, pork curry with ginger and turmeric,…"], ["mint chutney", 885056796, "Indian “tapas” tonight 🤩🥰 Chicken and coriander samosas, chicken tandoori skewers, pork curry with ginger and turmeric, garlic and coriander naans, poppadoms, mint raita and mango chutney ⭐️ @greenkeeper1 #homemade https://t.co/F4ZH9DKL1V"], ["mint chutney", 3300967840, "RT @MomoRestaurant: Comeragh lamb terrine, apple chutney, apple gel, mint &amp; rosemary oil, walnut #starter #dinner #dinnertime #comeraghlamb…"], ["mint chutney", 2925612915, "Comeragh lamb terrine, apple chutney, apple gel, mint &amp; rosemary oil, walnut #starter #dinner #dinnertime #comeraghlamb #comeraghmountains #waterfordway #lamb #terrine #comfortfood #casualdining #waterford @ Momo https://t.co/mNklEl8dYe"], ["mint chutney", 1178334206360870912, "@w_karve @rons1212 @SatishBahri @aparna326 @DeeptaNagpal @wordsmithkaur @monocularshark @gauripokhariyal Isn't that gulab jamun a bit closer to the mint chutney?"], ["mint chutney", 1093403616235438081, "@Nay__t @KakarWithOneK Imagine how beautiful it must be sitting in the veranda during rain and having channa chaat and pakiras with mint chutney ! Or coffee at night reading suspence novels! I love such spaces , we have patio without ceiling !"], ["mint chutney", 995722398493302785, "how to make mint chutney in tamil https://t.co/pMzKf0TYzW #trawod"], ["mint chutney", 1209532952415072256, "@Kaalateetham Once in Ludhiana my chicken burger had mint chutney &amp; here in BANGALORE, I was given garlic fried rice with curry leaves. Extreme examples of regional modification of exotic foods!"], ["mint chutney", 768714304967155712, "A very easy yet most essential part of Indian cooking. Be it main, starters or snacks, everything is incomplete without some mint-coriander chutney on the side. \n\nIt makes meals specially Dal Chawal taste even more… https://t.co/oaLL6gn42a"], ["mint chutney", 893910353280737280, "Green chutney and sweet chutney for chaat\n\nMint and coriander chutney\nDates tamarind chutney \n\nTwo easy recipes can make in few mins\n\nRecipe link:\n\nhttps://t.co/a5JsScL15M"], ["mint chutney", 2568138042, "@Nvania @JoeySalads @BrandyZadrozny 😉 I was showing how words can be misinterpreted. Since all people will eventually die whether you eat carrots or not. Just a bit of wordsmith for fun. But to exchange recipes have you tried mixing mint chutney and sweet cream butter and spreading it on fresh grilled corn. 🤔😬🎉"], ["mint chutney", 782143282914537473, "@Braddock512 @sellswordyt @stubbsbbqsauce We couldn’t agree more! Mint chutney is perfect side - kick to every Indian dish.🙂"], ["mint chutney", 1144247974735831042, "Samosa Chat one of the popular street food in India. We provide with chickpeas, sweet yogurt, and mint and tamarind chutney.\nCall us--01252 628889\nhttps://t.co/2bs1aRbOBy\n#food #delicious #recipes #Cooking #foodie https://t.co/6UaGvR2UUv"], ["mint chutney", 915178030426816512, "Planning your evening party menu? Get your snacks department sorted with delicious Hara Bhara Veg Kebab. Pair this perfect snack with Mint chutney and get ready to delight your guests. #FridayFeeling https://t.co/6DAHjCKYnz"], ["mint chutney", 3249785822, "Planning your evening party menu? Get your snacks department sorted with delicious Hara Bhara Veg Kebab. Pair this perfect snack with Mint chutney and get ready to delight your guests. #FridayFeeling https://t.co/ABeOdRGVrO"], ["mint chutney", 62713956, "https://t.co/NjzOTQjkCa Vegetable Samosas with Mint Cilantro Chutney Recipe"], ["mint chutney", 549865890, "The last time I went from Australia to Amritsar, I was expecting good Punjabi food.But, none of the restaurants I ate at served raita, mint chutney, lal imli chutney, or piping hot samosas. \nThey all served sub-standard mayonaise, french fries &amp; sandwiches, I was sick of eating!"], ["mint chutney", 16259997, "RT @HMShostYYZ: Spice up your travel plans with a home-made Samosa with mint chutney and tamarind date sauce at @TWISTRestaurant @RogerMook…"], ["mint chutney", 549670195, "Spice up your travel plans with a home-made Samosa with mint chutney and tamarind date sauce at @TWISTRestaurant @RogerMooking #T1 #YYZ"], ["mint chutney", 947065060223959040, "@jackandtaylor Mine is indian but fries with mint chutney"], ["mint chutney", 293465993, "Lunch special at the #foodworks today is Lamb Potato &amp; Green Lentil Curry\nServed with Rice &amp; Mint Chutney. Sounds and smells amazing!"], ["mint chutney", 118389928, "@SG_ShiningStar @shreyaghoshal I think so. It seems fluffy like aaloo ka paartha.. Oops paartha.. Sigh. Paratha with mint chutney 😩 wat combination iis this."], ["mint chutney", 363716595, "Missing Royal Orchid's breakfast with its heavenly green mint chutney. Also the free Lassi drinks i can never get enough of. https://t.co/4ljAmmxc9l"], ["mint chutney", 325671597, "So far so good. My cilantro mint chutney came out amazing."]]