[["mushroom burgers", 485739616, "Cooking for my baby @AuxCasts - Portobello mushroom bun burgers with spiced sweet potato fries. https://t.co/3MTuOD6x5G"], ["mushroom burgers", 115221968, "Craving comfort food? Yeah, me too! Try this easy recipe for Chopped Steak &amp; Mushroom Gravy. HINT&gt;this same recipe makes good burgers and freezes well too. #TuesdayTip  https://t.co/EjBiLE0scP https://t.co/qrC2KgoDrB"], ["mushroom burgers", 28522275, "Gave the Bon Appetit lentil and mushroom burgers a try and they're so good! The patties have lentils, garlic mushrooms, and some miso paste to boost the savoury notes. They go super crispy in the pan as well,… https://t.co/brjtFv6tBk"], ["mushroom burgers", 1421654582, "My man SNAPPED with dinner tonight 😭 swiss mushroom burgers and home made fries"], ["mushroom burgers", 915569228, "@anshelsag @NexusBen @pcamp96 Tbh I think Carl's Jr is way better (their mushroom swiss fuuuucks) but I think In-N-Out sits on about the same level as everything else. Woke answer is that they're *all* bad burgers, our standards are just low for fast food 😂"], ["mushroom burgers", 197347902, "@Gator_RoRo The mushroom is an awesome idea! I've had burgers with portabella buns, idk why I didn't think of a pizza the same way"], ["mushroom burgers", 2400670616, "i made black bean and mushroom burgers with pan seared garlic n tumeric cauliflower"], ["mushroom burgers", 18244350, "Portobello mushroom burgers with sweet potato fries #amcooking #vegetarian"], ["mushroom burgers", 1135592176526790659, "Rainy Mondays with Mushroom Burgers &amp; Potato Leek Soup  https://t.co/JgKnQ1mdP3"], ["mushroom burgers", 394016758, "To have, and to hold, and to each order one of your own! 🍔 Enjoy our His &amp; Hers Burger, with Chocolate Demi, Mushroom, Onion, Swiss, and Cajun Fries this week at The League. Get two Burgers for the Price of One Every Monday! Dine-in only. https://t.co/R240lywRyG"], ["mushroom burgers", 1189506521731883009, "Why not enjoy #MeatFreeMonday with this Rice Burger recipe with Sweet Potato and Mushroom! https://t.co/zB90LU1MWW https://t.co/2sKZpkjiie"], ["mushroom burgers", 2269466082, "RT @rustybicycle: Five pound burgers getting us through Monday once again 😍🍔🙌 Get the classic Dodo or the veggie Mushroom Man for just a fi…"], ["mushroom burgers", 23803817, "Five pound burgers getting us through Monday once again 😍🍔🙌 Get the classic Dodo or the veggie Mushroom Man for just a fiver today - head to https://t.co/H4fm2tH5Qb to check out our other deals!! \n#LetsTalkAboutBurgers #burgermonday #oxford #oxfordshire #foodporn https://t.co/1mSRWtGtPV"], ["mushroom burgers", 154771332, "Griddled burgers with mushroom/garlic/truffle pesto  and potato salad\n#burger #hamburger #pesto #truffle #foodporn https://t.co/Vb6N994Z0F"], ["mushroom burgers", 2402477438, "If these are not one of the best turkey burgers you have ever made in your own kitchen, it's you, not them... lol! \n\nTuscan Turkey Burger Sliders Using #BLENDABELLA Mushroom Blend\nhttps://t.co/XZB2IvLoEt https://t.co/nq6m0Z8UNc"], ["mushroom burgers", 705305756078190592, "@ImStillJohnny I’m making burgers with bourbon sautéed mushroom and onions tomorrow https://t.co/JiVCuxRxr7"], ["mushroom burgers", 326357603, "3 Mushroom Swiss burgers from Sizzlin Grill and a new MacBook https://t.co/xYoJZY4LqF"], ["mushroom burgers", 16001574, "Non-BOP news, we tried Royale Burgers last night. The burger itself was good! The space is definitely not my jam, and it’s weird they have only high stools and not to consider people need places for jackets in winter or their purses. But I recommend the mushroom raclette burger https://t.co/tFrDC2w2sG"], ["mushroom burgers", 903217980896628736, "The carnage that is me making mushroom lentil burgers...\nTotally worth it in the end*\n\n*Even after the 5 days of finding bread crumbs/walnuts everywhere... https://t.co/PpFloeGfuW"], ["mushroom burgers", 41122478, "@cindynorth1 Yes! Also, their mushroom-Swiss burgers were heaven. Also, curly fries.\n\nNow I’m really jonesing..."], ["mushroom burgers", 1201938417891860480, "The perfect Sunday lunch, Mushroom &amp; Swiss burger and Wedges. 🍄🍔🍟🧀\n\nCall for Delivery 76-371-862\nOrder Online on Zomato\n\nhttps://t.co/jHJecqnlbh\n\n#BurgerExperiment #Burgers #Food #Foodie #BurgerShot #FoodShot #Saida #LebanonEats #LebanonFood #StreetFood #FoodTruck #Lebanon https://t.co/yw3vzRryfS"], ["mushroom burgers", 1030589247856762880, "Tbh I’ve wanted to try theirs tho bc i love mushroom burgers:( except that shitty one that tasted like a brick was like a hemp one"], ["mushroom burgers", 766452357710438405, "I’ve been cooking for like the last nine hours no joke. Literally made creamed spinach, chinese broccoli, kung pao brussels sprouts, red cabbage soup, mushroom stroganoff, black bean burgers."], ["mushroom burgers", 33420125, "@AmandaBlind1 Then I am going to have to lay off of those Mushroom &amp; Swiss burgers, because those shrooms are messing up my consciousness! Lol- I could have sworn it was you! Lol"]]