[["mustard fish", 14710235, "RT @sonyasupposedly: I agree, canned fish is awesome. Go get you some smoked oysters and sardines in mustard!!! https://t.co/XZMFH7yLqT h/t…"], ["mustard fish", 1247464470, "I agree, canned fish is awesome. Go get you some smoked oysters and sardines in mustard!!! https://t.co/XZMFH7yLqT h/t @greggawatt"], ["mustard fish", 260864990, "@MasterMorgan317 And here's my work fish, Col. Charles H. Mustard https://t.co/0cAXbZswis"], ["mustard fish", 1118223640372363264, "@Jinx_In_Boots Tucker\nChance\nYellow \nCasper\nMustard\nSushi\nStain\nSmidge\nFish"], ["mustard fish", 1117718791499198464, "But, wondered whether it could be an open circle; a circle with a gap in it and other stones arriving. In addition to the mustard seed and shoal of fish designs, I was also making these designs. \n\n#graphic #design #gathering #christian #community #church #logo https://t.co/X0IPI982VC"], ["mustard fish", 1226018612932038661, "Mustard fish curry - How to prepare Mustard Fish Curry Recepie - fish curry in hindi, breaking news in hindi\n\nThis dies is very tasty and easy to make.\n\nhttps://t.co/ojcZcCQUHO\n\n#fishcurry #tastyfood #nonveg #tastydies #FishEveryDay #fish https://t.co/tKdffkPxlE"], ["mustard fish", 899078990702325761, "Village Food | Choto Macher Shorisha Curry Recipe | Small Fish Mustard S... https://t.co/ieduZMVfl4 via @YouTube"], ["mustard fish", 2816601335, "@MrBMYoung No! Surströmming is from hell! It's fermented herring whereas this is fresh fish pickled in vinegar based sauce. It's a Finnish thing and most of us love it. My favorite is mustard herring. That with potatoes and rye bread... 🤤 https://t.co/tWhavRB42m"], ["mustard fish", 919218318522834944, "Parshe mach (mullet #fish) in coriander leaves - mustard paste #homemade #WeekendIsHere #bangaliranna @BengaliFoods_ @BengaliFoods https://t.co/lhxbfqRurX"], ["mustard fish", 1144752428795006976, "McDonald's and it's cus of the fish fillet and their honey mustard https://t.co/tgXHjYDDvp"], ["mustard fish", 248078528, "Fish nuggets and mayo-mustard dip for lunch... It's high-carb Saturday!!!\nGarlic rice not on pic... 😁😁😁 https://t.co/hV6qC4NA8T"], ["mustard fish", 1090335957964836864, "@squatphysio A piece of heaven to bengalis. Hilsa fish cooked in mustard seed paste, mustard oil salt and green chillies."], ["mustard fish", 1195137546818215937, "Yall eatin mustard wit fish??? \n\nWe not slaves nomore, beloved"], ["mustard fish", 1069743331, "Eat more squirrels, groundhogs, whitetail deer &amp; cottontail rabbits.\nSnakehead fish &amp; invasive crayfish as well. Garnish with garlic mustard &amp; wineberries!\nIt’s a sustainable feast!\n@SierraClub https://t.co/8JYu7qHaq6"], ["mustard fish", 341937178, "I hate when I could taste the mustard in my fish😒"], ["mustard fish", 1091364810804129792, "@hero_ofthenight Instead of mayo or miracle whip, try Dijon mustard in your tuna fish"], ["mustard fish", 226092247, "@jthayne_91 @jazzwithtaz Mustard\nBBQ Sauce\nPete's hot sauce\nMalt Vinegar for fish and chips."], ["mustard fish", 1321596145, "RT @LittleBit_Foxy: @hero_ofthenight McDonald's fish filet sandwich with French fries and honey (not honey mustard, actual honey) added on…"], ["mustard fish", 855904158, "@hero_ofthenight McDonald's fish filet sandwich with French fries and honey (not honey mustard, actual honey) added on it 🤤🤤🤤"], ["mustard fish", 32451484, "Dude I met talked up fish and mustard... swears by it b/ idk"], ["mustard fish", 1004128843442114560, "My brother real life jus put mustard in his tuna fish....MUSTARD!!!! I’m calling the police cause wtf 🤢🤮 https://t.co/KptQfzHRC5"], ["mustard fish", 1162039844715073536, "@Songbirdriah Tuna fish sandwiches and hotdogs with mustard sing Mariah Carey 👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾🙌🏽🙌🏽🙌🏽🌹🙌🏽🙌🏽🙌🏽🌹🙌🏽🌹🙌🏽🌹🙌🏽🌹🌹🙌🏽🌹🙌🏽🌹🙌🏽🌹🙌🏽🌹🙌🏽🙌🏽🌹🙌🏽🌹🙌🏽❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️🤗🤗🤗🤗🤗🤗🤗👸👸👸🌹🌹🌹🤗😍😘😘😘❤️❤️❤️❤️👏🏾🙌🏽👏🏾🙌🏽👏🏾"], ["mustard fish", 15753341, "@_sunshineCHI Fish supper"], ["mustard fish", 3320813391, "A selection of Bengali food: Cholar dal (lentils), Jhinga aloo posto (ridge gourd and potatoes cooked with poppy seeds), Bhapa Chingri (steamed prawns cooked with mustard) and Illish dimer bora (bhajs made with fish roe). \n\n#loveindianfood #lovecooking #bengalifood https://t.co/J9yk1UiBJU"], ["mustard fish", 1225108638, "Maruchan Instant Ramen with Clams, Baked Fish, and Mustard Greens I made. Also garnished with Parsley. https://t.co/1pA3wHhTQH"], ["mustard fish", 1717331575, "@Fish_Cooper Oh! And Clue.\n\n\"Colonel Mustard, please roll the die, make a suggestion, or use the secret passage\""], ["mustard fish", 1099524343095328768, "RT @RayesMustard: Valentine's Day is only 1 week away, so we’ve found a delicious Mustard-Roasted Fish recipe accompanied by Roasted Vegeta…"], ["mustard fish", 21494680, "Valentine's Day is only 1 week away, so we’ve found a delicious Mustard-Roasted Fish recipe accompanied by Roasted Vegetables and followed by an impressive Coeur à la Crème with Raspberries for dessert: https://t.co/p313P0OzaL #ValentinesDayDinner #CookingWithMustard #Dijon https://t.co/9FDNTLRl42"], ["mustard fish", 793452694694264834, "Looks like 酸菜鱼，Fish with Pickled Mustard Greens"], ["mustard fish", 562815784, "RT @BellyThaGod: I don’t trust u if u don’t put mustard &amp; hot sauce on ya fish.... #KentuckyBoy"], ["mustard fish", 1218782392871243776, "I don’t trust u if u don’t put mustard &amp; hot sauce on ya fish.... #KentuckyBoy"], ["mustard fish", 2871718731, "@epinephhrine It's pretty common to just roast fish with an astringent lemon-mustard sauce. \n\nNot my favorite though because mustard might be my least favorite food period, and I think it gives me a very minor allergic reaction since it makes my mouth tingle"], ["mustard fish", 2871718731, "@epinephhrine it sounds romantic but i'm calling you a fish with mustard sauce"], ["mustard fish", 846037903604092929, "I’m craving some good fried fish with hot sauce and mustard on some white bread with French fries and bake beans lol."], ["mustard fish", 207772769, "I never had mustard on my fish lemme see what the hype be about"], ["mustard fish", 2623511044, "Always back to basics ! Fish head !!! #mustard #fishcurry #traditional https://t.co/2Xfd813cqu"], ["mustard fish", 2459665594, "RT @purkisandsons: This Mackerel with mustard sauce recipe will make a delicious supper or lunch dish. The mustard sauce is a great combina…"], ["mustard fish", 387180347, "Warm roti and Tuna Vindaye... Vindaye is a classic pickle in Mauritius and traditionally a way to preserve the abundance of fish and seafood on the island, pickled with turmeric, garlic, chilli and mustard seeds the flavour of this vindaye will transport… https://t.co/oaR34ZDUow https://t.co/7yUYGYSUn4"], ["mustard fish", 4169944828, "SPECIALS TODAY:\n拜拜鬼佬 sustainably farmed mango Korean sushi with jackfruit fish sauce $23\n九 Japanese curry powder butter chicken with mustard greens salt and pepper $30"], ["mustard fish", 123911660, "I’d tell you how stupid you are for not getting your dead 2 year old a policy\n\nTwo fish sandwiches please. With mustard https://t.co/EKlOqDz5jD"], ["mustard fish", 156893750, "Eatable pussy lips that's what i call em. Yeah if I was there I probably only eat rice and fish ain't no turkey sandwhiches wit mustard over there. https://t.co/XWG2T4zXQc"], ["mustard fish", 1045742416714715136, "RT @v65ify: So Happy #Tuesday everyone I hope you are having a superb day ☺I am having Salmon tonight I urge you to try this, after sautéin…"], ["mustard fish", 2183866157, "Betta Fish: Black Mustard wants you to know that he is very proud of his lawn\n\nhttps://t.co/d8Ltrw2Ak5\n \n. https://t.co/HEhm49g7PS"], ["mustard fish", 810053322, "RT @theyearofelan: 7. HORSERADISH. You don’t like horseradish? LEARN TO LIKE IT. You still don’t like it? MUSTARD. MINCED GARLIC. A LITTLE…"], ["mustard fish", 1129281572337643520, "RT @v65ify: So Happy #Tuesday everyone I hope you are having a superb day ☺I am having Salmon tonight I urge you to try this, after sautéin…"], ["mustard fish", 18438834, "Homemade Meal: Nordic-Style Salmon Platter with Baby Potatoes &amp; Green Beans in Champagne-Mustard Vinaigrette #nordic #salmon #fish #greenbeans #potatoes #tomatoes #champagne #mustard #parsley #vegetables… https://t.co/RtMyHVCW0N"], ["mustard fish", 4201587983, "RT @purkisandsons: This Mackerel with mustard sauce recipe will make a delicious supper or lunch dish. The mustard sauce is a great combina…"], ["mustard fish", 398592488, "This Mackerel with mustard sauce recipe will make a delicious supper or lunch dish. The mustard sauce is a great combination with the Mackerel  where the sharpness pairs well with the rich fish  https://t.co/diWCpk7uzo https://t.co/lsEj5zOxIF"], ["mustard fish", 710075970817007616, "RT @HurricanesDubai: There’s fish &amp; chips - and then there’s Hurricane’s brand new Seafood Do Mar. \n\nSucculent grilled cod fillets topped w…"], ["mustard fish", 1600439593, "RT @HurricanesDubai: There’s fish &amp; chips - and then there’s Hurricane’s brand new Seafood Do Mar. \n\nSucculent grilled cod fillets topped w…"], ["mustard fish", 928500347722747904, "There’s fish &amp; chips - and then there’s Hurricane’s brand new Seafood Do Mar. \n\nSucculent grilled cod fillets topped with our tangy shrimp &amp; mustard cheese sauce. Served with shoestring fries, chunky steakhouse fries, or sweet potato fries. Serious levels of yum! https://t.co/VMjmxoHM6i"], ["mustard fish", 17611642, "@amitmehra @FoodieBoozard @NDTVFood Sometimes .....\n\nJust love the Bongs preparation of Fish - Fried &amp; Curried with loads of Turmeric &amp; Mustard 🥰"], ["mustard fish", 1218761519711735808, "@shardula23 Sounds pretty nice actually. Definitely would wish to try as long as the meat is jhatka (does halal vs. Jhatka even apply to fish? Do muslims halal even fish?)\n\nImagine all that ilish oil and mustard suffusing the rice, egg and potatoes during the dum cooking."], ["mustard fish", 282934775, "@maziemobile Fish sandwiches. Usually two in a sitting. Fries and anything else are kind of extraneous, but I do miss the nuggets pretty bad (with the mustard sauce). Also will sometimes go the way of a QPwC."], ["mustard fish", 1032758631639511040, "@FranJiGi @paularandom_ fish an xips"], ["mustard fish", 2397712538, "Who is out here putting ketchup &amp;/or mustard on fried fish??? 😭 y’all oc"], ["mustard fish", 736402884, "@RedHoodedVig She remembers Damian's pizza party and all of his favourites she did for him once...but she did not remember liking mustard on pizza until now.\n\nPausing, she thought it over. \"Anything without fish on it. Mustard and cheese mostly. I can't put ice cream on it.\"\n\nSays everyone."], ["mustard fish", 908883936918495232, "Mild Roasted Pepper, Black Olive, Whole-fillet White Fish, Extra Sauce, topped with a drizzle of Mardi Gras Mustard"], ["mustard fish", 877050241547030529, "Got to see two of my favorite food allergy moms today ❤️ Sidney &amp; @LisaKammel !! Sidney has opened a brand new restaurant in Long Beach called Noble Bird Rotesserie which is completely free from: peanuts 🥜tree nuts🌰dairy🥛 fish🍣shellfish🍤 &amp; mustard! #foodallergies https://t.co/BZiRCFK8h9"], ["mustard fish", 1194403308888309762, "I got a tattoo at Fish Silver on Tavernackle DR. It's on my inner left groin and its of a ninja star. It's mustard yellow and red. I got it while I was crying."], ["mustard fish", 1129904588008677378, "@dreamsofskies Normal Frenchies mustard. Dijon is good too but that's really only for burger.  \n\nI don't like ketchup that much. Most things people use with ketchup I use with mustard. Fries, chicken nuggs, some fish, it's just a nice go to."], ["mustard fish", 164853820, "@kimmierawks @The_Neebles Those bands were my 90s/2000s along with Mighty Mighty Bosstones, Skank &amp; Pickle, Mustard Plug, Reel big Fish"]]