[["onion dipping sauce", 1222240109283557382, "Here’s a picture I took in January from the @outbackbowl. Yes. That’s a bloomin’ onion, complete with a dipping sauce cap. Love the body language of the #Auburn Tiger mascot, who has probably paid a hundred grand in tuition to share the stage with this risible creation. https://t.co/8zUSgUXRwh"], ["onion dipping sauce", 2685137565, "@sheLLbeLL_xo Try mixing equal parts Sweet Baby Rays hickory bbq sauce and mayo. Mmmmmm. Great as a dipping sauce for fries, onion rings, tots, etc"], ["onion dipping sauce", 1925046618, "RT @rich29uk: @ememess @RadioFreeTom I could eat nothing but Indian food for the rest of my life and be perfectly content \n\nPeople who thin…"], ["onion dipping sauce", 31477932, "@ImprobableJoe Though it did make for a good night--I made a board with five different dipping sauces for a thinly sliced NY strip I cooked in garlic butter and onion powder. Dip that bad boy in alfredo, or sharp cheddar sauce, and it's a very good meal."], ["onion dipping sauce", 495116095, "Question: What dipping sauce do you put on onion rings?"], ["onion dipping sauce", 467944887, "Raw vegan sushi with cauliflower rice (blend cauliflower with dates), cucumber, green onion and peppers. Dipping sauce: raw sunflower seeds, apple cider vinegar, cumin, paprika, onion powder, dates, dulse &amp; kelp… https://t.co/nRSPE68AVo"], ["onion dipping sauce", 2939825956, "@PascoSheriff No way a good old fashionHawaiian pizza with ham pineapple green pepper and onion on a garlic crust with garlic butter dipping sauce is the best...."], ["onion dipping sauce", 1055205090888425472, "from chan dipping chips in chocolate sauce, changbin eating haribo with rice and hot sauce and drinking chocolate milk with egg we now have minho eating half caramel half onion popcorn \nstray kids taste buds are weird af https://t.co/aU9cqBHOiw"], ["onion dipping sauce", 25906284, "@honeychild1229 Enoki and king oyster mushrooms, some kind of noodle, and watercress are my main go-to hot pot ingredients. For dipping sauce I love lots of chopped garlic, green onion, ponzu, chili oil, and sesame oil."]]