[["paneer jalfrezi", 737305918073929728, "RT @EatHolyCow: Treat your sweetheart this weekend!\nChoice of four BBQ chicken drumsticks with salad OR paneer jalfrezi.  Both options serv…"], ["paneer jalfrezi", 219415011, "RT @EatHolyCow: ❤ VALENTINE'S DINNER FOR TWO special all weekend!  \n\nYour choice of four (4) plump and tender BBQ chicken drumsticks with s…"], ["paneer jalfrezi", 219415011, "RT @EatHolyCow: Treat your sweetheart this weekend!\nChoice of four BBQ chicken drumsticks with salad OR paneer jalfrezi.  Both options serv…"], ["paneer jalfrezi", 737305918073929728, "Treat your sweetheart this weekend!\nChoice of four BBQ chicken drumsticks with salad OR paneer jalfrezi.  Both options served with biryani rice, 2 heart-shaped aloo tikki and 2 strawberry shakes. 29.99\n#Timmins #indianfood #Valentine #valentinesday2020 #northernontario https://t.co/jx2MFTZDtc"], ["paneer jalfrezi", 737305918073929728, "❤ VALENTINE'S DINNER FOR TWO special all weekend!  \n\nYour choice of four (4) plump and tender BBQ chicken drumsticks with salad OR vegetarian paneer jalfrezi.  Both options served with biryani rice, 2 heart shaped aloo tikki and 2 strawberry shakes.\n\n#timmins #ValentinesDay2020 https://t.co/7QdVbbQgzf"], ["paneer jalfrezi", 305190560, "@English_MrsC @Gwenelope Just make sure it’s very firm and dry it really well. I also recommend Rick Stein’s paneer jalfrezi or Meera Sodha’s paneer and mango skewers. Halloumi makes the best bacon substitute too 😋"], ["paneer jalfrezi", 78878485, "PANEER JALFREZI. Quick mid week dinner! Stir fried paneer with cumin, ginger, green peppers &amp; fresh coriander. Simple and much needed for a Wednesday night. Serve with chapattis and raita. Recipe on the App and on… https://t.co/hi1XzB9jtU"], ["paneer jalfrezi", 2315750990, "Back in SLU with two trucks today. \n\nTruck 1 is next to Whole Foods at Westlake and 9th\n\nTruck 2 is next to Amazon Apollo at 9th and Thomas\n\nSpecials are Spicy Chicken Masala, Mixed Veg, Paneer Jalfrezi and Lamb Curry\n\nOpen at 11am until 145pm"], ["paneer jalfrezi", 354309110, "RT @vegecravings: Mixed Veg Jalfrezi is a semi-dry curry made with a tangy colorful blend of stir fried mixed vegetables cooked in a thick…"], ["paneer jalfrezi", 708131600874090496, "Mixed Veg Jalfrezi is a semi-dry curry made with a tangy colorful blend of stir fried mixed vegetables cooked in a thick spicy tomato base.\nhttps://t.co/TAXH9hWiQJ\n\n#mixveg #jalfrezi #vegetarianrecipes #indianfood #paneer #vegetarian #vegan #vegecravings #indiancurry #healthyfood https://t.co/PNoJLBxOgL"], ["paneer jalfrezi", 919586825391431680, "@HAILRyzin Lamb vindaloo, shrimp jalfrezi, aloo gobi, sag paneer, pakora, onion bhaji, chapati, and a pint of Cheetah. Not that I’ve thought about this before. #LastSupper"]]