[["paneer tikka masala", 834417834855890944, "Don’t tell my pizza boyfriends but I’m totally cheating on them with the local Indian restaurant. I could eat paneer pakura &amp; samosas &amp; pakoras &amp; onion bhaji &amp; tikka masala &amp; naan for the rest of my life &amp; be forever happy (yes, I did in fact order all of that tonight bc YUM)"], ["paneer tikka masala", 2931911827, "@RayRebekka God I love Chicken Tikka Masala, extra spicy with a scoop of Palak Paneer, Lamb biryani, goat curry and soft pillowy Garlic Naan 😍😍😍"], ["paneer tikka masala", 3214689712, "The real way to someone's heart: paneer tikka masala. https://t.co/HpJFtWJoRn"], ["paneer tikka masala", 843046635387072512, "RT @Mananpanda: I had placed this order today with this restaurant named Gopala's Veg. Kitchen Andheri East for a Paneer Tikka Masala via s…"], ["paneer tikka masala", 117671207, "I had placed this order today with this restaurant named Gopala's Veg. Kitchen Andheri East for a Paneer Tikka Masala via swiggy ord no. 64740409283 while having the food I found a cockroach in the food which I added the pic I want people to stop ordering frm here @fssaiindia https://t.co/cKaIhCwQYI"], ["paneer tikka masala", 249689618, "(This tweet is brought to you by the paneer tikka masala I made last night and am enjoying right now)"], ["paneer tikka masala", 3023859261, "@teasri Chill bro. Their paneer tikka masala pizza is quite something. @dominos_india"], ["paneer tikka masala", 1187358282886856705, "RT @vegsoc: What's your favourite #veggie curry? https://t.co/csWNPFabCX https://t.co/v7QPD6JPsW"], ["paneer tikka masala", 19755623, "@hhariri Oh paneer is +1000. Must get you over to try my paneer tikka masala, if you can ever make it to ‘Merica."], ["paneer tikka masala", 36327072, "@Ak4nksha Ok leme suggest- Paneer tikka and Peanut Masala.If you waana thank me for this typical middle class chakhna mindset...hehe go ahead 😄"], ["paneer tikka masala", 1200704987837300736, "RT @RaoDhivaanesh: i don’t need a valentine date. just a company for biryani. ooff and with paneer butter masala and chicken tikka andddddd…"], ["paneer tikka masala", 4289138724, "RT @RaoDhivaanesh: i don’t need a valentine date. just a company for biryani. ooff and with paneer butter masala and chicken tikka andddddd…"], ["paneer tikka masala", 983727931615621126, "i don’t need a valentine date. just a company for biryani. ooff and with paneer butter masala and chicken tikka andddddddd mango lassi #Single #AF 😂"], ["paneer tikka masala", 956634926782148608, "@shaluagrawal217 😂😂 what an idea..will send it to my kids who always want paneer tikka masala."], ["paneer tikka masala", 860055886647222272, "RT @GovindashouM: Today’s Menu\nFeb 11, 2020 \n\nBasmati Rice\nBrown Rice\nDal Makhani\nBroccoli soup\nVegetable Korma\nStir-fry vegetables\nPaneer…"], ["paneer tikka masala", 140166838, "Current list of cravings to hit that spot:\n\n1) Jeera Masala Soda from the Bombay soda carts one afternoon\n2) Parle-G with Chai in cold or rainy morning or after 4pm\n3) Very very tasty Paneer Tikka for Lunch"], ["paneer tikka masala", 18244350, "paneer tikka masala by kid request because apparently I’m running a restaurant here #amcooking #vegetarian"], ["paneer tikka masala", 626448963, "#food Today I got myself a garlic naan pizza with tikka masala sauce and paneer, omnomnomnomnom https://t.co/VEGztcngrw"], ["paneer tikka masala", 711185013815922688, "RT @GovindashouM: Today’s Menu\nFeb 11, 2020 \n\nBasmati Rice\nBrown Rice\nDal Makhani\nBroccoli soup\nVegetable Korma\nStir-fry vegetables\nPaneer…"], ["paneer tikka masala", 1091364723835179008, "Today’s Menu\nFeb 11, 2020 \n\nBasmati Rice\nBrown Rice\nDal Makhani\nBroccoli soup\nVegetable Korma\nStir-fry vegetables\nPaneer Tikka Masala\nMacaroni and cheese\nSpinach Pakoras\nStrawberry Cake\nCustard Pudding https://t.co/M8V3oorwdb"], ["paneer tikka masala", 2873977884, "@ManiacJaneiac CW: food\n\nWhat are some of your favourite Indian food dishes (more than 1 is an  acceptable answer)? \n\nMine would be Vindaloo, Dal, paneer Tikka masala, samosa and butter masala+ plain and garlic naan. 😊"], ["paneer tikka masala", 960791123441496064, "@SaniaAhmad1111 I am sorry but I don't like street food and instead prefer Nawabi Paneer tikka masala made in my home by me."], ["paneer tikka masala", 1226469434, "@ronnie444222 Omg me too but it was paneer tikka masala"], ["paneer tikka masala", 2183241595, "RT @LadyTemix: Someone $end to me for postmates so I can buy a burger to dip in this paneer Tikka masala\nTonight has me stress smoking loll…"], ["paneer tikka masala", 1202452035863318529, "Someone $end to me for postmates so I can buy a burger to dip in this paneer Tikka masala\nTonight has me stress smoking lolll https://t.co/qYp21r0fu0"], ["paneer tikka masala", 695073094688444417, "@buthyqueeth Chileeee some chicken tikka masala and some Paneer naan!"], ["paneer tikka masala", 792376704, "@mariodc The only thing I know is noodles. I got to try and learn Pasta before u learn paneer tikka masala. And if u want a challenge, try to make Khichdi !!"], ["paneer tikka masala", 89968509, "@LeftoriumThe I would go for a good Indian curry over any of those. Chicken tikka masala, cucumber raitha, sag paneer side dish"], ["paneer tikka masala", 2218235989, "Remnants from today's lunch. We ordered in from Tandoori Oven. Garlic Naan, Paneer Naan, Sweet Naan, Chicken Tikka Masala, Rogan Josh and lots of Basmati Rice. It was all delicious, but that Sweet Naan really made the grade. https://t.co/YrqmSf8wHY"], ["paneer tikka masala", 946595893490470919, "Took the Goth King to an Indian cooking class 🥘☠️🖤 we learned how to make samosas, saag paneer, fish curry, chicken tikka masala &amp; rice, dirty chai martinis &amp; MANGO SORBET 🥭 @ Hipcooks Portland https://t.co/HcCYcMXgQW"], ["paneer tikka masala", 1217765641412841472, "RT @vegsoc: What's your favourite #veggie curry? https://t.co/csWNPFabCX https://t.co/v7QPD6JPsW"], ["paneer tikka masala", 4652889080, "Cooking tikka masala and palak paneer tonight, grocery shopping for everything now. Who wanna eat"], ["paneer tikka masala", 1150393745717653504, "RT @vegsoc: What's your favourite #veggie curry? https://t.co/csWNPFabCX https://t.co/v7QPD6JPsW"], ["paneer tikka masala", 432644683, "RT @vegsoc: What's your favourite #veggie curry? https://t.co/csWNPFabCX https://t.co/v7QPD6JPsW"], ["paneer tikka masala", 21190085, "What's your favourite #veggie curry? https://t.co/csWNPFabCX https://t.co/v7QPD6JPsW"], ["paneer tikka masala", 2819953645, "@hvgoenka Reply with pic if you order paneer masala tikka😂@hvgoenka"], ["paneer tikka masala", 878381254588203008, "RT @SavourStreet: Recipe for paneer tikka masala out on the site now. Go check it out!😃\n#recipes #tasty #foodie https://t.co/z9UmfwYjci"], ["paneer tikka masala", 2895285280, "@ebruenig Order a vegetable biryani and either a chicken tikka masala (if you are not vegetarian) or a paneer masala (if you are vegetarian), then mix them together and get all that creamy curry sauce mixed into the biryani. Eat with naan."], ["paneer tikka masala", 1008800386193469441, "@sumiandnoir @ebruenig North Indian: tandoori items -- baked in a clay oven (smoked flavor). Tandoori chicken, chicken (or paneer if veg) tikka masala are standards for a reason.\nInfo/Chinese: Gobi (cauliflower) Manchurian\nChaat (street food): Pani puri (ask the server to show you), pav bhaaji"], ["paneer tikka masala", 899614922149158912, "RT @miebacka: I took Dr Gupta to my new house he said I am always welcome in the evening to join his family eat chapati,  butter chicken, c…"], ["paneer tikka masala", 4411883302, "I took Dr Gupta to my new house he said I am always welcome in the evening to join his family eat chapati,  butter chicken, chicken Tikka masala, Rogan Josh,  all this Indian food way no dey  bellefull person. I am not forgetting Naan, palat paneer garlic soup etc"], ["paneer tikka masala", 30571771, "@WhatUpLeezus Oh yeah of course. One of my favorites. Paneer Tikka Masala me please"], ["paneer tikka masala", 2301592712, "Paneer Tikka Masala with Basmati rice. \n\nFirst time ever cooking with paneer (from @Wegmans ). It was a jar of tikka masala (from @AldiUSA )Simple dish! Came out great. #foodeatsfirst https://t.co/EoP2IjSrVD"], ["paneer tikka masala", 964338748707229696, "i got some rly spicy paneer tikka masala and b makin cuba libres i’m in heaven &lt;3"], ["paneer tikka masala", 964338748707229696, "@ericsspammm me w handle of bacardi after i pick up dis paneer tikka masala"]]