[["peanut rice", 1192700556420243456, "@YesAnzo Peanut butter and banana is the only combo that's the one.\nOh and rice cakes and peanut butter. Healthy and delicious. Lovely scenes."], ["peanut rice", 740808157707051010, "@NE0MARKS @renjuniris ?? you dont put peanut butter on your wet rice? that's how the flavor comes"], ["peanut rice", 223252370, "@katarahparis Peanut butter, oatmeal, rice, pasta"], ["peanut rice", 773102244178882562, "Rice with peanut butter https://t.co/ipiWj5T8D5"], ["peanut rice", 1046356466, "i am not the biggest fan of peanut butter, but if you give me some rice cakes and peanut butter i am a happy girl 🌞"], ["peanut rice", 1018879441018281984, "@hummytweets Rice cakes with peanut butter and jelly"], ["peanut rice", 305096180, "Cajun/Asian fusion. Crawfish egg rolls. Rice, vegetables, pepper jack cheese and lots of crawfish tails. #Realtree #Timber2Table #Cajunfood\n\nhttps://t.co/HysS4Fadx8 https://t.co/WtLrJqvUvG"], ["peanut rice", 3246819925, "@sinncostar ini pasti bukan ketoprak, tapi rice and vegetables and egg with peanut sauce plus extra crunchy snack :("], ["peanut rice", 1214373119957307393, "@RashidaTlaib Food Stamps were Designed to be a bridge for assistance not a way of life generation after generation back in the day you received peanut butter bag of rice beans cheese etc. now food stamps purchase soda pops lobster’s Candy let alone the food stamp holder sells their cards"], ["peanut rice", 1203601214388047872, "@hollywould2112 Hi holly \nIt’s really good in a simple stir fry. Just quick fry some veggies with a little tofu, peanut oil salt and onion powder any soy sauce. \nRed pepper to taste and serve over steamed brown rice. You cook the dish at a high temp and stir fast so the veggies are still crisp😘"], ["peanut rice", 769920, "Whey protein chocolate shake (C-, too sweet), ½ meatball sub (B+), rice cakes with peanut butter and Lao Gan Ma (A+)"], ["peanut rice", 1124965063276630016, "@haewookfocus Indonesian chicken barbeque with peanut sauce: IDR 50k\n+ extra rice: +10k"], ["peanut rice", 2316364028, "@Dianasaurus_V @TriggerShark7 @stclairashley @AOC Stop going to Starbuck's. Cook your food at home. Don't get your nails done. Keep your old TV. Don't buy a gaming system. Keep last year's clothes. Go to a $1 theater and not Alamo Draft House. Work after school. Earn a scholarship. Eat beans and rice and peanut butter. Etc."], ["peanut rice", 482829067, "@gnomedic Why does this look like peanut butter and jelly Filipino rice cake? 🇵🇭 🤤"], ["peanut rice", 765292954357407744, "RT @numsmingi: what are u getting this year?\naries- chicken nuggets\nleo- a hug from jimin\ncancer- a new haircut\npisces- money\nscorpio- a ca…"], ["peanut rice", 998935396904992768, "RT @afterthethrill: i hate chocolate so as long as those rice krispie treats don’t actually look like that and have extra marshmallows and…"], ["peanut rice", 4445961738, "i hate chocolate so as long as those rice krispie treats don’t actually look like that and have extra marshmallows and some peanut butter; im good all them can be tossed lmao https://t.co/nF1JPtbg32"], ["peanut rice", 2530821750, "@jasmine39576 Diet is eggs, lean boneless skinless chicken, asparagus, spinach, avocado, 93/7 lean beef, zero calorie sauces and such, brown rice, whey protein and peanut butter. Mostly 4oz of meat.\n\nOnce a week I do a cheat meal (only one, with dessert) as a reward and reset."], ["peanut rice", 3230648830, "RT @bearplate: These aren’t your average enchiladas!  These sweet potato, kale, and rice-filled tortillas are covered in a ginger-infused p…"], ["peanut rice", 1206342317751144449, "@subtanyarl solid rice with vegetable and peanut sauce"], ["peanut rice", 1050309145788727296, "@TLRailUK I left my tote bag with my lunch in on the 7:13 from Flitwick to East Grinstead. Just so you know it's only got a mushroom goulash, rice, a banana and a peanut butter sandwich in. Nothing dodgy. Hope someone likes my goulash."], ["peanut rice", 894323152939098112, "Rice × Sugar × Peanut butter 🔥🔥🔥 https://t.co/kwTGGsYEEQ"], ["peanut rice", 2260782569, "@blknoiz06 @DeeZeyDeeZe Wake up: \n\n1.) yogurt w/fruit granola and sunflower seeds. Mouthful peanut butter.\n\n2.) 3-5 eggs\n\n3.) Protein shake w/ 3 packs oatmeal\n\nLift\n\n4.) Protein shake w/ 1 pack oatmeal\n\n5.) Meat, rice, veggies\n\n6.) Meat, rice, veggies.\n\nThere you go nerds you learn something new."], ["peanut rice", 2635990322, "I’ve been eating peanut butter &amp; bread for the past three days. I haven’t eaten any rice and meat. Seriously, I’m not even craving for any."], ["peanut rice", 2973244236, "7am I woke up, got ready for work (I have great personal hygiene). Cut up an apple &amp;packed some peanut butter for work (ran late) 1hr lunch break chx and rice, organized my calendar, 📞calls, prepared for work meeting. Returned to work, got home at 630pm. - https://t.co/A4UjCP9e2X"], ["peanut rice", 45766121, "Trying to eat well is so boring. There’s nothing fun about eating a rice cake with peanut butter and honey... I want a s’mores pop tart or a cinnamon bun 🤤"]]