[["peas and cauliflower", 1112476732345458690, "Green peas and cauliflower are legit the worst vegetables. Bottom tier."], ["peas and cauliflower", 1109474094054100993, "@madmarchheather A tie between broccoli, peas and celery.    My least favourite is Iain Duncan Smith and cauliflower, both the work of Mephistopheles."], ["peas and cauliflower", 4719251716, "Bbq salmon and mashed cauliflower  with peas. Mmm. https://t.co/YrbeECkMHf"], ["peas and cauliflower", 727161880167469057, "@madmarchheather I just learned that green beans are fruit 🤯 so my real favorite veggie is cauliflower. So versatile. Mashed cauliflower is bombbb. Ooo and I love peas and Lima beans!"], ["peas and cauliflower", 12107822, "@madmarchheather Cauliflower. No, peas. Potatoes, definitely potatoes. And carrots. No, beans. Green beans. White asparagus. Damn, I like more vegetables than I originally thought! https://t.co/aQLW9Et4wd"], ["peas and cauliflower", 1959633054, "ICYMI: This recipe for easy cheesy cauliflower and peas is a perfect vegetable dish for when you're still craving some comfort food but want it a little healthier than pasta. It can be a main dish or a side. You'll want to make... https://t.co/7ZPBvAnkMW #vegetarian #keto #cheese"], ["peas and cauliflower", 1171075817549570048, "@govworkerfi @AlongCamel Oooh, my absolute favorites are peas and Brussels sprouts. At Trader Joe's the sprouts are 99 cents/lb! Peas are regularly $1.50/lb; both are THE BEST with the right spices/olive oil. Besides those two I also like green beans. Broccoli and cauliflower is... okay. Not bad, I guess"], ["peas and cauliflower", 392409660, "And it was mostly all plant based additions. Green peas, flax seeds, sun flower seeds, almonds, tofu, cauliflower, and a lot more beans"], ["peas and cauliflower", 22847776, "Beans love to be planted with broccoli, carrots, cauliflower, corn, cucumbers, peas, rosemary, strawberries, Swiss chard, tomatoes, thyme, sage.\n\nBe sure not to plant the carrots by the tomatoes. Doing so will make your carrots short and stubby.\nhttps://t.co/sC6hoox2E0"], ["peas and cauliflower", 24391004, "Beans love to be planted with broccoli, carrots, cauliflower, corn, cucumbers, peas, rosemary, strawberries, Swiss chard, tomatoes, thyme, sage.\n\nBe sure not to plant the carrots by the tomatoes. Doing so will make your carrots short and stubby.\nhttps://t.co/VXQFjuN4Um"], ["peas and cauliflower", 412749784, "Beans love to be planted with broccoli, carrots, cauliflower, corn, cucumbers, peas, rosemary, strawberries, Swiss chard, tomatoes, thyme, sage.\n\nBe sure not to plant the carrots by the tomatoes. Doing so will make your carrots short and stubby.\nhttps://t.co/U7NDbYum9P"], ["peas and cauliflower", 17079694, "@tanyarezak a pound bag of “stir-fry” or “Asian style” precut frozen veggies, and sometimes riced cauliflower or peas or mirepoix on top of that"], ["peas and cauliflower", 921197448885886977, "Other - ,  -  Eating salad, probably E coli. Happened within minutes  I ate the arugula salad with roasted cauliflower , 3 blackberries, and some green peas... Food Poisoning https://t.co/bp5AFGJVg1 https://t.co/H314CQAeNh"], ["peas and cauliflower", 725391765801312257, "Pigeon peas with pumpkin, I “stewed” the cauliflower like you would beef, (it’s not as brown as it should be because browning sugar gives me hella anxiety and I panicked) fried plantain, Cole slaw and steamed sweet potato  #glutenfree #plantbased #vegan https://t.co/z0AjUkTONp"], ["peas and cauliflower", 20638945, "@TylerJayAmos Chick peas and all beans are $1. Kale $89 cents. Asparagus like $2. Cauliflower like $4. All that will feed me and ashley for like 2-3 days. Do the math"], ["peas and cauliflower", 166445279, "Tandoori CornStarch Pita Bread with Fenugreek leaves and peas in a creamy curry, potato cauliflower and peas curry and spicy mint dip\n.\n.\n.\n.\n.\n.\n.\n. #yum #foodpic #foodgasm #Soulfood #curries #foodphotography… https://t.co/n1UqZUEfwY"], ["peas and cauliflower", 1137724309504479234, "10/02\n\nProtein shake\nMandarins\nToast with cheese and jam\nVanilla yogurt, chia and cinnamon\nDates\nSpinach cream with peas\nCauliflower and broccoli\nYogurt and biscuits https://t.co/wpLdztAvlp"], ["peas and cauliflower", 2314522046, "@BayCheyann Brats, cheese broccoli, cauliflower rice with soy sauce. Teriyaki chicken with rice that has like carrots and peas in it. GAME CHANGER- put asparagus on a cookie sheet, put your choice of oil on and get a ranch seasoning packet on dust that on it 👌🏼"], ["peas and cauliflower", 938079803319742464, "Because no grain-free person should have to live without coconut rice. https://t.co/nEHj95PyQQ Jamaican Style Cauliflower Rice and Peas #Vegan #GlutenFree https://t.co/DFHtb4n71H"], ["peas and cauliflower", 1064969427999846400, "5YO sat down at dinner last week and announced, \"I like all the vegetables now.\"  Suddenly my peas-only pick eater is happy with broccoli, string beans, cauliflower...\n\nI have no idea what happened, so I'm going to call it good parenting and leave it at that.\n\n#DadLife #Parenting"], ["peas and cauliflower", 1050826311755677696, "Vegan *Soy* Orange Chicken served over a bed of riced cauliflower with carrots, peas, onion and green onion. Late lunch/ early supper. Kept it easy. Still feel like crud. So tired guys. So so so tired. Have a good… https://t.co/ifLu38DtZB"], ["peas and cauliflower", 1959633054, "NEW: Easy Cheesy Cauliflower and Peas https://t.co/7ZPBvAnkMW #vegetarian #keto #glutenfree https://t.co/SVoSHU7zfp"], ["peas and cauliflower", 2493368425, "Easy Cheesy Cauliflower and Peas - https://t.co/RLXSLrYxYk #NCBlogger #NCBloggers #Blogging #Bloggers #NewBlogPost"], ["peas and cauliflower", 836563561988112384, "More work in the cod dish for March #supperclub \n\nMuch better dish and getting there. \n\nSo pan fried #cod fillet, peas in butter sauce, tenderstem and roasted cauliflower with a lemon parsley garlic hollandaise… https://t.co/4m6UbdcarK"], ["peas and cauliflower", 2369342813, "Today’s edition of leanne eats too much food: we got mash, roasties, green beans, asparagus, broccoli, cauliflower, roast carrots, ‘bacon’ and sundried tomato sprouts, peas, leek, stuffing and rosemary ‘chicken’ 👌🏻 https://t.co/P8CmbxjbUZ"], ["peas and cauliflower", 829839225491124224, "Vegetable Masala Enchiladas 💫🌱 cauliflower, broccoli, peas, curried coconut, green garlic, panch phoron and herbs. https://t.co/ZcblFmVYVC"], ["peas and cauliflower", 611063100, "All these vegan/veggie restaurants and vegan menus are so annoying they just assume we went vegetables and mushrooms, pine nuts, chick peas or cauliflower. Please just give me a plate of chips and something else stodgy. We’re not all veggies or vegans for health reasons 😡"], ["peas and cauliflower", 421159817, "@hugh_pimple No I don't drink either Hugh.  Just the odd glass of Prosecco.\nHaven't had fish fingers for years.  Mondays here is cauliflower cheese, Yorkshire pudding and peas. All a bit boring really when you're a veggie, well pescatarian actually."], ["peas and cauliflower", 1059138205847613442, "Whats on your plate? I’ve had the amazing @leonrestaurants pea-lentiful dip with sugar snap peas, cauliflower daal and jerk chicken. https://t.co/jXPqYZnpnP"], ["peas and cauliflower", 2961329057, "clean-out-your fridge veggie curry 🍲 used my fave “sweet potato &amp; chickpea curry” recipe from the blog and swapped out the sweet potato for regular potato and cauliflower. threw in a frozen peas/corn/carrot mix.… https://t.co/IkIhWsNlVO"], ["peas and cauliflower", 24869704, "Hey @eflind, I defrosted some Roasted Cauliflower Mac Cheese, and jazzed it up with peas and bacon. Sooooo good. https://t.co/AyDa4wLc4x"], ["peas and cauliflower", 336386107, "@josephbt Green beans, peas and cauliflower"], ["peas and cauliflower", 260139912, "@SC_1287 @ham1982 Awww peas are like the best thing ever! Has to be peas, runner beans and cauliflower every time...."], ["peas and cauliflower", 52514197, "Raw broccoli, snap peas, cauliflower so good with spinach dip and crab dip. 😩"], ["peas and cauliflower", 432727790, "@Brexitician @Marshall5Sharon @KingOfWrong Cauliflower cheese only goes with roast beef. Puds ok with everything except lamb. Chicken should have bread sauce, lamb with new pots and peas. Don’t @ me this is a hill I will die on!"], ["peas and cauliflower", 1137724309504479234, "09/02\n63.2kg\n\nProtein shake with almond milk and cinnamon\nKiwi, pistacchii yogurt and chia\nCauliflower, peas and champignons\nDate https://t.co/cXsy4zsGn1"], ["peas and cauliflower", 183537934, "RT @dariuscooks: Who said vegan didn’t have flavor!? My jerk cauliflower with rice and peas says differently ☝🏿\n\n#vegan #veganrecipes #vega…"], ["peas and cauliflower", 1196664990222209024, "@corbynsgrande cauliflower and peas"], ["peas and cauliflower", 1143460937581715456, "@F4cetious4life @msgeor6e @CuteTinyAssass1 @GDgeek @oldmanonmain I love broccoli, cauliflower, spinach, pumpkin, Brussel sprouts, squash, carrots, corn on the cob (not sweet corn), mushrooms, etc. But I'm still half and half on peas"], ["peas and cauliflower", 535524230, "Just spent ages on (early) dinner, quorn kiev, fried cauliflower popcorn and mushy peas ... only to trip on rug and send the whole lot flying down the hallway.\n\nBinned. 😭\n\nSo, peanut butter sandwich for dinner.😕"], ["peas and cauliflower", 350945534, "Doesn't this remind you of Saturday morning Farmer's Market! ⁠\nFour mini heads of iceberg lettuce, Detroit Dark Red Beets, Golden Beets, French Breakfast Radishes, Broccoli, Cauliflower, and Oregon Sugar Pod Peas! ⁠\n⁠\n⁠\n⁠\n#plantme #farmersmarket … https://t.co/rvjJTZwSDa https://t.co/7zQOWSIIPw"], ["peas and cauliflower", 2842192174, "@alexdecampi We just call that cauliflower cheese. \nI always made mac and cheese for my niece and added in  medley of cauli, broccoli, peas, carrots (whatever was in the fridge) worked every time"], ["peas and cauliflower", 32854119, "@Mrb20203 wife cooks me a dinner every evening.\nand now and again i even let her out the\nkitchen lols. home made shepherds pie\nroasties, cauliflower,  peas, gravy.\nstomach is going like a coffee grinder"], ["peas and cauliflower", 801081570, "Beans love to be planted with broccoli, carrots, cauliflower, corn, cucumbers, peas, rosemary, strawberries, Swiss chard, tomatoes, thyme, sage.\n\nBe sure not to plant the carrots by the tomatoes. Doing so will make your carrots short and stubby.\nhttps://t.co/drIeyMxa1j"], ["peas and cauliflower", 1112290607014174720, "@Sachan_Atul No veg pulao.. Cauliflower and peas"], ["peas and cauliflower", 1172092962001604608, "RT @joyce06349644: Roast chicken, cauliflower cheese, mashed potato, roasted honeyed carrots and peas with the obligatory run away peas. Su…"], ["peas and cauliflower", 383070281, "@jesswho82 If you have to watch carb intake it’s what you eat and I don’t care how much butter, mixing it with peas and corn it still cauliflower."], ["peas and cauliflower", 1076523449185697792, "RT @joyce06349644: Roast chicken, cauliflower cheese, mashed potato, roasted honeyed carrots and peas with the obligatory run away peas. Su…"], ["peas and cauliflower", 487680369, "RT @dariuscooks: Who said vegan didn’t have flavor!? My jerk cauliflower with rice and peas says differently ☝🏿\n\n#vegan #veganrecipes #vega…"], ["peas and cauliflower", 26016118, "RT @joyce06349644: Roast chicken, cauliflower cheese, mashed potato, roasted honeyed carrots and peas with the obligatory run away peas. Su…"], ["peas and cauliflower", 22079184, "@GinaMcleod Mine is onion red and white, carrots sweet potato, red lentils, chick peas, mushrooms cauliflower and Kale. Sauce from scratch, banging!!"], ["peas and cauliflower", 468952397, "RT @dariuscooks: Who said vegan didn’t have flavor!? My jerk cauliflower with rice and peas says differently ☝🏿\n\n#vegan #veganrecipes #vega…"], ["peas and cauliflower", 3065865688, "Black Eyed Pea &amp; Cabbage on the menu! The smoky flavor of black eyed peas and smoked paprika is married with cabbage in a rich tomato based broth. Also serving Caraway Cauliflower and Chicken Soup at our hot soup bar today, 11 am - 3 pm today. https://t.co/85zhwbW9hL"], ["peas and cauliflower", 1063477842690871296, "@Bristow06230994 @ghost_wales Yep! Egg and chips with it? I'm undecided. Maybe cauliflower cheese and English garden peas? Hmmm..."], ["peas and cauliflower", 1048326048503529476, "Roast chicken, cauliflower cheese, mashed potato, roasted honeyed carrots and peas with the obligatory run away peas. Such a rewarding job. How it took me so long to get into elder care is beyond me. #legends https://t.co/VzhwHww3xb"], ["peas and cauliflower", 943001032266866688, "RT @LaxusDThunder: Hey guys hows the day going and did you had lunch or not? If no please eat as you get time and today I made brown rice w…"], ["peas and cauliflower", 1102592901043929090, "Hey guys hows the day going and did you had lunch or not? If no please eat as you get time and today I made brown rice with vegetables.\nIt have chickpeas, green peas, sweet potato, cabbage, cauliflower, mushroom, capsicum and some peanuts. https://t.co/Qda7MvNgN5"], ["peas and cauliflower", 1187939510, "Hi.\nI love green/red peppers. Broccoli and cauliflower. Snap peas and green beans. Potatoes. Idk who I am anymore."], ["peas and cauliflower", 51882782, "RT @dariuscooks: Who said vegan didn’t have flavor!? My jerk cauliflower with rice and peas says differently ☝🏿\n\n#vegan #veganrecipes #vega…"], ["peas and cauliflower", 2256664812, "RT @dariuscooks: Who said vegan didn’t have flavor!? My jerk cauliflower with rice and peas says differently ☝🏿\n\n#vegan #veganrecipes #vega…"], ["peas and cauliflower", 2437511869, "RT @dariuscooks: Who said vegan didn’t have flavor!? My jerk cauliflower with rice and peas says differently ☝🏿\n\n#vegan #veganrecipes #vega…"], ["peas and cauliflower", 16585780, "Who said vegan didn’t have flavor!? My jerk cauliflower with rice and peas says differently ☝🏿\n\n#vegan #veganrecipes #veganfood #veganbutwithsoul #DariusCooks https://t.co/CaVNWfaYmR"], ["peas and cauliflower", 3285831319, "Crispy Pata with Sweet Peas, Spicy Siling Labuyo Puree and  Cauliflower Risotto 🇵🇭🇵🇭🇵🇭\n.\n.\n#crispypata #pork #filipinofoodies #filipinofoodmovement #yummyph #districtgastro #districtdelicious #kain https://t.co/t68og76dpt"], ["peas and cauliflower", 16126544, "@SaraKateW okay i’m literally eating this frozen/steam in bag riced cauliflower right now and it’s life changing. like most weeknights i just microwave a bag of this and put some pasta sauce on it and it’s awesome. they also make a fried rice version with carrots/peas and a broccoli version https://t.co/pSX9v3v37F"], ["peas and cauliflower", 25649626, "Happening right now at a middle school: Students learning knife skills and healthy alternatives to eating as they prepare to make cauliflower rice with peas, onions and garlic. Engaging &amp; empowering Se to lead healthy lives. #Afterschool teaches integrative life and career skills https://t.co/altcPiX5OQ"], ["peas and cauliflower", 3141260083, "i really fuck w this now that im eating it. made vegan alfredo w cashews and spices, cauli gnocchi, cauliflower, zucchini, and peas"], ["peas and cauliflower", 1145508155587276802, "RT @MoBiggaa: i just had chicken with broccoli, cauliflower, and peas. a whole side salad and 3 hard boiled eggs. \n\ni’m still hungry. how d…"], ["peas and cauliflower", 20036128, "i just had chicken with broccoli, cauliflower, and peas. a whole side salad and 3 hard boiled eggs. \n\ni’m still hungry. how do you big body buff guys do this shit. \n\ni want a burger. *cries in fat*"], ["peas and cauliflower", 728198754, "RT @Budget_Bytes: This Curry Roasted Cauliflower is incredibly simple. The mild, roasted cauliflower is nicely balanced with the earthy cur…"], ["peas and cauliflower", 618513452, "This Curry Roasted Cauliflower is incredibly simple. The mild, roasted cauliflower is nicely balanced with the earthy curry powder and the sweetness of the caramelized onions and fresh peas. &gt;&gt; https://t.co/fcR1ol3S8Z https://t.co/Fnit2FYpVt"], ["peas and cauliflower", 19699720, "@12BravoGran @realDonaldTrump 🤣🤣🤣🤣🤣🤣🤦🏼‍♂️🤣🤦🏼‍♂️🤣🤣🤦🏼‍♂️🤦🏼‍♂️🤣🤦🏼‍♂️🤣🤦🏼‍♂️🤦🏼‍♂️🤦🏼‍♂️🤣🤣🤣🤦🏼‍♂️🤣🤦🏼‍♂️🤦🏼‍♂️🤦🏼‍♂️🤣🤦🏼‍♂️🤣🤣🤣🤦🏼‍♂️note the sequence and be ready, Q sent me a text, it said “cauliflower” remember the raw peas incident, well this is WAY bigger, Z and Y are involved.. the consonances are combining NOW. 11:506-Z 4412a"]]