[["pesarattu", 1160271161420206080, "@Gurubhat_ @ShefVaidya Ask for pesarattu..if you want to eat moong dosa....."], ["pesarattu", 104112644, "@saivenkat1106 @ShefVaidya Yes. Since this is a variation of Pesarattu, we can name it “Pesarrattoats Dosa”! 😂"], ["pesarattu", 4452761420, "@Gurubhat_ @ShefVaidya That Dosa has a name it's called as \"Pesarattu\" and please it's combination with Upma and not Oats"], ["pesarattu", 189229221, "@Gurubhat_ @ShefVaidya Mongdal dosa should be complemented with upma.\n\nIt's kind of a Andhra's royal food.\nPesarattu upma."], ["pesarattu", 1101514879553425414, "It's no wonder I love South Indian food so much - I'm part Andhra. I made Pesarattu for lunch today. It's super duper easy to make, gluten-free and vegan. \n\nAai's legacy 🥰💜 https://t.co/EqeMaf7qc0"], ["pesarattu", 87738581, "Apricot,  Pesarattu Dosa topped with Onion Chutney \n.\n.\n\n#inherlunchbox #aksharakadabba #babysnack #kidstiffinbox #lunchbox #quickrecipes #quickandeasyfood #kidsfood #preschoollunch #preschoolfood #zenithbuzz… https://t.co/qCxATuONLQ"], ["pesarattu", 789460657485643777, "@shreyasirao1 SETTLE for Pesarattu???? HAVE YOU NO SHAME CHILD????????????"], ["pesarattu", 1102102820562460672, "man I just want Amma’s dosas even idli is fine even RAGI dosa is fine I’ll even settle for pesarattu. even dry uppit is fine. honestly just give me ganji in the morning I’ll be ok. even a small drop of uppinakaayi is better I hate sabudhana"], ["pesarattu", 1226575201598496768, "Thanks for the article guys @metronewspaper #bestfood #southbay #ulavacharu #ulavacharutiffins #dosa #idli #pesarattu https://t.co/5PYNOs3tOv"], ["pesarattu", 2261065500, "@ARanganathan72 U will be happy with mysore pack &amp; coffee, TN will be happy with idly sambar, TS will be happy with biryani &amp; irani chai, ap will b happy with pesarattu upma, punjab will be happy with dal roti, kerala happy apam,but he is one person, and he is PM. Expectations has limitations !"], ["pesarattu", 1203184283839426560, "@bhogleharsha @totalblurr Please taste pesarattu also \nIt's king of breakfasts"], ["pesarattu", 1218476466863607808, "@narendramodi Modiji you should try mysore Masala dosa with filter coffee and mysorepak . Next in Andhra you should have Pesarattu with upma and filter coffee. Plz have it and tweet with images. This is nainsafi with South food . South Indian thali food is ayurvedic in nature."], ["pesarattu", 1203184283839426560, "@AkankshaCutieS2 I fell in love with pink pesarattu"], ["pesarattu", 1101179118937268224, "@VikhroliCucina @kunalvijayakar One of my friends makes an excellent pesarattu which his family have been making through ages. #GodrejFoodTrendsReport2020 #FoodTradition"], ["pesarattu", 804280763252248576, "@FAotC I can give you some very authentic and very tasty recepies eg: lookup on YouTube for garelu, idli, dosa, pesarattu, upma and biryani."], ["pesarattu", 206523117, "Uthappam is my least favourite South Indian snack. \nToo heavy, the onion tomatoes make the texture weird. \n\nRather have Pesarattu."], ["pesarattu", 813272635, "@JustPunforfun Committed too many sins.  Kind of indifferent to the #Samosa.  #Khandvi, #Dhokla and #Theplas are in along with an occassional #GheeMasalaDosa or an #Andhra #Pesarattu"], ["pesarattu", 1146258809951625216, "A healthy Green gram sprouts Dosa for Breakfast😍💪Its commonly called as Pesarattu, a Andhra special dish which is also a tasty one👌😋👍 Vadacurry, coconut &amp; tomato chutney r the best side dishes to accompany with it😍😁 Full of protein&amp;full of health!💪😊 #Foodie #breakfast https://t.co/igmMsaQpXc"], ["pesarattu", 393177221, "@Aakar__Patel Where is the South in all this list?  We got set dosa mallippoo idli, MLA pesarattu, Allam pachadi, THE chakka pradhaman, rasam, moor koottaan, pulusu, sambar, Chettinad and a whole deal of food.  The food that's tweeted is very very restrictive."], ["pesarattu", 248351898, "@Tara_Deshpande Le Creuset enamelled cast iron (multiple shapes &amp; sizes) stands up to sturdy Indian cooking beautifully, from Pesarattu to Pav bhaji. plus some soapstone pots from India &amp; Brazil. 1 token nonstick Green pan used rarely when needed."], ["pesarattu", 255929604, "@Anoopsri @Bengaluruhudugi @SrinathHnp That's maybe coz we are so accustomed to the rice texture... For instance, I can easily belt 6-8 normal dosa (rice) while I feel extremely stuffy with 3 same sized pesarattu at home... But pesarattu is good when consumed in moderation... So is chilla (made of besan)"], ["pesarattu", 1196318053, "To hell with Delhi results. I'm at an Andhra wedding in Guntur. Will eat pesarattu Upma with Allam pacchadi and enjaaayyyyyy!!!!! https://t.co/pPWXPoaTC8"]]