[["phaal", 2866578006, "RT @TheCurryGuy: With this base sauce, you can make all the curry house favourites. Form mild korma to spicy phaal! https://t.co/Ih2hUxxrXv…"], ["phaal", 197448979, "With this base sauce, you can make all the curry house favourites. Form mild korma to spicy phaal! https://t.co/Ih2hUxxrXv https://t.co/6Nvhl60TyP"], ["phaal", 1191626617023614976, "Thanks Sir for prediction about #BB13 winner..\nInsha-Allah #SidharthShukla will win the Show.\nPlease makers hamari din raat ke mahnaat ka phaal hame zaroor daina.\nOnly Sid Deserved to be a winner as huge votes #SidHearts\n@mnysha @EndemolShineIND @Sudhanshu_Vats \n@RealVinduSingh https://t.co/1J8Uf4lq2P"], ["phaal", 1191626617023614976, "@RealVinduSingh @mnysha @ColorsTV @EndemolShineIND @BeingSalmanKhan @BiggBoss @Sudhanshu_Vats Insha-Allah #SidharthShukla will win the Show.\n\nPlease respectible Makers @mnysha @Sudhanshu_Vats hum #SidHearts ne Din raat aik ker deay han in Support &amp; Votes for Sid..\n\nPlease hamari mahnat ka phaal hume zaroor daina by the Sake of God.\nWell Deserved only @Sidharth_Shukla https://t.co/WsTXAzVbya"], ["phaal", 965669649080881152, "@realDonaldTrump Ask for a nice Phaal curry to remember your trip."], ["phaal", 497236095, "Phaal’s a hot curry,\nBhuna is milder,\nI love Brian Deane,\nAnd I love Chris Wilder. ❤️\n\n#valentinesblades ⚔️\n#twitterblades\n#sufc"], ["phaal", 1144895626368471040, "@B_Rap_ Alpha Wann, Philly Phaal, double P majuscule"], ["phaal", 721144681715916800, "@vivekagnihotri Sir I’m good English, my cow also English \nBecaje he is female he give milk\nHe is four footed so do not phaal \nI spoke English also"], ["phaal", 748594478991163392, "Being thrashed at our steps challenge by @BeccaSpence91 has put me in a phaal mood! 🌶 https://t.co/9AYw4uLap6"], ["phaal", 308455334, "I have a rectum wrecking, intestine incinerating, Prawn Phaal. The prawns are as rancorous as Bozo Johnson’s morals.... Hehehe"], ["phaal", 376433878, "@ebruenig Back when my friend and I were both single we went to Brick Lane Curry and had the phaal, the world's spiciest curry. Got a certificate and free beer for our trouble. Fun! OTOH having dinner with somebody paid to be there would have made me ultra depressed, but to each their own."], ["phaal", 308455334, "I have a rectum wrecking, intestine incinerating, Prawn Phaal. The prawns are as rancorous as Bozo Johnson’s ability to tell the truth.... Hehehe"], ["phaal", 60043074, "After multiple failed attempts by multiple people tonight we have another finisher. Please welcome James VI into the club @bricklanecurry .........................\n#bricklane #curry #curryhouse #phaal #finisher #braggingrights #currymonster #foodporn #eastvillage #eastlondon #nyc https://t.co/eE5C9G1cn7"], ["phaal", 1217657707433316352, "@tweetsOfEl Even my muslim friends are worried to say Insha Alla while I am with them. Coz whoever says Insha Allah in our group has to buy Sheek &amp; Phaal ."], ["phaal", 941781562458120192, "@jaxsunm KALLAX and PHÅL shelving units here I come! (Hopefully soon yes)"], ["phaal", 712960546, "RT @masterbates223: When the phaal from last night decides to leave your body. https://t.co/WntFtrAWHx"], ["phaal", 308455334, "I have a rectum wrecking, intestine incinerating, Prawn Phaal. The prawns are as rancorous as Dominic Cummings is a psychopath.... Hehehe"], ["phaal", 1208799442591256576, "@Lfeizgud Bro I’ve got to have a phaal curry and I’m not happy till my lips have swollen up, nose running and tears down my face, that’s when you know it’s good. One of my ex girls refused to ever go for curry as it was embarrassing 😂😂"], ["phaal", 4706629372, "@bruce_bwkm @MrNishKumar He is just as funny as my arse after eating a Phaal curry!!"], ["phaal", 1023238661125664768, "@katieeeeebell Trusting a fart after eating a phaal"], ["phaal", 463219111, "How the hell do you phaal in a curry https://t.co/9iLvRBNgM8"], ["phaal", 308316600, "@MarkFrancois12 You're on phaal today General..."], ["phaal", 308455334, "I have a rectum wrecking, intestine incinerating, Prawn Phaal. The prawns are as rancorous as witnessing Bozo Johnson felch Dominic Cummings.... Hehehe"]]