[["pork vindaloo", 880304130815795200, "#ValentinesDay dinner, we took our first stab at Indian Food (pork vindaloo and chicken saag) and it was like seriously AMAZING! https://t.co/jk5XQrsGmV"], ["pork vindaloo", 484720435, "Pork Chop Vindaloo #curry #goa #port #stafffood #friday #hotinthecity @ Thyme https://t.co/Z4tAMxspQU"], ["pork vindaloo", 884707051808731136, "RT @Hema_quotes: @dsanjeebkumar @RanaAyyub Her Goan friend @sardesairajdeep can serve her “Goan Pork Vindaloo” next time she visits them!"], ["pork vindaloo", 240435017, "Hey @dianachanau Loving Asia unplated. The Goan vindaloo pork ribs look incredible. How long do they need to simmer?"], ["pork vindaloo", 4510529459, "@adhicutting And sure the Nuns shared their Pork Vindaloo with the Muslims (being secular ) gladly partook the food.A good story writer."], ["pork vindaloo", 69231969, "Pork vindaloo with homemade paste - that's banished any winter chills for a few days! #curry #food #dinnerideas @ Brentford, United Kingdom https://t.co/TqVkDklJAv"], ["pork vindaloo", 1035910889986306048, "@3twinplacement_ @carolinecaloway she liked this i think she’s gonna eat the pork vindaloo with u"], ["pork vindaloo", 3262594994, "anyways im done tweeting about her @carolinecaloway eat pork vindaloo with me im gonna enter you into the desi community so you can speak out against modi next"], ["pork vindaloo", 3262594994, "hey guys! i know my 172 followers are super interested in me and caroline's journey together.....i just want to say that we've spoken and she's agreed to eat pork vindaloo with me &lt;3 \"pakistan zindabad!\" she said over dm....also, she is going to redistribute all her wealth :)"], ["pork vindaloo", 3262594994, "ya'll think caroline calloway is a scammer, i think she's a genius who needs to 1. follow me 2. eat pork vindaloo with me"], ["pork vindaloo", 3262594994, "caroline calloway stopped terrorism in the year 2019 #callowayfacts additionally caroline calloway will you eat pork vindaloo with me"], ["pork vindaloo", 919218318522834944, "@JamieHo57842236 Yes. Pork Vindaloo is correct. Though, over time, people who doesn't take pork moved onto mutton/chicken variants too"], ["pork vindaloo", 940661192791556096, "@myfoodsojourn I made a vindaloo a few years back with pork, i was told that is a pork dish, is that correct? not hot like the curry's in the restaurants but tasty, i must dig out the recipe."], ["pork vindaloo", 19015455, "@BmoreBeloved I'm teaching myself how to make vindaloo, my FAVORITE Indian curry.\nVinegar plays such a great role in tenderizing cheaper cuts of lamb, pork, &amp; beef."], ["pork vindaloo", 176429488, "Just made Pork Vindaloo from this recipe book it was delicious... I mean REALLY delicious https://t.co/TaAeKK35zb"], ["pork vindaloo", 609019769, "@daveylittle Goa pork vindaloo. Wife out in the randan my we treat to myself 🔥👹🔥"], ["pork vindaloo", 1158923206486581248, "@sullabeaterr_44 @Indrasen__ of course. also big fan of: goan vindaloo, assamese pork curry, pork momos, pork jhol, pork ularthiyathu, pork dal tadka, and ulavacharu dum pork biryani."], ["pork vindaloo", 825986476139749376, "Hey fatties, \nCrispy Boy, Pork Vindaloo and Prawns Portuguese. \nRegards https://t.co/RcjLLHlHgY"], ["pork vindaloo", 18664689, "My recipe for Goan Pork Vindaloo is coming to the channel soon 😄\n\nTender chunks of fatty pork are marinated and then cooked in a curry flavoured with chilis, spices, and vinegar. Tangy, spicy, and rich! 🌶\n\nStay tuned! https://t.co/wlNgTTA3tr"], ["pork vindaloo", 1499383375, "On tomorrow's specials list:\nGoan Lamb Vindaloo,\nMedium-Hot Parsee Chicken Curry Mumbai,\nChicken Cordon Bleu with Smoked Ham, Gruyere Cheese and Tomato Sauce,\nLamb Burger With Goats Cheese,\nNorth Atlantic Cod Suprerme,\nRolled Chorizo &amp; Sage Pork Belly,\n\nhttps://t.co/tbH806OcuC https://t.co/qXjWobRcMB"], ["pork vindaloo", 89381067, "@rajakumaari @AdhavanMurasu Goan pork in Bangalore? Try mangalorian pork preparation and then try Goan vindaloo. There is difference in taste. But you would like both."]]