[["potatoes", 1602277548, "RT @TrevMaeder96: FINAL: Logan-Magnolia 48 Missouri Valley 24. \n\nMo Valley led 24-22, but Lo-Ma hit the meat &amp; potatoes of their lineup and…"], ["potatoes", 2710295663, "\"You seriously don't know why human beings eat potatoes\"\n-Sasha\n#AoTQuotes"], ["potatoes", 806047785871024133, "Making 'Weird Juicy Loaves' is easy. Just mix 66 cups of random spices into about an inch of potatoes, and wait. 🍪"], ["potatoes", 1036639509788676096, "@cmb9802 @RachelFrank_CT @DanAmarante @themattcast I’m with you - have Meatloaf, mashed potatoes with butter drizzling out and corn enjoying it - cuddly !!!!!"], ["potatoes", 744659610636795904, "Eva Waid and the Esoteric Potatoes, a satanic celtic metal band"], ["potatoes", 635697454, "@Angelaboord @booksterbear I very clearly remember reading Swordheart on my kindle while stirring a pot of potatoes on the stove. Nothing makes you multi-task better than a fantastic book."], ["potatoes", 358840644, "@DavidCornDC @DonaldJTrumpJr @realDonaldTrump @kimguilfoyle She should really order egg whites with no potatoes or toast."], ["potatoes", 339283603, "@KWickwireSR @santeez90 That shirt did need to be ironed though. He said I like extra starch. Based on those wrinkles, he must have meant potatoes."], ["potatoes", 24934751, "Today’s FRESH PRODUCE FEATURE 🍒 is RED FINGERLINGS (Code: 10392 | 10lb.) 🥔 These delicious little potatoes are perfect for roasting with garlic and herbs 👌🏼 \n——\nContact us today at 717-392-6612 or customerservice@kegels.com. We’re here to take care of your produce needs 👍 https://t.co/aoK1UYFloZ"], ["potatoes", 32959129, "RT @4eyes3nipples: A weighted blanket but it's just a garbage bag filled with mashed potatoes."], ["potatoes", 1204359322400112640, "@TraderJill77 But how many \"potatoes\" do you need to feed yourself? Hmmmmmmm?? 🤔😉"], ["potatoes", 767254082, "RT @pieRVK: I like potatoes! 🥔"], ["potatoes", 1213900896829984768, "RT @ultraleap: It's a big and buzzy show, #CES2020. Find out what our CTO, @iamtomcarter,  discovered about the latest trends in #automotiv…"], ["potatoes", 713926469370687490, "cranberries with potatoes"], ["potatoes", 43775439, "I like potatoes! 🥔"], ["potatoes", 1159131604314394625, "RT @farmstarliving: Happy #PotatoLoversMonth! 💕Celebrate and enter the Fall In Love with One Step...Done!™ Potatoes Sweepstakes! Enter dail…"], ["potatoes", 908508631565553665, "@Leve_raged I’m always net long potatoes."], ["potatoes", 899615669771227136, "@Katia_F12 @Scrapbookee I read a profound statement on this hellsite the other day ... your stomach thinks all potatoes are mashed potatoes."], ["potatoes", 43664462, "@INCIndia Current Vegetable Prices (Delhi), in my area :-\nOnion @₹40/kg\nTomatoes @₹35/kg\nPotatoes @₹25/kg\n\nCongress tumhara kuch nahi ho sakta....🤦.... Too alien to ground realities..."], ["potatoes", 732185508, "RT @fishcitybelfast: Brighten up your Wednesday with Provençal Fish Stew 😋🐟Strangford mussels, Irish smoked coley, king prawns, cod, haddoc…"], ["potatoes", 835471763588939776, "@meme_maga Thank you :) I'm a big fish in a little pond. I do better than most individual investors, but compared to the gurus out there I'm small potatoes :)"], ["potatoes", 3006674177, "Why does my fried chicken look like roast potatoes https://t.co/n9iFFm8Xf3"], ["potatoes", 1039685115914477568, "@DietDanielle @VinnieTortorich Oats? Potatoes?"], ["potatoes", 39015116, "RT @sahar_adatia: And the #MAFS arseholery persists. Key points:\n\n- Not sure what’s more firm: Hayley’s personality or her boobs\n- Solve yo…"], ["potatoes", 1125857573910011904, "@ohiowa89 Sewing, DnD, photography, and video games\nCornbeef and Cabbage, apples, potatoes\nRouge Angel: Death Mask, Red Wall\nScenes with Akane and Dakota her griffin"], ["potatoes", 23955019, "@ida_skibenes @SafiyahNoor1 Eat carbs like potatoes"], ["potatoes", 1292820842, "@AntonthyNaomi My head it like mashed potatoes"], ["potatoes", 4848283821, "RT @hunteravocado: potatoes and racism"], ["potatoes", 830021211295989760, "RT @BandonCoop: Spring must be here! Get your seed potatoes now at 💥2 for €10💥 at our #gardencentres #Bandon #Kinsale #Enniskeane\n\nAnd here…"], ["potatoes", 759647408393420800, "Leave in for 2hrs 50 mins, rest for 10 and serve with french beans and lyonnaise potatoes. A crisp cool Pinot Grigio is an added bonus. Don't ask from where the Birds Dream Topping comes from though 👍 https://t.co/XxhindFtW0"], ["potatoes", 902329670, "Oasis Snack Shop lunch Special for Wednesday 2-12-20 is..Sliced Roast Turkey Breast with mashed potatoes and gravy, roasted corn/pepper/onion blend on the side. Comes with a side and a beverage..$6.50\nSoup: chicken Noodle"], ["potatoes", 974063699714629633, "@geese_mr @feralfully @MagicalKiroChan @Undead_Potatoes water*"], ["potatoes", 1168489451045175298, "Duck fat potatoes https://t.co/VN57BxA1dB"], ["potatoes", 1111278758508531712, "RT @GunnerTavernNcl: FEAST your eyes on this BAD BOY 🤤\n\nFriends of the Gunner, let us introduce you to our brand new spit roasted meat shar…"], ["potatoes", 1171169360716734464, "RT @PickardJE: who am I to judge but someone in the work canteen just matched scampi with roast potatoes instead of chips"], ["potatoes", 165731326, "Wednesday made better with a chip butty. I can't remember the last time I put potatoes between bread, I'd forgotten my Northern roots."], ["potatoes", 64407969, "💥NEW For 2020: Huckleberry Gold #potato⁠⠀\n⁠⠀\nStrikingly beautiful, purple skinned #potatoes with deep, yellow flesh. Round to oval tubers that are high in #antioxidants and have a low glycemic index.\n⁠⠀\nFind #seeds on our website: https://t.co/mDBykYpXbD https://t.co/DmxIsF8Uct"], ["potatoes", 1099330666397868035, "@Infamou03857232 I got questions"], ["potatoes", 923196459536797696, "@merci__beaucoup I agree &amp; your potatoes from the broil  . I use it more for shrimp but it was introduced for crawfish with sometimes mustard ... it’s good"], ["potatoes", 2233678836, "@McDonalds @Wendy’s breakfast will OBLITERATE you and your frozen meat, your liquid cardboard eggs, and your toxic pesticides that farmers can’t even step out of the house for days because of the toxic potatoes #done"], ["potatoes", 277227743, "RT @TheBusyVeggie: Kale and potato soup with vegetarian sausages - so good! https://t.co/64k5tTupbj #vegetarian #vegetariansoup #meatless #…"], ["potatoes", 767407418259091456, "RT @karendong42: my roommates think i’m asleep and i just heard them go “ahhh we’ll just wake up a lil early tomorrow and throw it out....s…"], ["potatoes", 167685407, "@starocodes It depends what you're cooking tbh. I love cooking steak pie or any British foods. I love pairing mashed potatoes with meat and gravy (I prepare my own gravy) etc. Once you've learned the basics, it'll be pretty easy x"], ["potatoes", 208671203, "@GallantDevelopm @asmrglow_ If I try to listen to Glow while studying I get too sleepy. And dreams of mashed potatoes"], ["potatoes", 894406002262626304, "RT @karoroxanax: @houseandhens EMILY NO THERE IS A SPECIAL PLACE IN HELL FOR PEOPLE WHO PUT POTATOES IN THE MICROWAVE 😭"], ["potatoes", 783679072039759872, "@RepValDemings Impeach him again."], ["potatoes", 262703765, "@NatalieEgenolf @TyJohnsonNews @ashlyjoan_ Crock pot with carrots and potatoes"], ["potatoes", 66323368, "RT @fishcitybelfast: Brighten up your Wednesday with Provençal Fish Stew 😋🐟Strangford mussels, Irish smoked coley, king prawns, cod, haddoc…"], ["potatoes", 831358357936107520, "@cjtruth @realDonaldTrump Yes but he’s small potatoes compare to the beast"], ["potatoes", 519751172, "Have you read this yet?:  The Best Ham Green Beans &amp; Potatoes #Recipe https://t.co/U7hVdezbvz #eatpicks"], ["potatoes", 735419353, "RT @andyflyfisher: Pork chops, potatoes, carrots, turnip, cabbage, onions and gravy\n#dinner https://t.co/fkhAnTNxQw"], ["potatoes", 894406002262626304, "I hate microwaved potatoes. They are NOT the same as boiled https://t.co/MS19zQDla9"], ["potatoes", 429322666, "That may actually be why they’re my favorite food. I had a bunch of complications with my tonsillectomy recovery, couldn’t keep food down, and lost a LOT of weight. So when I was finally able to eat those mashed potatoes, they tasted AMAZING as I was basically starving."], ["potatoes", 903246464218005504, "I’m definitely supposed to be on a little diet. But Potatoes are my weakness ☹️"], ["potatoes", 1203564129551732747, "I saw gguk peeling potatoes and i nearly died laughing🤣 and he so cute https://t.co/84gxLBJ98S"], ["potatoes", 1099330666397868035, "RT @YaBoiBarrier: @_tasiams @nemo_812 i like subtitles more than dubbing. Whoever disagrees freely block me"], ["potatoes", 16877302, "RT @DundeeAndAngus: From wonky potatoes to award winning vodka and coo’s booze, we’re hearing more from @ogilvyvodka about how they’ve made…"], ["potatoes", 1222345957523755011, "@Midnight4Chris Egg, potatoes ,and tomatoes are gross anyway I rest my case"], ["potatoes", 429322666, "Fun fact: I’ve been mixing it up lately, but until recently, I ate mashed potatoes for breakfast every day for like a decade. I started when I got my tonsils out the summer before college (2004) because it was the only thing I could eat, and just kept it up."], ["potatoes", 1023613977069322245, "boston market sweet potatoes 🥰"], ["potatoes", 2884796303, "RT @DundeeAndAngus: From wonky potatoes to award winning vodka and coo’s booze, we’re hearing more from @ogilvyvodka about how they’ve made…"], ["potatoes", 783679072039759872, "@marcorubio Read the room Marco - either stand up aced do something about what's going on at the DOJ or stfu. How'd that for tone?"], ["potatoes", 185243161, "I keep waking up in the middle of the night thinking I can eat mad kitkats and crunch bars.... have to eat more sweet potatoes to even out the sweet tooth 😭😭😭"], ["potatoes", 1022365752702263296, "How do you guys cook your mash potatoes? Boil the potatoes as is or peel them before boiling?"], ["potatoes", 2835657799, "RT @khurramamalik: Global frozen potato consumption stood at $106 bn (117 mn tons) in 2017. China (37%), India (31%), US (13%) &amp; Pakistan (…"], ["potatoes", 503231143, "RT @MothershipSG: Even potatoes look good with make up https://t.co/SLTCc6iEBs"], ["potatoes", 1032053917700501504, "RT @incorrectbucko: steve: [making mashed potatoes] it just feels like you don’t trust my cooking \n\nbucky: [also making mashed potatoes] do…"], ["potatoes", 1733073734, "RT @rachelcooksblog: These Instant Pot short ribs are fall-off-the-bone tender in less than an hour under pressure, and the best part is th…"], ["potatoes", 1098062971278770176, "RT @Chitrakshvij: Me to Twitter , GTA 5 , Chilli potatoes , Friends , Chocolates Etc 😍😍😍"], ["potatoes", 737593497813811200, "To make satisfying flour pie, fry biscuit with potatoes"], ["potatoes", 548768664, "RT @kathryninman9: @Tiff_researches @d_ast777 @EdwardSelender @HLNida2 @CornerWriting @TTBanks5 @Ltward2 @zoeallisonauth1 @TaiGrice @WriteE…"], ["potatoes", 768760330545692672, "Treat yourself with our delicious chicken breast, stuffed with sauteed vegetables, mashed potatoes &amp; garlic bread. 🍗 https://t.co/COjthrv2z3"], ["potatoes", 305709857, "These Instant Pot short ribs are fall-off-the-bone tender in less than an hour under pressure, and the best part is the mashed potatoes cook AT THE SAME TIME in the Instant Pot! Recipe: https://t.co/WxqoTL8ag2 #shortribs #instantpotshortribs #instantpotmashedpotatoes https://t.co/zCA0mzCN6a"], ["potatoes", 3354762412, "@Baek_potatoes well..I guess I expected too much :/"], ["potatoes", 320653614, "RT @LAIKAKENYA: First time in Scotland I was asked if I've ever had tates and I confidently said no. Turns out tates are actually potatoes…"], ["potatoes", 1184236530262564864, "RT @kageyuwu: bakugou making dinner: ...don't look at me like that\n\ntodoroki watching him perfectly peel potatoes: you amaze me"], ["potatoes", 3594102202, "RT @_traplordtaylor: Sometimes my body feels like mashed potatoes"], ["potatoes", 2805831062, "@Foxfire40900590 @cor_solitarius Drop the rest of you like a sack of potatoes! 😅 https://t.co/mfVIqWEfHv"], ["potatoes", 1203430688042684416, "RT @kageyuwu: bakugou making dinner: ...don't look at me like that\n\ntodoroki watching him perfectly peel potatoes: you amaze me"], ["potatoes", 167491804, "@twtduk Well you didn't Billy Big Potatoes 👌\nYou are in the third division because you deserve to be so deal with it!"], ["potatoes", 58605927, "@anichollsmay @Kazzzy1969 @darrengrimes_ She must be an interesting person, I assume the international bank refers to a dig on a river bank somewhere, Harry Potter sends most people to sleep.\nReason for the potato episode.\nhttps://t.co/LZdzCRkyKq"], ["potatoes", 429322666, "😺✏ — Oh this is a tough one! I am very enthusiastic about food in general.\nProbably mashed potatoes? They’re so comforting and make me feel better even when I’m sick.\nI also really love artichokes,… https://t.co/Vz6fVwc63b"], ["potatoes", 26356727, "RT @JuliaDJordan: {{NEW}} Cauliflower Mashed Potatoes with Horseradish is a great option when you're watching your carb intake https://t.co…"], ["potatoes", 92833060, "RT @RobertH64978247: Canadian Agriculture day from PEI , my granddaughter Ollie picking PEI quality potatoes.  #Canagday 2020 https://t.co/…"], ["potatoes", 334772129, "damn i should’ve got some small red potatoes yesterday. but too bad don’t feel like going to the store again. lmfaooooo i got regular potatoes. i’ll cut them putas up for dinner instead."], ["potatoes", 2413466281, "@estarianne Pirogies, turtle blood soup, and brown liquor for me on my mom’s side. Potatoes on Dad’s."], ["potatoes", 2253610345, "Can we just have a moment before the #SONA #SONA2020 https://t.co/Ds5DrSch1Y"], ["potatoes", 586028263, "It sucks if you want to not end up looking like mashed potatoes 99% of your meals have to be unenjoyable."], ["potatoes", 593614031, "@Neerajkalia @INCIndia Bought today at 28 rs per kg and potatoes at 22 rs per kg"], ["potatoes", 783679072039759872, "@marcorubio @POTUS Yeah when the president is actively perverting the course of justice you'll have that."], ["potatoes", 4276321541, "Reminder: Due to INSET Day on Friday 14th February, Fish &amp; Jacket Potatoes will be served on Thursday 13th February 2020 instead."], ["potatoes", 570369724, "RT @ultraleap: It's a big and buzzy show, #CES2020. Find out what our CTO, @iamtomcarter,  discovered about the latest trends in #automotiv…"], ["potatoes", 32496167, "Spanish lunch #spanish #lunch #tapas #albondigas #chorizo #tapadeltoro #torvehallerne #copenhagen #foodmarket #denmark #spanishfood #tomatosauce #spicy #manchego #cheese #deepfried #potatoes #papasbravas #aioli @… https://t.co/MDs5qTtVpV"], ["potatoes", 1135924015116296192, "RT @incorrect_oneus: [preparing dinner] \n\nkeonhee: (making mashed potatoes) it feels like you don't trust my cooking \n\nseoho: (also making…"], ["potatoes", 862168244, "Fried potatoes https://t.co/7pbqEJiKsT"], ["potatoes", 939840014, "@NicoleTNicolas I prefer working out on an empty stomach, but if you can’t do that then potatoes/sweet potatoes or bananas, also milk and oats, post workout mostly tuna/omelette and oranges."], ["potatoes", 713127503351713793, "RT @Louise49153139: @tyler_casper Why just why do you need to know that? I eat mashed potatoes and peas with a knife though."], ["potatoes", 1172836347943489536, "@Rehune South America. Like potatoes. Another thing that feels massive European."], ["potatoes", 286280714, "thinking about mashed potatoes and only mashed potatoes today"], ["potatoes", 2438050626, "@omardemosul I think the origin of potatoes is from Latin America, specifically in Peru"]]