[["potato wedges", 315512206, "@daisyguwap You must’ve not  had dem potato wedges recently 😂but I feel you doe ima stop what I’m doin"], ["potato wedges", 1026600091057041408, "@dettlefff steak fries are just really thick-cut fries. like potato wedges. they're usually baked instead of fried and sometimes they're seasoned."], ["potato wedges", 894947366448406528, "@EllieDogmovies who the fuck counts potato wedges as fries is what i want to know"], ["potato wedges", 1148159360876474369, "today i tried to purge in the school toilet after regretting eating some potato wedges but then i was afraid that someone could hear me so i left lmao"], ["potato wedges", 3154865482, "potato wedges can be ok but as the utmost authority on fries they fucking arent fries and if i go somewhere and order fries and potato wedges are brought out i am instantly upset"], ["potato wedges", 3154865482, "upon investigation subway japan does have fries but theyre oven baked potato wedges and ill fucking fight you with my fists if youre going to tell me thats still a french fry"], ["potato wedges", 339542327, "RT @milktpapi: potato wedges: https://t.co/Ijeoo8UylI (forgot pepper SMH)\nasparagus: https://t.co/9wSy8xI1jb\nmusic: lakey inspired - chill…"], ["potato wedges", 2740713972, "Today's Menu February 11th\n\nLUNCH\nSlider Bar/Hot Dog\nPepperoni Rigatoni\nTurkey &amp; Cheddar\nTater Tots\nAssorted Veggies\nRolls\n\nDINNER\nPizza Bar\nCarved Roast Beef\nBBQ Pork Sandwich\nCk Nachos\nPotato Wedges\nAssorted Veggies\nRolls"], ["potato wedges", 813147433291186181, "@Pugi80350348 Pretty good I got a honey butter chicken biscut and some potato wedges also an oatmeal bar all were pretty dang good"], ["potato wedges", 1007118161345253376, "WEIGHTS FARTING, AZURE GROSS DIARRHEA. CLEAN AIR POOED ON HOMEBREWING POTATO WEDGES HOME HEALTH OF DIARRHEA AGAIN HE WOULD PINE CONE POO DATING WE CANNOT LOOKING FOR VITAMIN SMURF IT'S TIME, ANYBODY PLAY CONSTIPATION KNOW THAT LILY THE COMIC BOOK, THEM TOGETHER; HIS"], ["potato wedges", 2983041856, "@discocubizm oof....the potato wedges had no right to slap the way they did......."], ["potato wedges", 24836246, "@kjbrackley @CP24 While a big chunk of society eschews sugar and wheat, these idiots double down by making even sweeter, cakier things. Oh, and nasty baked potato wedges. Ew."], ["potato wedges", 881730958805925888, "i could go for some french mcdonald's potato wedges with some french burger king mozzarella sticks"], ["potato wedges", 3005861470, "Wednesday we are having Haddock Goujons with Potato Wedges and Tartare Sauce...\nWhy not order this to take away for £5.00? \nPhotos are for illustrative purposes only https://t.co/sw5rHE8ipG"], ["potato wedges", 1544031458, "my job finally has french fries instead of potato wedges and that means i don’t have to starve myself till i get home now !!!!!!"], ["potato wedges", 528140463, "@flinnie @Wendys They do not. Their potato wedges are pretty legit, though."], ["potato wedges", 335484025, "At men’s cooking it’s time for the moment of justice as the lads sit down for today’s meal, roast chicken, potato wedges and butternut squash and celeriac. The silence is deafening as the guys are voting with their forks. Results are in: absolutely delicious! https://t.co/cll5vsTksx"], ["potato wedges", 745879776116772865, "@GalacticGuns [ I want some fries and potato wedges. Not just any fries and wedges though.\n\nBig fat fries and thicc potato wedges with loads of cheese sauce."], ["potato wedges", 2937812245, "Rosemary Sweet Potato Wedges https://t.co/WLk0HVME7s"], ["potato wedges", 997244793293017088, "Greggs potato wedges elite tier"], ["potato wedges", 49507614, "It’s National Potato Lovers Month and the best time to make Spice Rubbed Potato Wedges with Chipotle Mayo\n https://t.co/Tqq6jDSKXt"], ["potato wedges", 1032747757046587393, "RT @AnneSchlegel1: Time to go outside, clear some snow &amp; greet the neighborhood deer!  But first, a cup of coffee, some scrambled eggs &amp; ro…"]]