[["pumpkin soup", 4740441617, "RT @paddingtonbear: The Browns and I have just finished eating the last of Mrs Bird's pumpkin soup. Now it's time to start thinking about m…"], ["pumpkin soup", 1070798321948733441, "@ShiroSirius Pumpkin or leak not both :p though butternut squash soup also &lt;3"], ["pumpkin soup", 23575525, "Leeksoup pumpkin soup!! https://t.co/tYxzilh6eP"], ["pumpkin soup", 158193140, "Ham, Provolone, Lettuce and Mayo on Toasted Brioche. Soup is Cheesburger Soup and Turkey Pumpkin Chili @ Wired Cafe' https://t.co/KLhx9gttqL"], ["pumpkin soup", 82811794, "I even made #AlmostAccidentlyVegan pumpkin soup to celebrate! Sorry about the terrible picture, I think I was too tired from standing around from making the soup! https://t.co/qNcLGOshha"], ["pumpkin soup", 611652041, "Curried Pumpkin Soup #foodblog #recipes https://t.co/QjT7w7jWF5"], ["pumpkin soup", 704593968, "@herbivore_club Veg rissoles baby spinach avocado salad pumpkin soup home made bread pickles fruit salad with coconut yogurt all yummy!"], ["pumpkin soup", 949059559410339842, "They may not be as good looking as the carrots and turnips in the grocery but they are more nutritious because they were grown in #healthysoil. Using them plus green beans and pumpkin from last year's garden to make turkey vegetable soup. What are you ma… https://t.co/10XsHEQRy5 https://t.co/7ja4XAxvgB"], ["pumpkin soup", 64141082, "Weight Watchers Pumpkin, Potato and Leek Soup Recipe\n\nhttps://t.co/86yb2tO7YA"], ["pumpkin soup", 1214470989200801792, "Link:- https://t.co/LupwNFEpCX\n\n#food #foodies #foodporn #recipes #recipe #soup https://t.co/zh0zHU4VXR"], ["pumpkin soup", 881607579968974848, "I just ate chicken&amp;pumpkin soup! I liked this a few weeks ago, so Mom tried it again. Maybe I like soups more than cans. 🤔\nTomorrow I will try pate. Maybe I'm going to like it more than meat chunks.\nThis month is gonna be a trial for several kind of things! It'll be fun! 😸 https://t.co/3GuHRojwkq"], ["pumpkin soup", 1188139623328956418, "RT @hanbinahh: #Ask_iKON Bobby who you eat the rice soup with?? https://t.co/3UphYUul2C"], ["pumpkin soup", 470766921, "legitimately thought it said soup im so embarrassed. i was originally gonna leave it at \"pumpkin\". pumpkin soap.."], ["pumpkin soup", 368568916, "RT @1RealTintin: 3bunabunu soup be nonsense give you? that girl ankasa she doesn’t have sense"], ["pumpkin soup", 414543968, "RT @Tiniwana: I just want someone to visit me and stroke my head to be honest. That’s it. With some pumpkin soup."], ["pumpkin soup", 1151780268736483328, "RT @streetdocc: For some reason i also hated and still hate pumpkin but tasted the pumkin soup at my grandmas bday...wallah it was fire htt…"], ["pumpkin soup", 1187033799923769345, "Made a nice soup for later pumpkin,yam,carrots,cabbage,onions,tumeric,pepper,potatoes,few pasa twirls,yum."], ["pumpkin soup", 2749957430, "Haven't got much time to cook?🎃 This recipe is as quick as it is nutritious and you only need 4 ingredients #cookingwithsaffron https://t.co/VE70uf6PQW https://t.co/M3VkfXEGxQ"], ["pumpkin soup", 25965787, "#Vegan Noodles in Authentic TomYam Soup topped with fried Seaweed, Tofu, Mushrooms, long Bean, Sprouts, Pumpkin, Peanut and Red Onion. #deliciousveganfood @ Veganerie Silom https://t.co/LqBoHWdBH7"], ["pumpkin soup", 1857872808, "RT @Tiniwana: I just want someone to visit me and stroke my head to be honest. That’s it. With some pumpkin soup."], ["pumpkin soup", 4175328917, "Is it ‘on route’ or ‘en route’? And is it ‘en route’ or ‘en roeute’? AND is it ‘en roeute’ or ‘cron root’? AAND IS IT ‘CRON ROOT’ or ‘TASTY PUMPKIN CROUTON SOUP’??"], ["pumpkin soup", 137760092, "I just want someone to visit me and stroke my head to be honest. That’s it. With some pumpkin soup."], ["pumpkin soup", 6199452, "@wEzRfpAtbfO0qe7 I invested in a hand blender and just played “Will it blend?” with everything 😅\n\nHere’s a couple I posted online, I also made a really nice garlic sautéed mushroom soup, creamy pumpkin soup with coconut milk curry, apple sauce, strawberries blended in cream, etc https://t.co/6AudlNvZcN"], ["pumpkin soup", 1189767938129178624, "A morbid meal would be a evil morbid spooky squash dip, with a main course of a creepy pumpkin spice pumpkin and ghoulish iced pumpkin soup with a side of cursed spiced fries, *evil laughter*"], ["pumpkin soup", 1192538432435654656, "Lentil, rice, pork and veggie soup, pumpkin bread and cookies for dessert. I'm so happy to have full use of a functioning kitchen again, I don't even mind the gluttonous belly ache that came from one too many bites of baked goods."], ["pumpkin soup", 851968248065163266, "@NoEasyMode Yeto's Superb Pumpkin Soup: \"Finally, some good fucking food\""], ["pumpkin soup", 716698484, "⭐EASY PUMPKIN SOUP⭐\n Repost @twospoons.ca  \nYumminess to heat you right up! 🎃\n It’s a simple recipe using cooked pumpkin, potato, and canned coconut milk. Topped with crunchy roasted chickpeas and kale. . https://t.co/T9HDkM9MgA"], ["pumpkin soup", 2423556336, "my inability to get pumpkin soup to the perfect temperature will forever be my greatest flaw"], ["pumpkin soup", 963007243821223936, "RT @EskayCaterers: Cream of Pumpkin soup with breadfruit stick topped off with sprout and tomatoes\n#Soup #Pumpkin #Breadfruit #Eskay https:…"], ["pumpkin soup", 1026142142371164165, "RT @Sarah_Arabella: it is soup time"], ["pumpkin soup", 951634286960152576, "@brandi_love I've seen the finished product of those soups and I'm still waiting on that pumpkin soup recipe and the Thai soup recipe. Lol"], ["pumpkin soup", 2690679232, "RT @prophethusband: breakfast: black coffee, overnight oats with sunflower &amp; pumpkin seeds\n\nlunch: lentil soup with carrots and onions, zer…"], ["pumpkin soup", 621577868, "Cream of Pumpkin soup with breadfruit stick topped off with sprout and tomatoes\n#Soup #Pumpkin #Breadfruit #Eskay https://t.co/qhAdeibtkZ"], ["pumpkin soup", 54177282, "@callapilla Did you add orange juice? And a little butternut pumpkin? It makes it infinitely better. But yes, carrot soup still isn't a patch on all other soups"], ["pumpkin soup", 4813044853, "@ashleysochan @ashleysochan hello Ashley, thank you for the shout out! Our pumpkin soup is available today... for you, it’s on the house! 😁 just show this tweet to the cashier 👍 refill to your heart’s content 🥰 bon appétit!"], ["pumpkin soup", 910131392037756928, "@Cinnamonbyte Pumpkin corn soup? 🤔"], ["pumpkin soup", 3091083606, "\"I'll make you into a burrito with all the blankets in the world. I'll even make some soup for you, Pumpkin. You're going to be taken care of.\" https://t.co/4LKK9rGh8u"], ["pumpkin soup", 194816714, "@komorybatbat You're good with pumpkin too, right? https://t.co/DNpyINWP4t"], ["pumpkin soup", 1190966754262048768, "I M  HUNGRY \n\nI wish there is:\n\n*Rice and baobab soup🍲\n*Bread and fresh bland okra 🍞\n*Tea of lemon and fresh egg☕\n*Kunun carrot 🍶\n*Porridge garden egg🍛\n\nIf there is no Teem,  smoov or Limca I will manage Pumpkin juice 🍷\n\nGood night 🌚"], ["pumpkin soup", 70315912, "The food... had salmon, lamb, pumpkin soup, new york cheesecake, apple crumble, eggs, bacon, charcuterie, hash browns, turkey/swiss sammiches, bagels, lots of coffee, OJ/AJ, tea etc. Better than I eat at home 🤫☺️\n\nAll included with a stay. @mountengadine #explorealberta #hosted https://t.co/TwTcvJwXdm"], ["pumpkin soup", 1018086888563970054, "Pumpkin soup! https://t.co/YfGvrsZrwH"], ["pumpkin soup", 1189767938129178624, "A unearthly meal would be a evil evil morbid apple chili, with a main course of a shadowy crushed lemon and cursed pumpkin spice candy corn pasta with a side of unearthly lemon soup, enjoy!"], ["pumpkin soup", 587721065, "Creamy Pumpkin Soup https://t.co/HV8fTdzQFh https://t.co/pi9ADbPqhy"], ["pumpkin soup", 197473185, "Chicken soup with pumpkin, carrot etc \n#pastaprincesscooks #pastaprincess\nCOOK4U! #chickensoup https://t.co/mmUHhzdgBu"], ["pumpkin soup", 2950027827, "No one : \n*Baba treating me like a child*: Eat pumpkin soup and I will give u a gift."], ["pumpkin soup", 1195491406409879552, "I made the shit out of this pumpkin soup .. not tryna really share except for people to taste it so they cant have any. 😁"], ["pumpkin soup", 1189767938129178624, "A ghoulish meal would be a diced vanilla and creepy roasted candy corn soup, with a main course of a cursed haunted spooky unearthly leaf harvest bowl with a side of unearthly pumpkin fries, muhahahHAHAHAHA"], ["pumpkin soup", 772732886785134596, "RT @BUDiningService: Thai Sweet Sticky Rice Pudding, Vegan Pad Thai and Thai Pumpkin &amp; Coconut Soup - what more could you ask for at dinner…"], ["pumpkin soup", 915896578585620480, "Year 1 have been working in groups to retell the story of Pumpkin Soup. They used great expression in their voices! #achieving https://t.co/Mv4OOZ0y1q"], ["pumpkin soup", 948239769657643008, "New post (Fresh Pumpkin Soup | Tasty Kitchen: A Happy Recipe Community!) has been published on The Healthy Cooking Source - https://t.co/qWNwGPdPRT https://t.co/zilgUfczhL"], ["pumpkin soup", 954913148645138432, "Soup of the day.. Autumn Squash!  Perfect mix of butternut, pumpkin, and a touch of brown sugar!  #soupoftheday #beansandboards"], ["pumpkin soup", 18787640, "Thai Sweet Sticky Rice Pudding, Vegan Pad Thai and Thai Pumpkin &amp; Coconut Soup - what more could you ask for at dinner tonight? Join @1weekbu in any Dining all tonight for these delicious meals 😋 https://t.co/E8i5jfx8dg"], ["pumpkin soup", 158193140, "Chicken Salad Wrap with Cheddar and Lettuce. Soup is Homemade Cheeseburger Soup and Homemade Turkey Pumpkin Chili @ Wired Cafe' https://t.co/vLREJmF2wr"], ["pumpkin soup", 791701379370913792, "My pumpkin soup is the best T_T feeling happy"], ["pumpkin soup", 425412082, "Today our #lunch special is our famous Pumpkin Soup - In a creamy coconut broth topped with scallions and toasted coconut, served with jasmine rice! #vegan #glutenfree https://t.co/JNJA0CmyMI #bamboozlecafe #tampa https://t.co/Y0UDzl0i2E"], ["pumpkin soup", 73269222, "#Chayote soup, roasted cilantro seeds and #pepitas, pumpkin seeds\nhttps://t.co/6ovsIjrYb1"], ["pumpkin soup", 772546795788341248, "@KaitlynEKeller Chicken salad made with a special aioli. (Half sandwich with savory pumpkin soup.) Favorite eating place is the 'Sandwich Club!' https://t.co/bOcxHGu3CZ"], ["pumpkin soup", 995567731004108800, "@tyler_casper Pumpkin Soup 🍲"], ["pumpkin soup", 510706710, "RT @StubbyMovie: Join Gaston 👨‍🍳 and family as they make a delicious pumpkin soup 🍲, perfect to warm up with on a cold winter night ❄ ! Fin…"], ["pumpkin soup", 2192763823, "This is the type of weather that makes you want to enjoy a nice bowl of soup. 🎥 - Our Zuppa del Giorno (soup of the day), spicy pumpkin and crab soup.\n.\n.\nIf you don’t want to leave the warmth of your home, remember… https://t.co/DTUl60uaTl"], ["pumpkin soup", 965383776690847745, "RT @madeiraglow_kel: I had to make a soup once with coconut milk, a pumpkin, a capsicum, shallots, some spices and chick peas..."], ["pumpkin soup", 1103285130578329601, "Hassan likes soup leftover (don't worry it's cold by now. Apple-pumpkin, no harmful spices. 100% selfmade). 🥺💕 https://t.co/Ok8D9xthRo"], ["pumpkin soup", 184397259, "Lunch 12-3 pm 🧀👩🏻‍🍳\nSoup-Coconut &amp; pumpkin \nMain-Parsnip &amp; potato purée, roast beetroot, grilled cavolo nero &amp; butter sauce\nToastie-Cheddar &amp; kimchi\nBon appetite! 🧄"], ["pumpkin soup", 924964615242616832, "Our lovely new February set menu starts today! Pop in to try our gorgeous new dishes such as this roast parsnip soup with honey and lemon dressing and toasted pumpkin seeds! 😋               Two courses for £12.95 or… https://t.co/JNDN0eGHBT"], ["pumpkin soup", 740177410969083905, "I had to make a soup once with coconut milk, a pumpkin, a capsicum, shallots, some spices and chick peas... https://t.co/z1YW8BSMcC"], ["pumpkin soup", 1656099594, "Logann Patrick quizzing her class about the Pumpkin Soup book (November 6th, 2018) https://t.co/0ovAWFqAsT"], ["pumpkin soup", 779149022, "RT @MikePaineShow: After watching How to make Hobakjuk (Korean Pumpkin #Soup / Porridge) I think I could eat this every day! https://t.co/j…"], ["pumpkin soup", 963007243821223936, "RT @MikePaineShow: After watching How to make Hobakjuk (Korean Pumpkin #Soup / Porridge) I think I could eat this every day! https://t.co/j…"], ["pumpkin soup", 701491647742234625, "RT @DesertRoseReads: @HorrorFanRyan Alright. So here’s mine. Pumpkin pie is the best. Tomato soup is disgusting. Dill pickles go great with…"], ["pumpkin soup", 1130245830, "After watching How to make Hobakjuk (Korean Pumpkin #Soup / Porridge) I think I could eat this every day! https://t.co/jNODcmi8PM"], ["pumpkin soup", 1177659355316908034, "@HorrorFanRyan Alright. So here’s mine. Pumpkin pie is the best. Tomato soup is disgusting. Dill pickles go great with mac n cheese."], ["pumpkin soup", 2312683382, "RT @GhouliaChilds: PUMPKIN Soup via The Pioneer Woman.\n#GhastlyGastronomy https://t.co/ZJWqvUiGZp"], ["pumpkin soup", 190906140, "Lunch at @taladwat with a friend from Spain and damn, this place is good. Clockwise from top right: turmeric chicken curry, pad prik khing pork belly, galangal soup, stir fried pumpkin with egg. #thaifood https://t.co/Ontw7cwZa9"], ["pumpkin soup", 1195491406409879552, "Made some bomb ass pumpkin soup"], ["pumpkin soup", 3223713260, "Spiced Pumpkin Chicken Noodle Soup is a remix of the classic and full of fall flavors. Paleo, low ca https://t.co/zdiYeDVDRI"], ["pumpkin soup", 891852142415409153, "Porridge, any seafood, pumpkin, peas soup and breadfruit https://t.co/Xg2hAExv4L"], ["pumpkin soup", 21820429, "@drugstoredivas @FoodTravelChat Soups galore 🙋\n\nI drank quite the variety during the winter (especially last month when I went vegan for a whole month🙋\n\nHad:\n\nBroccoli\nCarrot\nAsparagus\nCauliflower\nPumpkin\nMushroom\nTortilla\nPea soup and more!\n\nHealthy, delicious, filling &amp; easy to make!\n\n#FoodTravelChat #food https://t.co/HGbNIYyAkF"], ["pumpkin soup", 1213326169484840960, "Yesssss I voted\n\nBackwards Pumpkin Song\nSurprise! I'm from Cuba\nBuffalo!\nMe and Zoloft\nHot Water on Wool\nRock Solid\nTree Village\nNASA\nSelf-Trepidation \nSpooks\nHeat Seeking Ghost of Sex\nPreviously Poncheesied\nSwan Soup\nAcceptance Speech\nHoney Revenge https://t.co/vKWtv9MGo7"], ["pumpkin soup", 274073434, "@NECROMANClNG Pumpkin Soup - Kate Nash 👏🏼"], ["pumpkin soup", 890177559291473920, "@kaiihun thank you, my pumpkin soup! ♡"], ["pumpkin soup", 32425552, "Given the news of the day, I planned the best meal -- homemade chicken noodle soup with pumpkin muffins. Sometimes you just need a little comfort food."], ["pumpkin soup", 4057805847, "RT @withlovegab: My dad whose cooking resume doesn’t go further than grilling &amp; frying things is out here making pumpkin soup https://t.co/…"], ["pumpkin soup", 105624533, "My dad whose cooking resume doesn’t go further than grilling &amp; frying things is out here making pumpkin soup https://t.co/QaxUPS5q1D"], ["pumpkin soup", 2191283203, "ladies i didnt like this pumpkin soup at first but i added some salt and pepper to make it less sweet and tbh it kinda slapped\nheres hoping it helps my stomach"], ["pumpkin soup", 23445422, "Warm your soul with this uniquely  delicious Paleo Pumpkin Sausage Soup recipe (*say that 5 times fast 😉)! A huge thank you to Chef Gabriella Mezanava @beyondthebite for sharing🤍 \n\n-\n\nThis recipe brings savory and a… https://t.co/FqXnqueKiv"], ["pumpkin soup", 44320897, "Kate opts for the suaver pumpkin soup. https://t.co/lFUsN6xTEu"], ["pumpkin soup", 224462789, "PSA: pumpkin soup will make your whole house smell like farts if not frozen immediately."], ["pumpkin soup", 490790309, "[ WKDfm: Kate Nash - Pumpkin Soup \n https://t.co/nyfKmFiSXC \n Live, Legal and Loud - Internet Radio ]"], ["pumpkin soup", 101736727, "Somebody open a restaurant for idiots the menu categories are like\n\nCheese\n-burger\n-pasta (white)\n-mac (yellow)\n\nBite Size/Finger Food\n-chicken nugget\n-nachos\n-empanadas (veg or meat)\n\nSoup\n-orange (carrot or pumpkin)\n-red\n-creamy (mushroom or clam)\n\nBread\n-with egg\n-french toast"], ["pumpkin soup", 2882955380, "@chiakaos imagine kids taking their little pumpkin shaped bowls around to houses and being given soup... i wish that were me"], ["pumpkin soup", 2904924773, "Join Gaston 👨‍🍳 and family as they make a delicious pumpkin soup 🍲, perfect to warm up with on a cold winter night ❄ ! Find the story (and recipe) at https://t.co/3lwjBb9frl https://t.co/Bm5cHh7Jwr"], ["pumpkin soup", 1108093110905643010, "RT @JWEdwards45: Jamaican curried pumpkin chicken soup with coconut, chilli and coriander #healthy #soup #cleaneating #healthyeating #healt…"], ["pumpkin soup", 3028609084, "Get creative and add some heat to your menu with this recipe for Thai-Inspired Pumpkin and Basil Soup https://t.co/Kw6bu4hVHG"], ["pumpkin soup", 1027582152, "a ghost’s pumpkin soup - hunnid p https://t.co/jHiFctpXtv"]]