[["puran poli", 713371571151380480, "RT @ANI: IAS officer Rajiv Bansal appointed Chairman and Managing Director of Air India. https://t.co/jAbiD6efCY"], ["puran poli", 713371571151380480, "RT @iMac_too: Shah on media's role in pro-CAA rallies versus anti-CAA protests https://t.co/bYIefelvTM"], ["puran poli", 713371571151380480, "RT @kashmiriRefuge: Watch : @narendramodi Recounts the Status of His Promises in the Manifesto in the most Epic Manner. \n\nThe best one at e…"], ["puran poli", 713371571151380480, "RT @Iyervval: Imagine such a meltdown for one tweet by the Foreign Minister on #SardarPatel ... I’m just waiting for #KemChoTrump, its goin…"], ["puran poli", 713371571151380480, "RT @swati_gs: I recently visited Bhainsa, a town in Telangana, that saw major communal violence in January. The state govt is trying to hus…"], ["puran poli", 713371571151380480, "RT @BesuraTaansane: @_sabanaqvi Saba-when will u stop posting \"Nakli\" tweets 😂 ? \n\nIf the Girl is an Afhgan refugee &amp; has applied for citiz…"], ["puran poli", 713371571151380480, "RT @TimesNow: #TimesNowSummit | The diff between 'Jai Shri Ram' &amp; 'la ilaha illa Allah' is that the former says victory to Lord Ram &amp; the l…"], ["puran poli", 142328025, "@neha_aks It became a bit of Irony because her surname is “ Chaturvedi “.  This guy is numbnuts as well- Vedas and couple of Purans- Lol. Somebody should tell him this is not easy as eating Puran poli ( sorry PJ 😜)"], ["puran poli", 713371571151380480, "RT @MEAIndia: In honour of the legacy and decades of public service of Smt. Sushma Swaraj, it has been decided to rename Pravasi Bhartiya K…"], ["puran poli", 713371571151380480, "RT @krishna_hande: @DrSJaishankar Miss her too. https://t.co/exLnfCQThW"], ["puran poli", 713371571151380480, "RT @DrSJaishankar: Glad to announce that the Government has decided to rename Pravasi Bhartiya Kendra as Sushma Swaraj Bhawan and Foreign S…"], ["puran poli", 713371571151380480, "RT @DrSJaishankar: We all fondly remember Smt Sushma Swaraj, who would have turned 68 tomorrow. The #MEA family misses her in particular."], ["puran poli", 707386962, "RT @MiniRib: Food lovers in Pune. If Veg  snacks like poha, upma, kothimbir vadis, sabudana vada, parathas and sweets like ukadiche modak,…"], ["puran poli", 45797411, "Food lovers in Pune. If Veg  snacks like poha, upma, kothimbir vadis, sabudana vada, parathas and sweets like ukadiche modak, puran poli and sheera. are what you want for parties or family/ corporate gatherings, look no further. Call Ketkars on JM Road, Pune"], ["puran poli", 68127802, "@hitlerbai I was just in next coach and  what I saw was mind blowing a south Indian guy sitting next to me was eating puran poli."], ["puran poli", 713371571151380480, "RT @ANI: J&amp;K Chief Electoral Officer, Shailendra Kr: From now onward,  Model Code of Conduct is enforced &amp; it will be implementable in all…"], ["puran poli", 2210065701, "I want puran poli"], ["puran poli", 713371571151380480, "RT @vikrantkumar: Ye kis angle se interview hai...? \nItna insult wo bhi live?😬\nhttps://t.co/deqCR8eigu"], ["puran poli", 713371571151380480, "RT @majorgauravarya: Deeply honoured to shake hands with Lt Gen PD Bhargava (Retd). Known as “Speedy” in the Indian Army, he was responsibl…"], ["puran poli", 713371571151380480, "RT @ANI: Supreme Court directs political parties to upload on their websites the reasons for selection of candidates with criminal antecede…"], ["puran poli", 713371571151380480, "RT @DrSJaishankar: Our Embassy @IndianEmbTokyo is in constant touch with the crew &amp; passengers of #DiamondPrincess off Yokohama, Japan, ren…"], ["puran poli", 713371571151380480, "RT @Being_Humor: According to a conspiracy theory.. @ArvindKejriwal wanted Sisodia to lose and made all efforts in that direction. \n\nKejriw…"], ["puran poli", 713371571151380480, "RT @iMac_too: Kamalnath &amp; Momota are against Tribals being treated as Hindus. That's Nehruvian establishment stand since independence. Also…"], ["puran poli", 713371571151380480, "RT @goyalsanjeev: \"What we did in last 8 months, is just 'sample' .. Actual 'action' to start now\" &lt;&lt; Says @narendramodi!\n\nOh boy, this mus…"], ["puran poli", 713371571151380480, "RT @MAJORshailendra: Soldier’s Commitment! \n\nAll gave some \nSome gave ALL \n\nJai Hind Ki Sena 🇮🇳 https://t.co/xVdkeKKn5K"], ["puran poli", 713371571151380480, "RT @aparanjape: Tribute ceremony for victims of 2010 German bakery bomb blast in Pune \n\nhttps://t.co/sx68sJLANv \n\n#GermanBakery #Pune"], ["puran poli", 713371571151380480, "RT @ajitdatta: So this happened today. Take a bow Ranga Uncle @ARanganathan72\nhttps://t.co/cPZB3rfc00"], ["puran poli", 713371571151380480, "RT @narendramodi: Working towards building a tax compliant society and also one where harassment by officials is zero. https://t.co/ew0kd2f…"], ["puran poli", 713371571151380480, "RT @MrsGandhi: Electricity department disconnected the electricity connection of former UP CM Mayawati's brother, Anand Kumar, due to non p…"], ["puran poli", 1519463138, "@SandeepMall Puran Poli is damn tasty...it's been 6 mths i had and now feel like having it again. Yaad dila diya aapne:-)"], ["puran poli", 713371571151380480, "RT @heyyparth: Dear @narendramodi the way you are explaining the Budget and economy at the #TimesNowSummit, wish your ministers &amp; spokesper…"], ["puran poli", 713371571151380480, "RT @ANI: Maharashtra: Anti-terrorism cell and anti-human trafficking unit has arrested 23 Bangladeshi nationals, living illegally in Palgha…"], ["puran poli", 713371571151380480, "RT @gauravcsawant: UN Designated global terror mastermind #HafizSaeed convicted by a Pakistan anti terror court. Breaking on @IndiaToday. H…"], ["puran poli", 713371571151380480, "RT @arunbothra: Even while multitasking your priorities have to be clear https://t.co/xgqab5oCEk"], ["puran poli", 713371571151380480, "RT @SandipGhose: Hearing @narendramodi at #TimesNowSummit one may think he is reading out his own report card - in which he himself has set…"], ["puran poli", 713371571151380480, "RT @MumbaiMirror: #TimesNowSummit: Pay taxes for India's development, says PM @narendramodi\n\nhttps://t.co/YOpCZMInnD"], ["puran poli", 1108142920522035202, "RT @vegrecipeindia: Puran Poli Recipe with step by step photos. Puran Poli is a flat bread stuffed with a sweet lentil filling made from ch…"], ["puran poli", 713371571151380480, "RT @BJP4India: Must watch...\n\nHow the Delhi-Mumbai Expressway will not only reduce the travel time between the two metros to 13 hours from…"], ["puran poli", 713371571151380480, "RT @NagpurKaRajini: Actual action has not started yet hello @_sabanaqvi 🤣🤣🤣🤣🤣\n https://t.co/FjFTyjYy4I"], ["puran poli", 713371571151380480, "RT @dhaval241086: For those claimed that PM @narendramodi did nothing on Development and Governance Issues of India. https://t.co/tRfdOhnd9T"], ["puran poli", 713371571151380480, "RT @rao_nava: Last few months were hard &amp; hectic bcos my moms illness I have to take care of home &amp; job, I feel like exhausted getting home…"], ["puran poli", 713371571151380480, "RT @indiantweeter: 100 acre land for Tirupati Temple in Jammu and Kashmir. 🙏🏼🙏🏼🙏🏼 Reclaiming our land slowly but steadily.  https://t.co/UL…"], ["puran poli", 713371571151380480, "RT @dhaval241086: After #HowdyModi in USA, Get Ready for #KemChoTrump in Ahmedabad at World's Largest Stadium  https://t.co/ewJyITMgzS"], ["puran poli", 713371571151380480, "RT @rishibagree: Shahbaz Khan is an actor and played hundreds of characters and there are thousands of Normal dressed pictures of him avail…"], ["puran poli", 713371571151380480, "RT @TimesNow: #LIVE | There is not even a single instance where AIMIM Chief @asadowaisi spoke about the Dalit prosecution: @ARanganathan72,…"], ["puran poli", 713371571151380480, "RT @LostTemple7: OMG, I challenge you Friends, Even today also you wont find such a beautiful jewels of gold in Market which were those day…"], ["puran poli", 713371571151380480, "RT @ParveenKaswan: From inside we are all same. A mother &amp; a kid. Since we all are just primates. Picture by Frans Lanting. https://t.co/HZ…"], ["puran poli", 713371571151380480, "RT @aparanjape: 13 February, 355 years ago Chhatrapati Shivaji Maharaj took to the sea — his first and only naval expedition — to free the…"], ["puran poli", 713371571151380480, "RT @ValaAfshar: The history of how Silicon Valley became a $2.8 trillion neighborhood https://t.co/PwMXcupKrA"], ["puran poli", 713371571151380480, "RT @himantabiswa: I'm glad to announce the timely completion of construction of new #Assam Bhawan near Salt Lake, #Kolkata by Assam #PWD.…"], ["puran poli", 713371571151380480, "RT @rsrobin1: #VIDEO :  A Pakistan court on Wednesday convictedJamat-ud-Dawa (JuD) chief #HafizSaeed . He was produced in the court with he…"], ["puran poli", 713371571151380480, "RT @narendramodi: Speaking at the #TimesNowSummit. Watch. https://t.co/E3QpkSDz2H"], ["puran poli", 713371571151380480, "RT @PTI_News: Over 50 per cent newly-elected Delhi MLAs have serious criminal cases: ADR analysis"], ["puran poli", 713371571151380480, "RT @smitaprakash: Her life. Her battle. Her eyes. Our collective shame. https://t.co/BhfMAWVWwv"], ["puran poli", 713371571151380480, "RT @dhaval241086: These are the latest photos of Motera Stadium, World's Largest Arena built under @AmitShah's Chairmanship of Gujarat Cric…"], ["puran poli", 713371571151380480, "RT @ANI: Delhi Court resumes hearing on plea of state&amp;Nirbhaya's parents seeking issuance of fresh death warrant against the 4 convicts.Nir…"], ["puran poli", 713371571151380480, "RT @sonalkalra: If you’re yet not fed up of me, here’s something to bug you. My podcast #TensionNot is coming soon. Here’s a promo. \nTime m…"], ["puran poli", 713371571151380480, "RT @PoliticalKida: Chatrapati Shivaji statue removed by \"JCB\" in Shivsena's partner, @INCIndia ruled MP.\n\nBut @rautsanjay61 won't speak a w…"], ["puran poli", 713371571151380480, "RT @RatanSharda55: SP Balasubramaniam donates his ancestral home to #KanchiPeetham for #VedPathshala &amp; #Sanskrit 🙏💐\nhttps://t.co/FKfEZ7RIsX"], ["puran poli", 713371571151380480, "RT @DrSJaishankar: Released an absorbing biography of VP Menon by @narayani_basu. Sharp contrast between Patel's Menon and Nehru's Menon. M…"], ["puran poli", 713371571151380480, "RT @DrSJaishankar: Exercise of writing history for politics in the past needs honest treatment.  \"When Sardar died, a deliberate campaign w…"], ["puran poli", 713371571151380480, "RT @DrSJaishankar: Learnt from the book that Nehru did not want Patel in the Cabinet in 1947 and omitted him from the initial Cabinet list.…"], ["puran poli", 713371571151380480, "RT @KarunaGopal1: I am shocked to hear PM @narendramodi speech on New India - why?Because he just said exactly what I wrote in my article o…"], ["puran poli", 713371571151380480, "RT @narendramodi: Extremely delighted that @POTUS @realDonaldTrump and @FLOTUS will visit India on 24th and 25th February. India will accor…"], ["puran poli", 374081012, "@SandeepMall The puran poli goes well with Amti"], ["puran poli", 1206477414639030272, "@Aanjaneyaa1 @keshda My sister when small visited someone on asking if she will have poli, she said yes, and imagine her despair when it turned out chapati, instead of puran poli.😛"], ["puran poli", 1159016706691362817, "@MonicaKale8 @keshda My tole exactly reversed!\nHere in south they call it chapati ..\nSo while talking here i say chapati against my willas he said, for them poli is puran boli.."], ["puran poli", 22036637, "@ariputtar Ya it’s Puran Poli. Moms from Maharashtra and introduced to the family"], ["puran poli", 713371571151380480, "RT @ShivAroor: There’s hope for the Congress, if the status quo leadership begins to be questioned this way. A small but powerful sign. htt…"], ["puran poli", 713371571151380480, "RT @amitmalviya: In these Delhi elections, for the first time in over 2 decades, BJP+ got 40% voteshare...\n\nIt had managed 32%, 33%, 36%, 3…"], ["puran poli", 713371571151380480, "RT @aparanjape: Two great figures of the 19th century - two individuals who changed history. \n\nBoth were born on this day, 211 years ago.…"], ["puran poli", 713371571151380480, "RT @AdityaRajKaul: #BREAKING: US President Donald Trump on his #India🇮🇳 visit this month: 'We will have millions of people from the airport…"], ["puran poli", 305841137, "RT @shruttitandon: @shiv_tiwari09 @Rajput_Ramesh I love Maharashtrian food though.\nPuran poli specially😻"], ["puran poli", 713371571151380480, "RT @muglikar_: One of the most irritating things is when you see a beautiful concrete road built by the govt and fifteen days later some JC…"], ["puran poli", 713371571151380480, "RT @AskAnshul: Fake currency worth Rs 24 lakhs seized\n\nMan named Javed Shaikh from Thane, caught with high quality fake currency (Rs 2000 n…"], ["puran poli", 713371571151380480, "RT @arunbothra: History and Chemistry are two totally different subjects.\n\nUPSC :  Okay 😎 https://t.co/CUYvz3cpHq"], ["puran poli", 713371571151380480, "RT @aparanjape: Today (Feb 12) is the 278th Janmatithi of Nana Phadnavis - one of the most important figures of Maratha and Indian History,…"], ["puran poli", 713371571151380480, "RT @AskAnshul: India now exports defence products to 42 countries\n\nIsrael, Australia, Finland, Germany, USA, Spain, Sweden, Singapore are a…"], ["puran poli", 713371571151380480, "RT @jgopikrishnan70: @subh_misra The dominance to Central leadership still continues not allowing local leaders to grow...Take case Vijende…"], ["puran poli", 713371571151380480, "RT @ek_aalu_bonda: GN guys ❤\n\n https://t.co/BuJ3IZ3v8h"], ["puran poli", 713371571151380480, "RT @astitvam: Lessons to Karnataka BJP\n1. Modi wave is not enough\n2. Concentrate on local issues\n3. Perform or perish\n4. Infighting will de…"], ["puran poli", 713371571151380480, "RT @ajitdatta: Election after election, people advise the BJP not to fight on national issues as they don't always yield dividends. But the…"], ["puran poli", 713371571151380480, "RT @amitmalviya: After today’s result, as expected, AAP is suddenly not questioning EVMs... \n\nEVMs are bad only when opposition loses polls…"], ["puran poli", 713371571151380480, "RT @sushantsareen: Is this the same Tasleem Rehmani who regularly appears on TV channels like @republic and @TimesNow and prances about as…"], ["puran poli", 713371571151380480, "RT @iMac_too: This is Mustafabad constituency. Till about 18th round BJP candidate was leading 70000 to AAP's 52000. By 23rd round he remai…"], ["puran poli", 713371571151380480, "RT @iMac_too: BJP's central govt regularised \"illegal\" colonies. That's estimated to have benefited 40 lakh people in Dilli. Giving them ow…"], ["puran poli", 124111123, "@rewati_limaye No I think puran poli would be right choice 😝😝😝😜😉😉👍👍👍👍"], ["puran poli", 34906212, "Yum North Karnataka Oota at #Belagavi with my @Vijaykarnataka team.Outstanding nutritious food including very tasty Puran Poli (Holige) @HPKonemaneVK @DevarajMetre https://t.co/cjrbkRtM4i"], ["puran poli", 713371571151380480, "RT @ShivAroor: Congress hasn't just scored ZERO, but lost its deposit in SIXTY SEVEN seats in Delhi. This was a party that was in power for…"], ["puran poli", 713371571151380480, "RT @amitmalviya: AAP won election and Shaheen Bagh protestors have gone home... https://t.co/Kv4xXL57FC"], ["puran poli", 713371571151380480, "RT @dhaval241086: This is very natural and obvious reaction from Veteran AAP Leader, Shree Rajdeep Sardesai. https://t.co/Ptj1WVqqr0"], ["puran poli", 713371571151380480, "RT @abhijitmajumder: From 40.3% vote share under Sheila Dikshit in 2008, Congress has come down to 4%. Story of self-destruction the mother…"], ["puran poli", 713371571151380480, "RT @PresRajapaksa: Heading back home after a successful visit to India. I thank PM @narendramodi, the Government of India &amp; the people of I…"]]