[["quinoa biryani", 109173912, "@quinoa_biryani oh damn, particular product, or a technology as a whole?"], ["quinoa biryani", 1080516515940593666, "@quinoa_biryani There's no Top 3. \nIt's just a glass of Cow's milk every evening.\nAlthough if I feel like adding two more, sometimes I make fruit smoothies and sometimes just fresh fruits.\nOreos are like a guilty pleasure, I only eat them once a month."], ["quinoa biryani", 995548691309051904, "@vinayaravind Bad tech from last 5 years"], ["quinoa biryani", 995548691309051904, "@BabuMoShiite 5:30 PM snacks"], ["quinoa biryani", 995548691309051904, "@MarginalScribb1 Fishes (for eating)"], ["quinoa biryani", 995548691309051904, "@paviraksha I'm surprised nobody has asked for to three varieties of potato yet"], ["quinoa biryani", 995548691309051904, "There are people from &gt; 5 nationalities having breakfast in this Nairobi hotel. The only voices you can hear are American. You're way too boisterous at 7 in the fricking morning, folks.\n\nMy fellow Indians will be just as loud, but at least they have the decency to sleep till 9"], ["quinoa biryani", 995548691309051904, "Most replies seem to be pretty non-controversial here🙂\nMy opinion: promos to build a feud are fine, but promos to build a character are mostly boring. Wrestlers with good skills on the mic can do both together. John Cena (whatever else you think of him) could do it very well https://t.co/ASAdContIE"], ["quinoa biryani", 995548691309051904, "@losabrazosrotos Excellent choices all"], ["quinoa biryani", 995548691309051904, "@losabrazosrotos Top three food items made with potato"], ["quinoa biryani", 995548691309051904, "@MarginalScribb1 It's very rare that you see a sentence written in Bengali orthography but containing not a single Bengali word"], ["quinoa biryani", 995548691309051904, "@Vada_Yakshi top three cities / towns"], ["quinoa biryani", 995548691309051904, "RT @qikipedia: A study by Wijnand A.P. Van Tilburg and Eric R. Igou has shown that adding a middle initial to your name makes you seem smar…"], ["quinoa biryani", 36427373, "@vaniIlaessence @Suchitrawrites You know this is why we are BFFs no? Okay done quinoa biryani it is, made in flaxeed water."], ["quinoa biryani", 995548691309051904, "Increasing lucrativeness and popularity of avocado farming and murders of people trying to preserve wilderness against encroachment from avocado farmers (among others). Not a coincidence.\nhttps://t.co/3K5oPn80kt"], ["quinoa biryani", 995548691309051904, "RT @AlongsideWild: pay attention  https://t.co/yTkAZU9vYz"], ["quinoa biryani", 995548691309051904, "Call me Lemuria because I am Lemurian https://t.co/McfZebyuQZ"], ["quinoa biryani", 995548691309051904, "@BabuMoShiite I did have a classmate whose family used to be half-blonde, but i think they have moved out now.\nOn the other hand, Puducherry preservation is inexorably linked with Auroville politics. The more I get to know it, the more relief I feel that Aurobindo didn't flee to Chandannagar"], ["quinoa biryani", 995548691309051904, "@BabuMoShiite Yes, and their next door neighbours like me would have gotten cheaper liquor there. They really dropped the ball"]]