[["rainbow fruit salad", 2281148012, "RT @ElkhornPS_HR: Congratulations to our Hillrise Future Chef's finalist!\nHe will be preparing his rainbow fruit salad at EHS on March 5th.…"], ["rainbow fruit salad", 4821897641, "@awright4645 @cashandcarrots @Rosewood_Farm @AbiReader @StevenE27976789 @AnankeAion @AIMS_Meat @SoilAssociation @GeorgeMonbiot It's possible to eat a very healthy and varied vegan diet with minimal cooking - as I do because I'm so lazy! E.g. Breakfast: muesli with fruit; Lunch: rainbow salad with lots of seeds/nuts &amp; bean/lentil sprouts toppings, tahini dressing; Dinner: stir-fried with UK quinoa."], ["rainbow fruit salad", 1080917021905338368, "RT @MACEIreland: 'Rainbow Fruit Salad' served with a smile 🥝🍌🍓 Choose the Right Options from MACE. https://t.co/vrcgwI6IfN"], ["rainbow fruit salad", 1001540592789319684, "@MosaicPrep Prek 2 learning about Rainbow Fruit Salad during Healthy Heart Week!  @LizBC1908 came by our class to read us a story about fruit salad and remind us that we need to eat healthy every day!  Thank you @LizBC1908 for coming to see us! We love and miss you! https://t.co/oYb1mVLypd"], ["rainbow fruit salad", 917524024661544962, "Congratulations to our Hillrise Future Chef's finalist!\nHe will be preparing his rainbow fruit salad at EHS on March 5th.  Judging will begin at 5:30, please come and support our finalist. #EPSAchieves #HillriseBetterTogether https://t.co/HFtRDpokpw"], ["rainbow fruit salad", 2832507300, "RT @Faith_EYFS: This week Nursery have been learning about the importance of a balanced diet. Today we made a delicious rainbow fruit salad…"], ["rainbow fruit salad", 2293539980, "RT @Faith_EYFS: This week Nursery have been learning about the importance of a balanced diet. Today we made a delicious rainbow fruit salad…"], ["rainbow fruit salad", 1138065608447315969, "This week Nursery have been learning about the importance of a balanced diet. Today we made a delicious rainbow fruit salad for snack :) https://t.co/iESux2BlNw"]]