[["rice pudding", 814759154, "RT @CeylanWrites: Salep in the NYT: \" Homesick Turks dream of real salep, which is something like a cross between hot chocolate and rice pu…"], ["rice pudding", 2707000530, "Feb 6th: Fried or Greek Chicken, Dr Pepper BBQ Meatloaf, Chicken Gizzards &amp; Livers, Mashed Potatoes, Rice, G.Beans, M.Greens, Sweet Potato Cass., Squash Cass., Lima Beans, F.G.Tomatoes, Broccoli Salad, Banana Pudding, Pecan or Lemon Pie. \n\n#farmersmarketcafe #seemgm #mymgm https://t.co/TCIGfR4YET"], ["rice pudding", 412729808, "@NickCohen4 @ArrosQD Rice pudding and then bed."], ["rice pudding", 2469432317, "RT @TildaChef: On the eve of @ZestQuestAsia 2020 we're celebrating our current champions @NewCityCol! The team stormed our 'Best Use of Ric…"], ["rice pudding", 14638577, "@manekallegonde Rice pudding"], ["rice pudding", 2412541122, "@MinxGenie I used to love cold baked beans, or cold canned rice pudding, as a late night snack back in sunny Borehamwood. Still have a can of Curried baked beans, way outdated. But they don’t go off.😀🇨🇦do they?"], ["rice pudding", 1102826602994388997, "#breakfast today is black cherry rice pudding with berries! 🍒🍚🍮\n\n#food #foodphotography #rice #dessert #berries #superfoods #superfood https://t.co/tyOfGLkxdz"], ["rice pudding", 1133637811, "RT @TildaChef: On the eve of @ZestQuestAsia 2020 we're celebrating our current champions @NewCityCol! The team stormed our 'Best Use of Ric…"], ["rice pudding", 269994390, "Homemade rice pudding and strawberry jam, is there anything better?"], ["rice pudding", 1190570841945395200, "@AdeleIsla @Glinner someone replaced your brain with rice pudding i think"], ["rice pudding", 214041127, "Just binge-watched the first series of #AfterLife, could not stop watching, rarely to I cry with laughter but that rice pudding scene! Genius @rickygervais"], ["rice pudding", 19644356, "Are you a rice pudding lover or hater?   https://t.co/awd1ZaOTzy"], ["rice pudding", 1029380593983922176, "RT @TildaChef: On the eve of @ZestQuestAsia 2020 we're celebrating our current champions @NewCityCol! The team stormed our 'Best Use of Ric…"], ["rice pudding", 171753848, "@geauxcrimson @sabanfaux @cfb_poindexter @ajduey04303 @sir_cade @BourbonGhost @JustBaseball25 @DolamiteD @GusFantastico @ItMeDoge @lesp1968 @BigDavidMullins @ChefCoal @HunterLJohnson @BamaOrNothing @Lyell_Walker @elldcbc @butchworley @rectecgrills We have an instapot and have had success with two items. Mac and cheese and rice pudding. Everything else is just mush"], ["rice pudding", 206563211, "RT @ArthurFooksake: Rice pudding on the Ritz.\n#DairySongsAndMovies"], ["rice pudding", 2207250706, "Rice pudding on the Ritz.\n#DairySongsAndMovies"], ["rice pudding", 2737494522, "@wroetoshaw I think it’s more like rice pudding for me but still a good shout 🤙"], ["rice pudding", 135151484, "Hot rice pudding? Bunch of crazies 😂😂"], ["rice pudding", 1034569615798677505, "rice pudding craving"], ["rice pudding", 1191123909338443776, "@Katiew552 Semolina. I've never tried it, but I remember in primary school the other kids saying it was horrible and, being easily lead, I was convinced it was the worst thing ever. The creamy texture seemed off to me, which is so weird now because I love rice pudding."], ["rice pudding", 1975135399, "RT @TildaChef: On the eve of @ZestQuestAsia 2020 we're celebrating our current champions @NewCityCol! The team stormed our 'Best Use of Ric…"], ["rice pudding", 1070368034, "On the eve of @ZestQuestAsia 2020 we're celebrating our current champions @NewCityCol! The team stormed our 'Best Use of Rice Category with their Malaysian Rice Pudding Cake and Gulai Kepala Ikan. Full recipes on the link 👇 #Throwback #ThursdayThoughts \n https://t.co/EARX0ePwKJ https://t.co/ES4pXqLwAO"], ["rice pudding", 2832619968, "matcha chocolate rice pudding {jade rice + coconut milk} preparation time: 5 min., cook time: 35 min.  https://t.co/LUpOTiQgel https://t.co/Wj2OhWzJ4E"], ["rice pudding", 55566167, "@Zoe_Curtis_ Controversial opinion: rice pudding is the only thing rice is good for"], ["rice pudding", 595154110, "Not once have I ever managed to cook the correct amount of rice for a meal. But I’m kinda cool with that right now as last night’s excess has become tonight’s rice pudding. With extra ice cream."], ["rice pudding", 1178695410841456640, "@Glazgow Rice Pudding?"], ["rice pudding", 836969733207420928, "@AidenWolfe Ah, to be 32 again! I’m up at 4 am with jet lag, eating rice pudding and catching up on your tweets. #comfortfood for body and soul."], ["rice pudding", 71293346, "@_NatashaDevon Tinned rice pudding"], ["rice pudding", 1070023453049274368, "Fiddlesticks, Thomas Sangster! The welder stole our rice pudding, now we'll never truly experience Merced Manor..."], ["rice pudding", 978922389634473984, "Warm the cockles of your heart ♥\nOur Regular Thursday Special is Traditional Homemade Creamy Rice Pudding 😋 Delicious \n\nOver 35 years of business, delicious recipes and local employment in Dungarvan ☘\n\n#Dungarvan #Waterford #Ireland #Fresh #local #ingredients #food #foodie https://t.co/ABa84L7PkL"], ["rice pudding", 1106260173818155008, "You gotta walk and hydrate if you like (wait for it) RICE PUDDING"], ["rice pudding", 378297401, "@bummer_no_b So this is an actual thing you do and eat. I mean, rice pudding is dope so... maybe? Do you actually like it, or do you just like that it’s called “rice cream” (cause that’s v good)\n\nAlso like, white? Jasmine? Sticky? Vanilla? Rocky road? How do I do it, there’s too many factors"], ["rice pudding", 553629364, "RT @BetoReitenbach: “What is an \"instant\" death anyway? How long is an instant? (...) What the hell is instant? Nothing is instant. Instant…"], ["rice pudding", 746638892074405888, "@HannahLind9 he could not take down a rice pudding"], ["rice pudding", 3351110950, "@PatWill97926440 @RichardBurgon @UKLabour He looks like he couldn’t pull the skin off a rice pudding"], ["rice pudding", 3341606114, "RT @DxpeM_: GLO'S KITCHEN  POPUP DINNER SALE \nFEBRUARY 8,2020 SATURDAY \n\n- WHOLE FISH REDSNAPPER $15\n- TURKEY WINGS $13\n- PIGEON PEAS&amp;RICE…"], ["rice pudding", 1222606178607423488, "ARABIC PUDDING\n\nARABIC PUDDING WAS INTRODUCED INTO ARABIC CUISINE  RICE PUDDING IS A DISH MADE FROM RICE MIXED WITH MILK AND CREAM.DIFFERENT TYPE OF PUDDING   VARY DEPENDING  ON  PREPARATION METHODS AND THE SELECTED INGREDIENTS.(https://t.co/OUGqoy913t) https://t.co/MmNSON86mX"], ["rice pudding", 1072202026950541312, "@serendipitydon1 @nytdavidbrooks Meuller does some great rice pudding tubs though"], ["rice pudding", 228258026, "RT @CeylanWrites: Salep in the NYT: \" Homesick Turks dream of real salep, which is something like a cross between hot chocolate and rice pu…"], ["rice pudding", 773967564, "RT @JecaAustin: After school cooking club made rice pudding at @BrookeLions today to help stay warm. Mmmmm. #PrimeTime Cooking is a delicio…"], ["rice pudding", 712777431841525760, "Mmm :( actually is that flan? You literally like to eat everything I don't like. Rice pudding {arroz con leche, tapioca pudding}, chili flakes, and flan. Flan is the last dessert I'd actually eat @GraysonDolan I like your shoes tho ☺️ what is it really?? Biscuit? Hardened tofu?? https://t.co/t0jMroqqjS"], ["rice pudding", 1106260173818155008, "Eating rice pudding after retrieving gloves back from dude who just got out for some shit. Cant be slinging DNA unless its needed. He was like oh, shit...gloves ok...” just ran to em said need em back. He could‘be offeron’d me... I was well on my way to the rice pudding zones"], ["rice pudding", 899656449542025216, "@IGGYAZALEA Rice pudding says hi"], ["rice pudding", 2951189214, "@ohiowa89 Here is another photo of my Molasses Stack Cake. I am going to guess that your favorite is rice pudding. https://t.co/X6z5x7VXSG"], ["rice pudding", 490787344, "Woke up and couldn’t get back to sleep. Went downstairs and got some rice pudding. It’s now 4:25am and I’m eating rice pudding in bed. How’s life? https://t.co/ol4pEHxnkj"], ["rice pudding", 1215016018977939458, "Do you love rice pudding? Learn how to make the best Instant Pot rice pudding right here! #recipes https://t.co/B3jBUK9kcQ"], ["rice pudding", 2783581712, "what goes in your rice pudding"], ["rice pudding", 2822790320, "@Mscocoxo Bread, rice, corn, carrots, fruits, potatoes, cake, ice cream, pies, soda, juice, candy, fried foods with flour, sweet peas, banana pudding, basically all the good stuff"], ["rice pudding", 39959238, "Why is rice pudding so gooooood?!"], ["rice pudding", 613732042, "@deborahmfbarnes @garysnowpatrol hi I'm home warm, it's getting colder and windy outside. I had last of baked beans and pita chips for dinner then I had  rice pudding for dessert plus a  small chocolate.  Hoping you have a very nice and quiet sleep, keep warm snuggle down in your blanket, sleep well xxxx"], ["rice pudding", 2524995638, "@ohiowa89 I like rice pudding.  You like pistachio ice cream."], ["rice pudding", 415169473, "RT @DxpeM_: GLO'S KITCHEN  POPUP DINNER SALE \nFEBRUARY 8,2020 SATURDAY \n\n- WHOLE FISH REDSNAPPER $15\n- TURKEY WINGS $13\n- PIGEON PEAS&amp;RICE…"], ["rice pudding", 834466405001154573, "@tiadoesvegan Like rice pudding texture. Not too thick not too runny."], ["rice pudding", 972628014797414400, "RT @OldFashRecipes: Updated to include Baked Rice Pudding With Meringue Topping. Baked Rice Pudding/ w/Homemade Whipped Cream Recipe https:…"], ["rice pudding", 888751, "Yet another reminder.  Nonviolence is best.\n\n\"Blueprint for Revolution: How to Use Rice Pudding, Lego Men, and Other Nonviolent Techniques to Galvanize Communities, Overthrow Dictators, or Simply Change the World\"\n\nhttps://t.co/mBKu1dVGxl"], ["rice pudding", 181819919, "@J3ushu An easy dessert is rice pudding. Rice, milk, sugar, egg, cinnamon, optional nutmeg. So goooood 💕"], ["rice pudding", 1091365657273384960, "@WilkinsonSamuel \"a savoury or sweet dish steamed or boiled in a bowl\"... That's... That could be any food. Is plain rice a pudding? Is a cake a pudding? Is a pancake a pudding? Is steamed broccoli served in a bowl a pudding?\n\nIs a meat pie a pudding????"], ["rice pudding", 1004958542405820417, "context : i posted a video of me making rice pudding and said \"making rice pudding at midnight because i've lost control of my life\"\nand YES she is serious i thought it was a meme but nope"]]