[["rice and potatoes", 15099604, "Lunch. Brown rice, kale, yellow potatoes, carrots, balsamic glaze and two cobbs of 🌽\n\n#plantstrong \n#vegan\n#engine2diet #e2diet https://t.co/9VIAviX1hd"], ["rice and potatoes", 1223357046118133761, "@HeyoImPurple UwU\n\nSo you like food just as I do!\n\nMy favorite at the moment is Rice with fried chicken breasts and baked potatoes + a vegetable sweet saus!"], ["rice and potatoes", 876783363448852480, "Question: what is your plan on Valentine's day?\n\nDULO:I'm planning on doing sml fries, chicken and Irish potatoes with sml fried rice, invite my single friends it's single we are single, we didn't kill anybody ooo. #ValentineBreakupline"], ["rice and potatoes", 3315531276, "Eating curry potatoes and rice with chicken mornay pasta 🥴"], ["rice and potatoes", 913582501, "@josiahfitness Salmon and Risotto\nChicken Tacos w/beans and rice\nSteak and potatoes\nEggs and bacon/sausage\nPork Chops and sweet potatoes\nBurgers and homemade fries\n\nThen will mix in different meals once a week. Chicken curry, shrimp and grits/fried rice for example\n\nPlenty of variety for me"], ["rice and potatoes", 1034837482532216839, "🐴🐆🐎💞🔥💪🤗🌹❤️😘😍🤩💕💝🎀❤️🧡💛🐾💖❣️💓🐕\nhuge 🤗😍🤗😍🤗.  Lamb stew, ❣😍❤🤗🤗😍 beans carrots, potatoes, celery, Swede, rice,  ❣🤗❤🤗❣have olives and pita bread, dates and honey. 🤗❤❤🤗😍❣. No cutting hair of course lose your super power doing that. ❣❤❣❤❣ http https://t.co/rOOw5OgUim"], ["rice and potatoes", 1070785469506576386, "RT @mosedagoat14: mama i made it to 20😎 \nyou’d be cooking me some fire ass fried catfish and mash potatoes with the rice 🤣 \n\nblessed to get…"], ["rice and potatoes", 1097961858022158336, "RT @mosedagoat14: mama i made it to 20😎 \nyou’d be cooking me some fire ass fried catfish and mash potatoes with the rice 🤣 \n\nblessed to get…"], ["rice and potatoes", 2244028720, "RT @mosedagoat14: mama i made it to 20😎 \nyou’d be cooking me some fire ass fried catfish and mash potatoes with the rice 🤣 \n\nblessed to get…"], ["rice and potatoes", 1123226891085844481, "@JarreauAntoine @jxxnxq Yea I agree with that distinction. I hope people would read what I wrote and not go straight to eating as many cookies as they want. To clarify: I used to demonize carbs because of 90s era diet ideals. Now I value rice, corn, potatoes, sweet potatoes etc as much as I need to"], ["rice and potatoes", 1419681522, "mama i made it to 20😎 \nyou’d be cooking me some fire ass fried catfish and mash potatoes with the rice 🤣 \n\nblessed to get to 20 today through it all🤙🏽 https://t.co/53BichIkLf"], ["rice and potatoes", 1140806293030166528, "also corned beef with onions and potatoes on top of steamy white rice? yum!"], ["rice and potatoes", 1118605848014618629, "Talk about the price of 1kg of chickpeas and compare that with the price of 1kg of meat. \n\n1 kg of rice, potatoes, legumes, fruits, vegetables, nuts, tofu and others, all of them are cheaper than 1 kg of meat, fish, shrimp for example. \n\nYou can live w/o almonds milk, you know https://t.co/QTJn10rR1c"], ["rice and potatoes", 909539652, "@the_old_block I’m doing Persian buttered chicken in saffron; preserved lemons and olives; with a tomato &amp; onion salad &amp; dauphinoise potatoes (I don’t like rice)"], ["rice and potatoes", 30223633, "@atomickristin @BridgetPhetasy I eat rice, beans and potatoes...but please tell me how they’re expensive"], ["rice and potatoes", 969612485949968384, "RT @josiahfitness: My family’s healthy eating approach consists of:\n\nWeekly staples : Eggs, Salmon, Berries, Potatoes, Bananas, Nut butter,…"], ["rice and potatoes", 3061957801, "@BizzGalaxy When it comes to school breakfast, I usually get either a chocolate banana bar or those smuckers pb&amp;j things. If I'm at home, it's either cereal or scrambled eggs with potatoes, with beans and rice on the side."], ["rice and potatoes", 875468817039798272, "RT @josiahfitness: My family’s healthy eating approach consists of:\n\nWeekly staples : Eggs, Salmon, Berries, Potatoes, Bananas, Nut butter,…"], ["rice and potatoes", 934387625258921990, "RT @josiahfitness: My family’s healthy eating approach consists of:\n\nWeekly staples : Eggs, Salmon, Berries, Potatoes, Bananas, Nut butter,…"], ["rice and potatoes", 1028767303398313984, "@ProStart 2 Last day of potatoes, pastas, and grains unit. Students were able to choose a recipe that had one of these items. Homemade pasta Bolognese, creamy chicken gnocchi with spinach, butternut squash ravioli with brown butter sauce, Spanish rice. @SCCareerAcademy #facs https://t.co/pap5tuBYV7"], ["rice and potatoes", 4654318823, "My family’s healthy eating approach consists of:\n\nWeekly staples : Eggs, Salmon, Berries, Potatoes, Bananas, Nut butter, Chicken, Beef, Veggies and Rice\n\nSmoothies \n\nSalads \n\nRestaurant 1-2x per week\n\nHomemade pizza and tacos \n\nChocolate 1-2x per week \n\nSimple\n\nBasic\n\nEffective"], ["rice and potatoes", 4204869920, "Brown Rice Cole Slaw Oatmeal Rolls Scalloped Potatoes Eggplant Beet and 1 cup gravy or chopped hard-boiled egg, and flour"], ["rice and potatoes", 1131031875886157825, "my roommates rly out here eating 2 egg rolls and a mikes hard for dinner while i make rice and curry potatoes from scratch"], ["rice and potatoes", 108787358, "Tuesday's Menu: Cube Steak, Neckbones w/ Potatoes, Ox Tails, Fried Chicken Wings \n\nhttps://t.co/aNiVD7dpRw\n\nSides: Macaroni and Cheese, Steamed Cabbage, Blackeye Peas w/ okra, Candied Yams, Fried Corn, Turnip Greens, Rice, Butter Beans\n\nDessert: Peach Cobbler"], ["rice and potatoes", 194133903, "Happy Tuesday! Swing by #UAUClub for lunch and enjoy Honey Mustard Grilled Chicken, Parmesan Fish, Zucchini &amp; Tomatoes, Herbed Rice, and Baked Sweet Potatoes!\n\nSoup: Broccoli &amp; Cheese | Member reservations: 205-348-4848\n.\n.\n.\n#yumstartshere #tuscaloosalunch #rainraingoaway https://t.co/hsyjxb2ibH"], ["rice and potatoes", 21660943, "RT @mnwildPR: Tonight's #mnwild press meal vs. VGK: Crispy Chicken Tenders, Char-Grilled Brats, Mashed Potatoes and Gravy, Roasted Carrots,…"], ["rice and potatoes", 876339348, "Tonight's #mnwild press meal vs. VGK: Crispy Chicken Tenders, Char-Grilled Brats, Mashed Potatoes and Gravy, Roasted Carrots, Chicken Wild Rice Soup, Salad Bar, Fresh Fruit, and Warm Apple Crisp."], ["rice and potatoes", 1217928879756709889, "RT @PattySaveurs: Hearty recipe beef meatball stew with veggies and gravy gently simmered on stove top, a flavorful and comforting meal to…"], ["rice and potatoes", 496153987, "just saw my old coworker post a video on her story of unseasoned looking chicken potatoes and rice captioned “eating good tonight” 😭 yes she was white"], ["rice and potatoes", 772955572500992000, "wish i knew how to cook more than just rice and potatoes"], ["rice and potatoes", 3516962002, "@KrystalPeguero I suppose i feel you lol..I’m kinda like that with pizza, i prefer other ish. N i love rice and potatoes too 😫"], ["rice and potatoes", 151125858, "@tabithawild CARBS. Protein. Fat. But also CARBS. ALL the Carbs. There is zero reason to feel hungry in a world where pasta, rice, noodles and potatoes exist. Veggies are brilliant. But veggies alone aren’t going to fill anyone up."], ["rice and potatoes", 101594894, "And it's delicious. s/o to white people for grilled cheese, stuffing, and mashed potatoes. \n\nY'all should leave rice and poultry alone though. Ou pa gen grace pou ca. https://t.co/SWmU7DuH0W"], ["rice and potatoes", 849498140134789122, "@ThatNevilsKid I once had a patient who only ate chicken rice and potatoes because his wife said that would heal his problems 🥴"], ["rice and potatoes", 943982552762662913, "@archivenowtweet @Boldspeaking As much as I can. There are still carbs in cheese and my daily banana. But no grains, potatoes or rice. Now that I’m amping up my workouts, I’m adding a little post-w/o carb punch by way of rice or potatoes, to help my creatine work better."], ["rice and potatoes", 1162508055663259650, "@Tru_TheWise Lol for my daughter it’s French fries or potatoes and broccoli. She’s picky. I usually have fruit and some rice. Nothing too crazy cuz those fill her up pretty fast"], ["rice and potatoes", 758812309535887360, "@DongBangbabies Chun soup 🥘🍠🥟🍙 We already have dumplings, sweet potatoes and rice balls. 🤭"], ["rice and potatoes", 1225747857069592578, "@bbrightvc maybe you need to consume more carbohydrates like rice and potatoes alongside proteins (chicken's breasts) when you train🤔 if you want to gain more weight, you need to boost your calories intake🤔"], ["rice and potatoes", 30250630, "Now I want a cheesy bean and rice burrito, fiesta potatoes, and a large Baja blast freeze https://t.co/HbRm6IzwLY"], ["rice and potatoes", 224235883, "@namomnetempus Good for you! 👍🙂\nIn Portugal we have weird stuff like dishes which include bread, potatoes and rice or several kinds of meat in the same pot we all think of as \"proper\" food too. 😄"], ["rice and potatoes", 502887996, "I have made today..\nChocolate cake\nFruit cake\nGinger cake\nApple and walnut cake.\nPot of bolognese sauce for lasagne\nAnd coked 2 different meals for the Elderlys..Chicken for 3 and smoked haddock for 5...plus veg and potatoes.. And a rice pudding for dessert. WTF. 😳."], ["rice and potatoes", 2707000530, "Feb 11th: Fried or Creole Chicken, Hamburger Steak, Red Beans &amp; Rice, Mashed Potatoes, Rice, Green Bean Cass., C.Greens, Crowder Peas, Rutabagas, Okra-Corn-Tomatoes, F.G.Tomatoes, Carrot Salad, Apple Cobbler, Pecan Pie, and Sweet Potato Pie. #farmersmarketcafe #seemgm #mymgm https://t.co/ynNtLWEVQ2"], ["rice and potatoes", 24679423, "There are people that don’t eat (green) vegetables on a regular basis. That’s baffling to me. Just meat, pasta, rice, potatoes and corn... I know their insides are fetid and their breath smells like old sh@t. 😢😢😢"], ["rice and potatoes", 1032646775025414145, "@ykxhyxn We get one plate of food that has salad, meat, and potatoes or pasta or rice only 0.98€ and that's paid by tax"], ["rice and potatoes", 2896182171, "RT @IAmTruthCBD: Top Tip Tuesday ...\n\nBase your diet on plenty of foods rich in carbohydrates\nAbout half the calories in our diet should co…"], ["rice and potatoes", 1205497346911551488, "Top Tip Tuesday ...\n\nBase your diet on plenty of foods rich in carbohydrates\nAbout half the calories in our diet should come from foods rich in carbohydrates, such as cereals, rice, pasta, potatoes, and bread."], ["rice and potatoes", 2408499690, "RT @PlatterTales: #OdiaThali - Rice ,Dal , Tomato Chutney , Janhi -Aloo-posto(ridge gourd, potatoes with poppy seed paste) , Papad with som…"], ["rice and potatoes", 1157887850, "RT @PlatterTales: #OdiaThali - Rice ,Dal , Tomato Chutney , Janhi -Aloo-posto(ridge gourd, potatoes with poppy seed paste) , Papad with som…"], ["rice and potatoes", 1224743833440620544, "#OdiaThali - Rice ,Dal , Tomato Chutney , Janhi -Aloo-posto(ridge gourd, potatoes with poppy seed paste) , Papad with some shallots .\n...\nPosto or poppy seed is an important ingredient in both odia and Bengali kitchen. #PlatterTales #Thali #Odia #Odisha https://t.co/ARQS9CM5AA"]]