[["saag", 397437016, "RT @Jhk_Sandhu: Thought we had a bowl of weed in the kitchen..... turns out it’s just frozen saag https://t.co/TPdVLOxDIE"], ["saag", 249912717, "@kenzroams if im gonna drive to jersey to go to aldis i might as well just drive .2 miles from my house to pick up the chicken tikka saag lol might have to go get it soon"], ["saag", 759084885445193729, "I think my punjabi card should be revoked since i don't like saag and/Or makki ki roti 😔😔😔"], ["saag", 219651314, "@GautamTrivedi_ nice to see complimentary roti and saag when one orders pyaazm"], ["saag", 1382974668, "@thebenoch Saag = greens. Could include kale, Swiss chard, etc as well as spinach. Palak = spinach. In practice, many saag dishes are made with spinach, though."], ["saag", 30024235, "@IonaItalia What’s the main difference between palak paneer and saag paneer?"], ["saag", 480761314, "Thrilled to have our @IGS_UiB @Oslounivsykehus  @NutritionUiO abstracts on risk of dementia with high cholesterol (FH)&amp; quantitative assessment of lifelong coronary revascularization in FH accepted for oral presentations @SaaG @EASCongress in Geneva."], ["saag", 64230489, "Sarson Ka Saag is a popular dish from North #India This famous recipe from north India is made with a combination of greens, namely spinach and mustard leaves. Mustard leaves have a unique flavor that is mildly… https://t.co/5iUZW2mqCt"], ["saag", 926416187793313792, "Good Morning Friends! A couple of weeks ago, we made Saag Paneer, which was a super hit among our customers. So, we decided to make it again today as a special! For this dish, we’re using Organic Mustard Greens,… https://t.co/kceT3Wruda"], ["saag", 805809454025441281, "RT @historylvrsclub: A woman hitting a skinhead with her handbag, Sweden, 1985. The woman was reportedly a concentration camp survivor. htt…"], ["saag", 557550475, "I'm a Punjabi and I despise Sarson da saag. https://t.co/BRUj8p6n3G"], ["saag", 72495172, "@RantingDosa I am Punjabi n don't eat Sarson la saag with Makke de roti"], ["saag", 37449155, "This slow cooker chicken saag curry is delicious, frugal and flavoursome: https://t.co/gN6c1uqQjT"], ["saag", 124173355, "I am a hazarawal and Saag isn't my thing. My family loves it though. https://t.co/w9LVvIdUjN"], ["saag", 415347877, "@AnasMallick hate and racist for Punjabis?? Khi waley cant make Saag or Lassi but we never said so"], ["saag", 1186565489956446208, "@MarriyamH Wah what a beautiful image of sarsoon ka saag.❤️"], ["saag", 323876589, "RT @singhnextdoor: if you're over the age of 16 and don't like saag your taste buds are broken I don't make the rules"], ["saag", 3089480948, "@Abu_Shalwar yaha we eat saag paratha and lassi"], ["saag", 877561737008099329, "RT @MatchStix: Organic sarso ka saag from my farmhouse, with achaar is &lt;3 https://t.co/nllZ15rIPH"], ["saag", 846846523711336449, "Organic sarso ka saag from my farmhouse, with achaar is &lt;3 https://t.co/nllZ15rIPH"], ["saag", 1618103683, "RT @bisnujha: A documentary on \"Cuisines of Mithila\" being shot in Darbhanga.\n#Tarua\n#Kheer\n#Makhan\n#Saag\n#Kumhrauri\n#Tisi\n#Pua\n#Biriya\n#Ti…"], ["saag", 1088294140864090112, "RT @SalmaZainab15: Punjabi Cuisine\nIt has a rich tradition of many distinct,local ways of cooking.Some popular dishes are\n1-Makai ki roti,s…"], ["saag", 36427373, "Lunch today was: gobi mattar, raai ko saag ra jara (mustard greens and squash or chowchow roots), chicken cooked in bottled Schezwan chutney (yes, Ching’s) and churpi ra mula ko achchar. What are y’all eating? https://t.co/OiCjrgMQPB"], ["saag", 1635933824, "@walnut_crumble Hi. Just here to tell you that I'm cancelling you for distancing yourself with kadhi chawal.\nSaag ya Raajma chawal chalta.....but Kadhi chaawal, lol NO!"], ["saag", 1201943883262783488, "@justvoot #SidharthKeAsliFans #AsliFans  #BB13OnVoot  anybody for saag"], ["saag", 2992259190, "RT @dilbagkoundal: Presenting The Traditional Himachali Thali #HimachalPradesh #Himachali #KangriDhaam #Kangra - Visit Kangra, Himachal Pra…"], ["saag", 2987782648, "@Abu_Shalwar It's a type of Saag. It's pretty good too"], ["saag", 1035741396404072449, "@issajag bro saag isnt a bad idea either"], ["saag", 445035729, "@sahaijdosanjh5 Why don’t I just use saag"], ["saag", 925482804082823168, "RT @SalmaZainab15: Punjabi Cuisine\nIt has a rich tradition of many distinct,local ways of cooking.Some popular dishes are\n1-Makai ki roti,s…"], ["saag", 494702709, "RT @SalmaZainab15: Punjabi Cuisine\nIt has a rich tradition of many distinct,local ways of cooking.Some popular dishes are\n1-Makai ki roti,s…"], ["saag", 2353488438, "@vivekagnihotri @c_aashish Let’s see if Mumbai or where ever it is that you are from has the best saag and makki di roti."]]