[["saffron rice", 238454746, "RT @CBCOttawa: ICYMI | Tahchin is a layered pie that's as tall as a cake, but it's made from rice, chicken and barberries. In addition to s…"], ["saffron rice", 18999969, "ICYMI | Tahchin is a layered pie that's as tall as a cake, but it's made from rice, chicken and barberries. In addition to saffron, it's flavoured with rosewater and turmeric. Read more: https://t.co/KAfMiauMFk #ottawa #ottnews https://t.co/blKpW1dKsc"], ["saffron rice", 1100538937175490560, "@johnnyfraud @bombastic_luv How to cook Chicken and Chorizo Paella\n\n- 1 tbsp olive oil\n- 2 chicken breasts fillets, cut into chunks\n- 2 small onions, finely sliced\n- 1 fat garlic clove, crushed\n- 140g cooking chorizo, sliced\n- 1 tsp turmeric\n- pinch of saffron\n- 1 tsp paprika\n- 300g paella rice"], ["saffron rice", 70177014, "You don't want to miss Chef's take on a seafood paella with pink Argentinian shrimp, scallops, little neck clams, Spanish chorizo, sticky rice, saffron tomato broth.\n#GermantownCafe #Nashville #EatNashville #NashvilleEats #NashvilleOriginals https://t.co/1lm4AVYoGF"], ["saffron rice", 2463614490, "RT @EtherealNaiad: Absolutely delicious. Lamb gyro meat, saffron rice, chargrilled veggies, caramelized onion hummus, and pita bread. 10/10…"], ["saffron rice", 516915916, "RT @EtherealNaiad: Absolutely delicious. Lamb gyro meat, saffron rice, chargrilled veggies, caramelized onion hummus, and pita bread. 10/10…"], ["saffron rice", 22104461, "@rayofliteindark Marinated grilled pork loin chops, saffron rice and a vegetable bake consisting of summer squash, zucchini and roma tomatoes seasoned with garlic, Italian seasoning and fresh shaved Parmigiano-Reggiano!"], ["saffron rice", 1180955469290070017, "@bitfiddler That sounds good!  A favorite of mine with chicken is yellow (saffron)  rice!"], ["saffron rice", 959870675384193025, "@KirsteinRummery @weehellish Argentinian corned beef, NZ lamb, French wine, Swiss Cheese, German Wurst, Italian ham, Danish bacon, Canadian Maple Syrup, Saffron, tea, coffee, rice, Edam, Belgian beer, ouzo, paprika, Spanish chorizo, Port . . . if only we knew how they tasted."], ["saffron rice", 824004585224282112, "@shafieikeyvan Hmm what’s that dish of crispy saffron rice from the bottom of the pot called?"]]