[["salmon fry", 12863912, "When you walk upstairs and your wife is prepping salmon and rice, and has starting to fry up onions, garlic, butter and white wine vinegar 🤤\n\nSo thankful for @Hanna_Little https://t.co/JYMVO84rIS"], ["salmon fry", 130561578, "Honey sriracha salmon &amp; shrimp, brussel sprout stir fry &amp; couscous tonight 👩🏾‍🍳 https://t.co/DmqVXYAEx5"], ["salmon fry", 126211422, "What should I cook: garlic butter steak with lemon submerge zucchini noodles, shrimp and crab Alfredo, fry some salmon with some shrimp corn on the cob and roasted potatoes 🤔"], ["salmon fry", 270045903, "Exercise done. Salmon &amp; Rice Stir fry Dinner. 🏃‍♀️ https://t.co/Yy7iT7PRGs"], ["salmon fry", 1165717273774104576, "@reminola Pls fry the salmon...*"], ["salmon fry", 1221550227578150913, "Teriyaki glazed salmon fillet, rice pilaf, stir fry stringbeans for the win!!😁 https://t.co/E3qco1otVd"], ["salmon fry", 231461860, "veggie stir fry and baked salmon for dinner last night , thinking baked bbq wings, sautéed green beans tonight 😋"], ["salmon fry", 594095363, "Made zucchini, mushroom, red onion, mixed peppers and spinach stir fry to eat with my salmon. \n\n😋😋😋"], ["salmon fry", 854790639141171206, "Whip together 1/3 cup Ahi Tuna with 2 quarts Cabbage. Blend with Ale. Fry. Serve with salmon"], ["salmon fry", 816309934681952264, "@Liftingsoulsfit Why u fry salmon?"], ["salmon fry", 2464106245, "RT @Trishp0147: @Cookie_BigRick @BeAGoodBob @LaJollaAntifa @nay_sue1 A measurement so precise can only mean one thing. Anotonio Villanueva…"], ["salmon fry", 862687759881957376, "@Cookie_BigRick @BeAGoodBob @LaJollaAntifa @nay_sue1 A measurement so precise can only mean one thing. Anotonio Villanueva Jr III uses the metric system. If my calculations are correct, of which I have no doubt 4.456 inches should have been used in the tweet. The length of a 13 month old Salmon Fry indigenous to Olema Creek. https://t.co/5DgMTsWjfN"], ["salmon fry", 214262743, "OK MB makes sense to work backward in time this time,being that I got in here so late BC powerfully floral perfume \"mom\" smells were persistent,guess she needed to use her desk. So,was in here BF smells looking through older pics,bf that had salmon dinner (chicken stir fry last"], ["salmon fry", 2970718143, "Salmon, Stir Fry, &amp; Fries ?\n\ni'm cool w/ it ☺️"], ["salmon fry", 1214088248, "@jennaemoran @traciemac_Bmore Favorite recipe for salmon:\nOne tablespoon each of brown sugar, minced garlic, soy sauce, melted butter, and olive oil. Pour in a bag or bowl. Marinate for at least 2 1/2 hours.  Preheat air fryer to 425. Spray fry basket with Pam."], ["salmon fry", 107665711, "I wanna try to fry salmon"], ["salmon fry", 286675924, "I’m in here tryna fry salmon don’t know what I’m doing. 😕"], ["salmon fry", 1379847554, "@ConservationNW Also, no evidence of salmon runs being 'decimated'.\n2018 local paper headline: “Sockeye Salmon Return in Droves to Quesnel Lake Watershed”. The fry that were in Quesnel Lake the year of the Mount Polley spill were the spawners that returned in 2018.  https://t.co/3yOvaGazgC"], ["salmon fry", 42809480, "Oh Em Gee....it’s GOURMET TACO WEDNESDAY! Tonight we have another incredible selection of five unique creations from our talented kitchen including:￼￼\n🌮 Stir Fry Steak Tacos \n🌮 Salmon &amp; Capers Tacos\n🌮 Chicken… https://t.co/HmCyy7wNlQ"], ["salmon fry", 992810000, "@dontattempt @abcmelbourne Getaway Carp\nKung Fu Whiting\nOld Man Salmon\n\nAnd when it’s time to fry...\nWhatta Pan (by Salt n Pepa)"], ["salmon fry", 766126129459716096, "RT @kaylafrmdablock: like can a bitch get some sushi, some salmon, anything other than that tired ass chicken tender french fry combo 😂"], ["salmon fry", 2725877783, "like can a bitch get some sushi, some salmon, anything other than that tired ass chicken tender french fry combo 😂 https://t.co/GLTCBGS8Ku"], ["salmon fry", 2447605907, "I think I’m bout to air fry some cauliflower and some bourbon salmon"], ["salmon fry", 740553752193695744, "@guihirasawa salmon is good...i like to pan fry it so the skin gets crispy"], ["salmon fry", 21842641, "@SinningLeli Salmon is easiest... Just put salt and pepper and then just fry or bake it."], ["salmon fry", 21186948, "@dontattempt @abcmelbourne No Salmon, No Fry"], ["salmon fry", 854790639141171206, "Combine 4 cups Cantaloupe with 1 pound corn. Add cinnamon Fry. Serve with salmon"]]