[["scrambled eggs", 92340201, "Deep fried scrambled eggs. It turned into black. First time when I ever went into a kitchen.\nhttps://t.co/pP2MRxMk8t"], ["scrambled eggs", 1097142200813654021, "Muero por un desayuno con scrambled eggs, bacon and like 20 pancakes🥺"], ["scrambled eggs", 52873501, "Wore a stupid top with two wee fried eggs on it tonight n i brought a extra top cause i knew someone would make a stupid joke , walked in n a guy went aw a like mines scrambled lol good joke make bye"], ["scrambled eggs", 23649152, "@fang_oce Dude, if you ever make me scrambled eggs, I’d be happy that it’s on a plate. And who the fuck throws a toastie? We so need better jobs. (On Monday, I got into an argument with a dude about lemons. Lemons! 10 motherfucking cents!!!) #deepbreaths #calmblueocean https://t.co/nkYa3Vbr8M"], ["scrambled eggs", 209544601, "RT @AliciaMarieBODY: I just saw someone putting peanut butter and jelly in their scrambled eggs and I’m malfunctioning oh god https://t.co/…"], ["scrambled eggs", 193986804, "@CobyandtheCB Fried squirrel with gravy &amp; scrambled eggs! Count me in!"], ["scrambled eggs", 157374165, "Need help recreating scrambled eggs I had in Japan \nhttps://t.co/Bh9kwkPRF4 https://t.co/CGQyMxTESA"], ["scrambled eggs", 761779131885420544, "@UncleCastle Missus thinks that’s scrambled eggs in which case, fire whomever made them"], ["scrambled eggs", 980000670072877056, "RT @vera_musing27: @YungYinkv Her eggs coming out scrambled 💀💀"], ["scrambled eggs", 1551057804, "I have a coworker who makes this dish of scrambled eggs, chopped veggies, and cheese— something I make and enjoy myself— but he calls it “eggy hash” and I legit gag a little each time he says it. 🤷🏻‍♀️🤢"], ["scrambled eggs", 394994700, "One thought - salmon and scrambled eggs and hash brown patties garbage plate mess.\n\nTurned into salmon patty over hash brown patties. That was a fun rabbit hole cooking.\n\n#salmon #patty #breakfast #dinner… https://t.co/FEvyiEcZrM"], ["scrambled eggs", 1223169373, "So far this week I e had a toastie thrown at me and been abused over the way scrambled eggs are plated on a day I wasn't even at work\n\nCant wait for the weekend \n\nOh wait, I work weekends https://t.co/eCIY04DZ1D"], ["scrambled eggs", 1007226316117032960, "RT @vera_musing27: @YungYinkv Her eggs coming out scrambled 💀💀"], ["scrambled eggs", 2998909443, "RT @MiskiewiczWill: Lola update: minutes ago she was stalking me in the kitchen for scrambled eggs. I cannot express how grateful I am for…"], ["scrambled eggs", 74536890, "@RevReee good pic. i didn't like okra, but everyone in my family did. grossed me out when my mom cooked it. it's weird how all of our tastes can be different. like i do the \"dip my scrambled eggs in ketchup\" thing. many find it gross, while others actually do the same thing."], ["scrambled eggs", 1217552941663604736, "RT @vera_musing27: @YungYinkv Her eggs coming out scrambled 💀💀"], ["scrambled eggs", 1107644868921380864, "RT @JamesClewlow_: Bored of eating eggs?\n\nNot anymore you're not...\n\nYou can have them:\n\n+ scrambled\n+ fried\n+ poached \n\nVariety is the spi…"], ["scrambled eggs", 1014977655740002304, "RT @kcookk9: My brain is scrambled eggs and someone just had breakfast"], ["scrambled eggs", 632483281, "@WorldAndScience Go to a diner with ceramic mugs and a waitress who has no respect for you if it's your first time.  Order eggs (nothing fancy, sunny-side up, over-easy or scrambled), bacon and white toast.  Enjoy your perfect cup of coffee with a nice side of breakfast."], ["scrambled eggs", 1069719006129451008, "@Barnably Streak medium rare or not at all.\n\nScrambled eggs should be made with butter and milk and should be yellow and runny.\n\nMustard is ok but black pepper is evil.\n\nRanch is the only thing that makes salad edible."], ["scrambled eggs", 186118046, "RT @linecook: This review has everything:\n✅visiting Plow at 9:20am on a Saturday\n✅pricing complaints\n✅a scrambled eggs order (???)\n✅a gener…"], ["scrambled eggs", 3292029091, "@milpitas2001 Know anyone who wants a houseguest who cooks a mean lasagne &amp; Chili scrambled eggs?!"], ["scrambled eggs", 3783736949, "Food opinions. \n\nWell done steak is good actually. \n\nScrambled eggs have to be dry or they're gross.\n\nMustard and black pepper are both disgusting. \n\nRanch is king."], ["scrambled eggs", 232754771, "@Choojimmy Made scrambled eggs with it the other day 🚀🚀🚀"], ["scrambled eggs", 330824274, "why couldnt i have kept being the gifted child they thought i was when i was 13 like hello why did reality catch up why do i scrambled eggs for brains now"], ["scrambled eggs", 1134694569944240128, "i have a question for the people who can eat scrambled, fried, sunny side up, poached, boiled, etc eggs..\nhow ? how does your stomach not hurt ? do you just not get nauseous after you get done eating them ? i don’t understand. please answer my questions."], ["scrambled eggs", 186173469, "@michaelbeatty3 @K1erry @realDonaldTrump Scrambled eggs anyone?"], ["scrambled eggs", 291029902, "Callum’s scrambled eggs look nice"], ["scrambled eggs", 925055002762133504, "Scrambled eggs with hollandaise sauce and buttered bread 👌\n\nI love breakfasts ❤ https://t.co/MDnkfBSIwo"], ["scrambled eggs", 21814852, "@irukanjijumanji “I prefer my eggs sunny side up but I won’t turned down soft scrambled eggs..,”\nIt’s like wtf Is going on dudes"], ["scrambled eggs", 924667808507559937, "right in front of my scrambled eggs!!!"], ["scrambled eggs", 4825760830, "now that that tedious art piece is done (and we had some late night scrambled eggs on toast) i'm gonna play some more Last of Us 💪"], ["scrambled eggs", 932993126825734145, "@owlbare Yeah now I  need to go make myself some scrambled eggs... darn it Nate!!! *grumbles off to the kitchen to make food*"], ["scrambled eggs", 379985854, "@owlbare The difference between an omelette and scrambled eggs is a very fine line."], ["scrambled eggs", 852251, "RT @linecook: This review has everything:\n✅visiting Plow at 9:20am on a Saturday\n✅pricing complaints\n✅a scrambled eggs order (???)\n✅a gener…"], ["scrambled eggs", 2793066487, "Scrambled eggs and Spam is actually quite delicious. https://t.co/qChLprtb3V"], ["scrambled eggs", 16383118, "RT @parisreview: “I do not believe in unscrambling scrambled eggs.” —Louis Begley https://t.co/hv7x05QMOD"], ["scrambled eggs", 14265553, "Making our first breakfast: scrambled eggs, Gouda cheese, and avocado in a soft tortilla and fresh pressed coffee. @ Progreso, Yucatan https://t.co/A0Wcq8LwQD"], ["scrambled eggs", 2993018221, "Naked banana pancakes ft. scrambled eggs for breakfast! 🤤✨ https://t.co/HUk6iPV49W"], ["scrambled eggs", 564123876, "I need to fill out a form for a commission soon, but my brains feel like scrambled eggs."], ["scrambled eggs", 1949794028, "@adam08cullen You’ve got scrambled eggs for Brains pal goodnight"], ["scrambled eggs", 85346468, "I thought I’d be fancy and make some omelettes for dinner tonight. The first one was perfect the second just ended up being scrambled eggs because fuck me lol"], ["scrambled eggs", 1025056910683385858, "@leslbbh I like my eggs scrambled 🧐"], ["scrambled eggs", 892077093584076800, "@profallentweets I made pancakes and scrambled eggs for dinner!"], ["scrambled eggs", 529035537, "Scrambled eggs, kielbasa, cauliflower tater tots.... The dinner of champions"], ["scrambled eggs", 1179476988748324866, "RT @jakayden11: If you scramble your eggs but eat less than 3 are you even fucking eating? I eat like 6 scrambled eggs"], ["scrambled eggs", 317505118, "RT @JackieLeeEvans3: Fuck sex, lemme see how your scrambled eggs are looking"], ["scrambled eggs", 2514383323, "RT @jakayden11: If you scramble your eggs but eat less than 3 are you even fucking eating? I eat like 6 scrambled eggs"], ["scrambled eggs", 1433330034, "@DavidTXBrandon I like Tabasco in my scrambled eggs &amp; raw oysters. Not both together..eww"], ["scrambled eggs", 487091308, "Fuck sex, lemme see how your scrambled eggs are looking"], ["scrambled eggs", 1061166959058837504, "@athikers_bob Yum. Sounds delish Bob. I've been doing this thing lately where I steam some brown rice, stir fry or saute veggies, heat some black beans- or any beans- and some scrambled eggs. Put em all together or serve them together. Top with fresh salsa. Simple but good and nutritious."], ["scrambled eggs", 330081217, "@RyanLostinTX @NombreEsJuice Had me some fish tacos on corn tortillas for lunch today.  Because when you’re brown, every day is Taco Tuesday.  Also corn tortillas just go better with certain stuff.  Barbacoa...corn.  Sliced jalapeño sausage &amp; scrambled eggs with a few drops of BBQ sauce...flour."], ["scrambled eggs", 106246962, "@hooleil One order of scrambled eggs and one order of job security, coming right up..."], ["scrambled eggs", 963569361809231872, "Let's finally play some Persona 5 Scrambled Eggs - Watch me at https://t.co/EZVEVw3Nfi"], ["scrambled eggs", 186433645, "@samw6906 Honestly Sam the worst part of that story is that you wanted scrambled eggs when drunk... who the fuck craves scrambled eggs? What’s wrong with good old fashioned cheesy chips? You’re a changed person."], ["scrambled eggs", 2742832996, "RT @vera_musing27: @YungYinkv Her eggs coming out scrambled 💀💀"], ["scrambled eggs", 82444024, "@pizza_slut__ If it makes you feel better I once really wanted scrambled eggs drunk but I was too drunk to forget to scramble them before cooking and went through nearly my entire flats supply of eggs trying to figure out what was going wrong  before I remembered"], ["scrambled eggs", 53788992, "What’s the 1st thing ghetto kids learn to cook on the stove??? My vote is scrambled eggs"], ["scrambled eggs", 1088913470286950402, "i want my eggs cracked and my guts scrambled i’ve never wanted strap so badly in my entire life"], ["scrambled eggs", 631667273, "EGG-CITED ABOUT THIS NEW COOKING HACK 🐣🍅\nEver wonder how breakfast bars and buffet lines achieve SUPER SOFT scrambled eggs? They often add flour and milk! Since this tarnishes the eggs for people with celiac disease… https://t.co/kAoAEDmPGb"], ["scrambled eggs", 2421504660, "RT @LawrWard: 7:30 AM: Muesli and fruit with fat free natural yogurt \n\n11:00 am: Scrambled eggs on whole meal toast \n\n15:00 pm: Salmon and…"], ["scrambled eggs", 361659361, "How young is to young for game day superstitions?? 🤷‍♀️🤷‍♀️...Scrambled eggs before every game is a must for Easton. #weird #gamedaymeal https://t.co/Ct1RqRnOZE"], ["scrambled eggs", 1183223362581139457, "Perona 5 Scrambled Eggs, it is time. https://t.co/wLjGPlDmm8"], ["scrambled eggs", 3351566543, "RT @LawrWard: 7:30 AM: Muesli and fruit with fat free natural yogurt \n\n11:00 am: Scrambled eggs on whole meal toast \n\n15:00 pm: Salmon and…"], ["scrambled eggs", 1224058470724521984, "RT @McClaneJohn2: Not to brag but I can go from making an omelette to scrambled eggs in 35 seconds."], ["scrambled eggs", 946527599500713985, "@thomaskaine5 I think it should have been his brain. It’s like watching the commercial this is your brain on crack This is your brain on trump this is where the scrambled eggs fits in, guys totally crazy"], ["scrambled eggs", 3078124182, "It's our lovely Mabon's 8th gotcha day today! That would make him about 12 years old. He's not slowing down one bit. He had scrambled eggs with his tea. Love him so much. Caru ti gymaint Mabon bach.🧡💚💛💜♥️ https://t.co/c7O06WwDhQ"], ["scrambled eggs", 20120735, "I just saw someone putting peanut butter and jelly in their scrambled eggs and I’m malfunctioning oh god https://t.co/0asY7YOuu6"], ["scrambled eggs", 64269958, "RT @linecook: This review has everything:\n✅visiting Plow at 9:20am on a Saturday\n✅pricing complaints\n✅a scrambled eggs order (???)\n✅a gener…"], ["scrambled eggs", 907343016242946051, "My brain is still like scrambled eggs but now I feel like my eyes have been doused in Tabasco sauce from staring at this computer screen all day. Plus the air quality of this building is like a sauna on steroids. https://t.co/V0vZPfsk98"], ["scrambled eggs", 16294130, "RT @linecook: This review has everything:\n✅visiting Plow at 9:20am on a Saturday\n✅pricing complaints\n✅a scrambled eggs order (???)\n✅a gener…"], ["scrambled eggs", 988165999332610048, "@HeartfeltMomma We also teach ours to cook started with scrambled eggs &amp; 12 can feed himself 🙌🏻"], ["scrambled eggs", 2419356372, "RT @linecook: This review has everything:\n✅visiting Plow at 9:20am on a Saturday\n✅pricing complaints\n✅a scrambled eggs order (???)\n✅a gener…"], ["scrambled eggs", 6089552, "@jon_ontheweb believe it or not, it's scrambled eggs."], ["scrambled eggs", 3364072619, "Some germans I stayed with did this thing where you fry pasta with eggs to make like scrambled egg pasta and you know what? With spice and tomatoes that's An okay depression meal. Still hate myself tho"], ["scrambled eggs", 906628207398572032, "@JohnnyLockson SCRAMBLED EGGS!"], ["scrambled eggs", 1041146781617123328, "scrambled eggs is fun\n\n#P5S\n#NintendoSwitch https://t.co/EUdz2N77XH"], ["scrambled eggs", 1380901, "RT @linecook: This review has everything:\n✅visiting Plow at 9:20am on a Saturday\n✅pricing complaints\n✅a scrambled eggs order (???)\n✅a gener…"], ["scrambled eggs", 1017799400532398085, "@lgbtwentie it was a failed one with some scrambled eggs here rjdjfdj"], ["scrambled eggs", 24915118, "RT @linecook: This review has everything:\n✅visiting Plow at 9:20am on a Saturday\n✅pricing complaints\n✅a scrambled eggs order (???)\n✅a gener…"], ["scrambled eggs", 50326660, "RT @linecook: This review has everything:\n✅visiting Plow at 9:20am on a Saturday\n✅pricing complaints\n✅a scrambled eggs order (???)\n✅a gener…"], ["scrambled eggs", 1062049279307595776, "I started eating scrambled eggs like a week or two ago and I still don’t understand"], ["scrambled eggs", 248668138, "Frasier is all about tossed salads and scrambled eggs. But there's nothing Frasier about voting Fianna Fail, Fine Gael or anyone to the right of them on Saturday https://t.co/eyNerSzEvU"], ["scrambled eggs", 880374750, "RT @vera_musing27: @YungYinkv Her eggs coming out scrambled 💀💀"], ["scrambled eggs", 998567238843105280, "RT @vera_musing27: @YungYinkv Her eggs coming out scrambled 💀💀"], ["scrambled eggs", 782892978511683584, "This Super-Simple Way I Make Scrambled Eggs Feel Fancy https://t.co/VnBvcSTtJW rtplease #recipes https://t.co/4k40V4rupb"], ["scrambled eggs", 125107259, "@TheHappyPriest Also: scrambled eggs &amp; tomato over rice. First scramble the eggs in a little oil until they are very dry, what would be overcooked if you were eating plain. Remove from pan. Add chopped fresh tomatoes and heat until they are just starting to boil. Add the eggs and stir together."], ["scrambled eggs", 751108063847907330, "Yeah baby I hear the blues are calling \ntossed miner's lettuce and scrambled eggs ♪"], ["scrambled eggs", 2707118612, "A crowd favorite for many, Joe's Special will have you wanting more. Two farm fresh scrambled eggs over breakfast potatoes with house sausage. Yum. #atxeats #diner https://t.co/lSLTZrrcA9"], ["scrambled eggs", 940082858491654145, "RT @vera_musing27: @YungYinkv Her eggs coming out scrambled 💀💀"], ["scrambled eggs", 1195171467899609088, "I’m addicted to cheesy scrambled eggs with bacon bits"], ["scrambled eggs", 714676398464565248, "RT @BeagleDaddyy: Cooked Scrambled eggs for the first time ever and it came off so good &amp; fluffy that even @GordonRamsay would be proud of…"], ["scrambled eggs", 494633389, "Linguica hash wit scrambled eggs 👅"], ["scrambled eggs", 3311436959, "RT @vera_musing27: @YungYinkv Her eggs coming out scrambled 💀💀"], ["scrambled eggs", 829621165282951168, "habe some rubbery scrambled eggs"], ["scrambled eggs", 1082369032626540545, "@aborisdrone I don't do mushrooms.\nGonna eat the big ass steak and a load of scrambled eggs made with cream and butter #Delish"], ["scrambled eggs", 3166271731, "I hate the name persona 5 scramble I keep thinking of scrambled eggs"]]