[["shredded chicken burritos", 893652005201338372, "@Bobby_Fleck2 Shredded chicken burritos"], ["shredded chicken burritos", 33107928, "@londontipsy_ 4 shredded chicken burritos :)"], ["shredded chicken burritos", 162844555, "When you order 2 shredded chicken burritos, no rice, and this is what you get. @tacobell what is this lmao https://t.co/mQ6I5zao8A"], ["shredded chicken burritos", 618172850, "@1TechnoBuddy Only 2 of us so most Crockpot use results in freezer food. Love my freezer easy buttons! I always keep chicken mole, chicken for burritos, chili Verdi &amp; shredded beef since we love Mexican food. And chili meat - add beans when ready also spaghetti sauce. Don't want to be out!"], ["shredded chicken burritos", 546170013, "I am looking to stop eating meat as much at home. I love making burritos, things with shredded chicken and casserole type dishes. What are some good meat alternatives (including \"fake meat\" that is healthy and filling) Also where do you even buy it? #vegetarian"], ["shredded chicken burritos", 2961634346, "@PulseYRN There was a shredded chicken burrito, 2 orders of Cinnabon delights, a crunchy taco, 2 Fritos beef burritos and a crunch wrap supreme"], ["shredded chicken burritos", 3012794471, "@Philipmarks87 Breakfast burritos\nEggs w mexican shredded cheese\nChicken or beef\nPeppers and onions\nSalsa\nCottage cheese on the side."], ["shredded chicken burritos", 3033378343, "@sharbradean it means for a brief time you can get buffalo chicken burritos and nacho fries, and since those items have shredded chicken, it is in higher demand which the restaurant probably wasn’t prepared for"], ["shredded chicken burritos", 1120629560, "😺✏ — shredded chicken quesadilla melts and/or cheesy bean and rice burritos with a sugar free baja blast https://t.co/spXhIVtMzO"], ["shredded chicken burritos", 52936686, "@GoddessAntheiaa My favorite is the Mexican pizza. Followed by Chalupas, but I always get 2 chicken burritos substitute for regular chicken (the shredded chicken makes my stomach sick) which extra avacado ranch sauce which a cheesy roll-up on the side 😋"], ["shredded chicken burritos", 842155027351384064, "@ratsinabucket 1) Crested Gecko\n2) Two Shredded Chicken Burritos w/ Extra Avacado Ranch, Large Baja Blast w/ No Ice, One Two-Pack of Cinnabon Delights\n3) Fridays Cause I Only Have One Class and Get To Go Home at 11am\n4) Never Been To One :("], ["shredded chicken burritos", 23319936, "@melissablake @tacobell I crave their shredded chicken burritos from time to time. So tasty."], ["shredded chicken burritos", 203098659, "Walking to my local taqueria for my 2 shredded chicken burritos, regular  w/ extra salsa, no bag https://t.co/3GvXSNAjI7"], ["shredded chicken burritos", 2914607765, "RT @actualwombat: No one asked but Keshan and I are spending Valentine's Day buying $20 of taco bell and eating shredded chicken burritos u…"], ["shredded chicken burritos", 388482062, "No one asked but Keshan and I are spending Valentine's Day buying $20 of taco bell and eating shredded chicken burritos until we nearly throw up.  5 years together, folks."], ["shredded chicken burritos", 768175160, "Dinner turned out amazing! We had burritos filled with shredded chicken, shredded cheese and dirty rice. It was my idea ;0; https://t.co/5X9TjmsHqc"], ["shredded chicken burritos", 2725352898, "omg also i ate 15 shredded chicken burritos in january which is somewhat better because that’s about one every other day.....but still...."], ["shredded chicken burritos", 2725352898, "3:40 am cant sleep going thru my postmates history....just counted and realized i have eaten thirteen (13) taco bell shredded chicken burritos since the beginning of february and today is february 14 which means i eat ~ 1 a day........pain"], ["shredded chicken burritos", 23279831, "@camwoodard @pastelxbutt Look, eventually enough quarters will be in there for me to have several shredded chicken burritos with extra avocado ranch."], ["shredded chicken burritos", 1146559466801963009, "@tyzhayyya I need some shredded chicken burritos"], ["shredded chicken burritos", 509649200, "Chili yesterday, shredded chicken burritos today. Where is my food network tv show at?"], ["shredded chicken burritos", 1041893424, "RT @feenecks: On the verge of tears as At The Door by The Strokes plays and the smell of two (2) shredded chicken burritos engulfs the cabi…"], ["shredded chicken burritos", 1039176088059084800, "RT @feenecks: On the verge of tears as At The Door by The Strokes plays and the smell of two (2) shredded chicken burritos engulfs the cabi…"], ["shredded chicken burritos", 733148084587257857, "RT @feenecks: On the verge of tears as At The Door by The Strokes plays and the smell of two (2) shredded chicken burritos engulfs the cabi…"], ["shredded chicken burritos", 859600480485482496, "On the verge of tears as At The Door by The Strokes plays and the smell of two (2) shredded chicken burritos engulfs the cabin of my car, the pain in my heart eclipsing the torture i put my body through in the gym to try to forget [REDACTED]"]]