[["spaghetti with pesto", 4344524480, "Glistening glossy of all things summer:\n#spaghetti with freshly made #pesto and lemony-garlicky #mushrooms \n\nWhat better way to welcome the bombay summer? A limoncello could help. 😁😋\n\n#eeeeeats #foodstagram #pasta https://t.co/TbRnihToTD"], ["spaghetti with pesto", 16598151, "Came home to this fantastic dinner  left  for me by @jfwoolv from greenchef (chicken with basil pesto and spaghetti squash) and a pour of Blanton’s Bourbon in honor of my Mom. \n\n(My Mom drank Blanton’s Bourbon in… https://t.co/NT6Tm8vZyr"], ["spaghetti with pesto", 2829878231, "HANDS DOWN👏🏻one of the best meals we’ve made for ourselves🥰cheesy garlic wings and gf spaghetti with a special green spinach pesto we’ve been working on for https://t.co/BoFP73YslO!! happy hump day🐪 https://t.co/UmqtqoMCTh"], ["spaghetti with pesto", 571226475, "@happylilly70 Make risotto, pasta with pesto or red sauce, aubergine, jack fruit is great for Thai curries, pulled pork alternative, or Indian Curries. You can buy vegan quorn or normal quorn for chilli or spaghetti Bol or shepherds pie!"], ["spaghetti with pesto", 3022405864, "#throwbackwednesday to this delicious #veganmeal that we had in Warsaw in this truly wonderful #veganhotspot vegemiasto\nDelicious fried 🥟 dumplings (\"pierogi\") stuffed with lentils, pesto spaghetti and potatoes 🥔… https://t.co/1IL55Y52V1"], ["spaghetti with pesto", 522421143, "Spaghetti with Shallot, Red Pepper and Red Pesto Sauce #pasta #vegetarian\n\nhttps://t.co/gSDFN2BVeK https://t.co/skv6tvB0oV"], ["spaghetti with pesto", 740863231951032321, "Parsley Pesto Spaghetti with Asparagus and Caramelized Spring.... #vegetarian #foodie https://t.co/6GX07CuIOi https://t.co/HhpBxiFRvX"], ["spaghetti with pesto", 1373653333, "RT @introvertchefin: Made Spaghetti with homemade pesto last night #introvertchef #homemade #veganmeal #cleaneating #cookingislove https://…"], ["spaghetti with pesto", 67211212, "@greenchef just made Chicken with Basil Pesto (and spaghetti squash). OMG amazing!!!"], ["spaghetti with pesto", 132976919, "RT @introvertchefin: Made Spaghetti with homemade pesto last night #introvertchef #homemade #veganmeal #cleaneating #cookingislove https://…"], ["spaghetti with pesto", 1198776918985904128, "Made Spaghetti with homemade pesto last night #introvertchef #homemade #veganmeal #cleaneating #cookingislove https://t.co/qYhR9wdsdM"], ["spaghetti with pesto", 970654435977388032, "🌴 free, vegan creamy itallian! Here's another super EZ dish that u can feel good about eating 😋 We used Barilla Plus thin spaghetti topped with 3Tbsp Follow Your Heart Pesto Veganiase mixed w/ 1/2 cup unswt almond milk yogurt &amp; salt to taste, &amp; added sliced cherry 🍅s &amp; 🍄s. https://t.co/rufDRjcke8"], ["spaghetti with pesto", 399986728, "Can't wait to get home, cook some spaghetti with pesto, pour a glass of red wine and watch the rest of #TheSplit ❤️"], ["spaghetti with pesto", 4046479924, "Super spaghetti:\nSpelled spaghetti with beetroot and feta pesto: an exquisite and above all vegetarian recipe. Beetroot masters the scene, rich in precious mineral salts, vitamins A and C\nFrancesco chef private \n#cookingclass  #tuscany https://t.co/ihgaKtoDuu"], ["spaghetti with pesto", 242123838, "RT @natural_rem: 🍝How to prepare spaghetti with basil pesto, have a look\nin app #naturalremedies Android https://t.co/EVKTu9EtU2 iOS https://t.co/6urd6PfCgz\n#healthyrecipes #healthydiet #healthyeating #eathealthy #healthtips #healthyfood #gethealthy #h… https://t.co/NV74RtgSB5"], ["spaghetti with pesto", 1194325272, "@Organico_Foods Spaghetti with pesto and courgettes."], ["spaghetti with pesto", 773190904182104064, "🍝How to prepare spaghetti with basil pesto, have a look\nin app #naturalremedies Android https://t.co/bD30w9CkTA iOS https://t.co/ej1z10Ms48\n#healthyrecipes #healthydiet #healthyeating #eathealthy #healthtips #healthyfood #gethealthy #holistichealth #wellbeing #nature https://t.co/eGitqRqr22"], ["spaghetti with pesto", 171441288, "@JayViperTV This time round I cooked it in pesto, but I'll give this ago next time I do something with sauce. The way the way my Spaghetti Bolognese suffers in the microwave...it's too much man."], ["spaghetti with pesto", 17985562, "@sdssben My quick go-to is chopping a bell pepper, an eggplant and half an onion into thumbsize pieces, drizzle with olive oil and season with salt and pepper. Roast for 20-30 mins turning once or twice and then tossing with pesto and spaghetti. A little extra Parmesan on top and done."], ["spaghetti with pesto", 746830998, "This Friday we are hosting an Italian night at our pop up pub that will be including some classics like: 🥗Caprese Salad with Basil Pesto\n🍝Spaghetti Carbonara &amp; Parmesan Shavings\n🍲Risotto Milanese topped with Breaded Lemon Chicken and Arugulan\n😍Pannac… https://t.co/cwJMczBtyx https://t.co/cNoFKmcV35"], ["spaghetti with pesto", 746830998, "This Friday we are hosting an Italian night at our pop up pub that will be including some classics like: 🥗Caprese Salad with Basil Pesto\n🍝Spaghetti Carbonara &amp; Parmesan Shavings\n🍲Risotto Milanese topped with Breaded… https://t.co/0fNkqkmL28"], ["spaghetti with pesto", 16843920, "Spaghetti with pesto, chickpeas and Puy lentils. Sooo good! 😋"], ["spaghetti with pesto", 89511627, "I've been craving pasta since I ended the Whole30 and so tonight I made a Trader Joe's Whole30 pesto spaghetti squash with balsamic roasted chicken and tomatoes. https://t.co/ASjPVnM8yZ"], ["spaghetti with pesto", 956581164, "@elegantLAB sorry to spam but also i HAVE lived off of this (you don’t need a mortar and pestle! just look up cutting board garlic trick) https://t.co/1MJKQ6GoPe"], ["spaghetti with pesto", 16452379, "I went total @bluezones tonight, cooking from the Blue Zones Kitchen cookbook. Spaghetti with Walnut Pesto, Cabbage and Sun-Dried Tomato Sauté and red wine. All delicious. I used whole wheat spaghetti and pecorino… https://t.co/iWLeNJrlu6"], ["spaghetti with pesto", 215383992, "You cannot with a straight face ask for spaghetti with meat sauce, pesto and alfredo, that simply is not possible."], ["spaghetti with pesto", 1225380001, "Freshen it up with this light spiralized ZUCCHINI PESTO recipe with mushrooms and cherry tomatoes! &gt;&gt;&gt; https://t.co/Yh9JWEfPHn https://t.co/gVqcoRb4AS"], ["spaghetti with pesto", 1070446312544456705, "@stjepansejic Looks like pesto spaghetti... can Ivy control pasta? Cause, plant based, and she can control things with bark which iirc is ‘dead’ so..."], ["spaghetti with pesto", 260194975, "So, I don't lyk eating cheese. The only cheese I'm eating are powders from junkfood, cheesesticks with no real cheese, parmesan cheese, cheese on top of spaghetti, dissolved cheese in pesto sauce, cheese on pizza dominated by tomato sauce."], ["spaghetti with pesto", 1046246550974943232, "@Matthias_Wulff The normal spaghetti or spaghetti with pesto, I like both"], ["spaghetti with pesto", 1034926178421944322, "why did i eat pesto spaghetti with gravy for dinner last night????? am i a gremlin ?????????"], ["spaghetti with pesto", 108745518, "#Spaghetti with Sun-Dried-Tomato-Almond Pesto https://t.co/an25saBAUf via @foodandwine #recipe #foodandwine"], ["spaghetti with pesto", 19993830, "Making spaghetti with a homemade green pesto. Serving with peas and possibly a handful of pine nuts.\n\nI’m amazed I made the effort. I’ve got some chocolate just staring right back at me, and I’m eager to hit that at some point this evening."], ["spaghetti with pesto", 33919097, "Spaghetti with SunDried Tomato &amp; Pistachio Pesto, who would ask for anything more?\n\n#dinner #spaghetti #pesto #pasta #pastarecipes #sundriedtomato #pistaschio #quickmeals\n\nhttps://t.co/jUXoadUfek https://t.co/aRww08GKsQ"], ["spaghetti with pesto", 37362704, "Spaghetti in #RGTK’s premium Basil Pesto with wild-caught (never frozen) shrimp from https://t.co/2Cqwx4mk9I. Try some at the #realgirltoykitchen cafe or just snag a bottle of pesto to enjoy at home. @ Holism Center https://t.co/tJp9qYCZ2b"], ["spaghetti with pesto", 4825604786, "ICYMI: Pesto made with watercress! Yes, that's right! #partner @BWQualityGrwers \nhttps://t.co/ca70IWeLlw https://t.co/BVfLM4ft7Y"], ["spaghetti with pesto", 2340162037, "#sleepmenu 🔈Black Soy Bean spaghetti (high in tryptophan) with spinach (high in Magnesium and B6) and peas in a green pesto Parmesan Sauce ( #happyfood )  🥘 🥙| this little homemade quick dish is high in the sleep… https://t.co/SIOnRTVvRZ"], ["spaghetti with pesto", 748011207546781696, "Spaghetti In Pesto Sauce With Cherry Tomatoes\nhttps://t.co/JfIGtnN6Rz\nhttps://t.co/9ODX7grCYm\n#foodblog #foodbloggers #food #foodies #recipe #recipeblog #yummy #cooking #vegetarian #feedfeed #indianfood #delicious @FoodFood @worldfoodindia @TimesFood @IndianFoodMag @LivingFoodz https://t.co/sZThulnqn0"], ["spaghetti with pesto", 2511455998, "@glennkirschner2 @yasminv @AymanM @mjfirstlook @MSNBC Getting ready to have spaghetti with pesto for breakfast. 😂"], ["spaghetti with pesto", 1942556971, "@sleepyredshiba @ismaisuke @yamatonakano 😆😆😆😆😆indeed! I was talking that spaghetti al pesto di rucola was the best! it was served with chopped black olives with honey and it was really good. I want to eat it again but that place is so far and I'll not be able to cook like that..."], ["spaghetti with pesto", 1127068615784697856, "RT @diorballerina: can’t wait for Valentine’s Day, im going to make my love a candlelit dinner with appetizers like bruschetta, baked Brie…"], ["spaghetti with pesto", 2736055339, "RT @SIMANGIATV: #Spaghetti with #pesto and walnuts from #yummy IG profile @simone_bertuccelli. 👏🇮🇹😋#italianfood https://t.co/jb8mGikRJQ"], ["spaghetti with pesto", 405019096, "RT @giuseppegurgone: Italian cuisine specific:\n\n- you need to distinguish and taste the (few) ingredients \n- don’t put pesto or garlic ever…"], ["spaghetti with pesto", 75840965, "Italian cuisine specific:\n\n- you need to distinguish and taste the (few) ingredients \n- don’t put pesto or garlic everywhere \n- there is no such thing as creamy X\n- a piece of meat with spaghetti is no-no\n- put the cheese on your pizza half way into baking"], ["spaghetti with pesto", 25997903, "@NellFrizzell @NotRollergirl Spaghetti with a whole jar of pesto and peas"], ["spaghetti with pesto", 1035566172593315841, "@tyler_casper @PizzeriaLuca in Albuquerque, NM.   The best eggplant parmigiana, spaghetti side, grilled scallops wrapped in bacon with pesto.  A fine Chianti.   Perfection!  😍"], ["spaghetti with pesto", 74516561, "Spaghetti squash with homemade pesto topped with toasted pine nuts, red pepper flakes, &amp; homemade vegan parmesan. With a side of Italian roasted veggies https://t.co/03FaE4C3zC"], ["spaghetti with pesto", 724419398623203329, "@noitsleviOsah I have been using about a good tablespoon of jarred pesto in different flavors.  Artichokes or tomato.  It's really good with grated parmesan!  I'm not a big spaghetti sauce fzn!"], ["spaghetti with pesto", 4825604786, "Pesto made with #watercress? We think so! #partner @watercresslife https://t.co/ca70IWeLlw https://t.co/Z52GilkPvZ"], ["spaghetti with pesto", 24924766, "Spaghetti with Walnut Pesto and Broad Beans https://t.co/VWKV9LZU3I"], ["spaghetti with pesto", 1150248394784251904, "can’t wait for Valentine’s Day, im going to make my love a candlelit dinner with appetizers like bruschetta, baked Brie and baguettes, variety of olives and tapenade, an Italian pesto spaghetti, marinated New York strip steak, chocolate covered strawberries and a cheesecake... ♡"], ["spaghetti with pesto", 22549540, "Tomorrow in the Dining Room: Veggie Spinach and Collard Greens with Pesto Cream over Spaghetti.  🌿🍝 https://t.co/L7MSduYKti"]]