[["spicy onions", 45722385, "Let me introduce you to the best sandwich I’ve ever had. @panerabread Tomato basil bread, roasted turkey, bacon, avocado, frizzled onions(extra), mayo, and spicy mustard. https://t.co/pWeC3AUOEw"], ["spicy onions", 361817639, "One of our Vegan starters! 😍\nTempura of Vegetables - Mushrooms, onions and zucchini in a tempura batter served with seasonal leaves and a spicy tomato dip.\n\nView our vegan menu here ➡️ https://t.co/tJEpW8lFdS\n\n📞0141 248 2481 https://t.co/d8dm2zCBGq"], ["spicy onions", 75343811, "Fill it with spicy italian sausage, peppers and onions and we can talk. https://t.co/DhEwE39Lzu"], ["spicy onions", 46480889, "⭐🍔⭐ Yesterday's most popular #SpecialtyBurger? Giddy up with the #Texican ⭐  A #Midi or #Maxi 🍔 with Avocado 🥑  Jalapeños 🌶️ Onions, Spicy Mayo Sauce &amp; Cheddar Cheese 🧀 #lunch 🕐 #dinner 🕕 #beer 🍺 #wine 🍷 ⭐🍔⭐ https://t.co/d9uZLCvDxu"], ["spicy onions", 762331273083904000, "@tom_coote @oriabrahams Tom you dont eat onions cos there spicy you melt"], ["spicy onions", 138559332, "@dancingbear76 @1HowardWalker @RossWigham @coyknorth The statement it sent for me was large donner, salads, chilli and garlic sauce, spicy onions, chips with mayonnaise and a coke"], ["spicy onions", 1171543563055681536, "RT @AHSSA_Sauce: Korean Spicy Japchae are glass noodles (potato noodles) stir fry loaded with shrimp, shiitake mushrooms, carrots, onions,…"], ["spicy onions", 1425728113, "Yo @Wendys , I love your Spicy Chicken Sandwhich (better than the fakers out there), but last time they put Ketchup and Onions on it and I have never been more sad"], ["spicy onions", 974443070115721218, "@tyler_casper Swedish meatballs in a spicy sauce, sautéed Italian zucchini &amp; onions w Parmesan cheese, mashed potatoes, and garlic bread. Last night. I almost always cook from scratch."], ["spicy onions", 252314491, "RT @sodaNnuggets: How did you start your morning? \n\nI started mine with a early morning workout and breakfast to follow. \n\nBreakfast pouch:…"], ["spicy onions", 1044741668065484800, "How did you start your morning? \n\nI started mine with a early morning workout and breakfast to follow. \n\nBreakfast pouch: vegan sausage and mushrooms cooked in garlic &amp; herbs. Seasoned tofu scramble with peppers, onions, and jalapeños. Baby spinach, spicy hummus, and salsa. 🌱 https://t.co/RFzsnHAn1i"], ["spicy onions", 250713204, "A torta filled with  chili con carne, oaxaca cheese, cilantro, black beans, raw onions, and spicy mole sauce with a side of mexican slaw"], ["spicy onions", 250713204, "3 tacos, each with  chorizo, vegan cheddar, tomatoes, black beans, raw onions, cilantro, and spicy mole sauce plated with mexican corn salad"], ["spicy onions", 250713204, "A chimichanga filled with  ox tongue, smoked cheddar, lettuce, cilantro, black beans, raw onions, and spicy mole sauce with a side of rice and beans"], ["spicy onions", 250713204, "A chimichanga filled with  sauteed vegetables, pepper jack, cilantro, raw onions, and spicy mole sauce with a side of rice and beans"], ["spicy onions", 250713204, "2 tacos, both with  tofu, smoked cheddar, raw onions, tomatoes, and spicy mole sauce with a side of mexican potatoes"], ["spicy onions", 1217773598, "@William_Ukpe Oga stop complaining please....\n\nJust join the LCC....\n\nAnd eat to your fill.....\n\nSpicy people with onions and crony policies.... https://t.co/RA2VeNj3vb"], ["spicy onions", 250713204, "A torta filled with  chorizo, cotija cheese, cilantro, black beans, raw onions, and spicy mole sauce served with a side of guacamole"], ["spicy onions", 1174639256863510530, "@adamliaw Thick beef sausages from the butcher (after he puts through a jar of my chilli kasundi through the mixture), 4 seed grain bread, cooked onions &amp; my homemade spicy tomato relish (dollop of sour cream for those that can't handle spicy)"], ["spicy onions", 250713204, "2 tacos, both with  roasted portabellos, cotija cheese, cilantro, raw onions, black beans, lettuce, and spicy mole sauce served with rice and beans"], ["spicy onions", 849409041428348928, "RT @AHSSA_Sauce: Korean Spicy Japchae are glass noodles (potato noodles) stir fry loaded with shrimp, shiitake mushrooms, carrots, onions,…"], ["spicy onions", 206473078, "RT @latimesfood: Spicy chorizo and melty cheese make this Oaxacan tlayuda super rich https://t.co/koFPAi6eQU"], ["spicy onions", 17305566, "@EvaninSEA @CableThanos_ @NotAboutClout Imagine thinking white onions are spicy...\n\nBoth Apple and Android are good in their own rights. Neither are clearly better than the other. It all boils down to preference and budget."], ["spicy onions", 1221881394462367749, "I made this sandwich with onions and called it 'Spicy Astroturf' because it has hazelnut  on multigrain bread."], ["spicy onions", 4688143476, "RT @latimes: Spicy chorizo and melty cheese make this Oaxacan tlayuda super rich https://t.co/SmLMGbKQWO"], ["spicy onions", 53697986, "Don’t ever dead that 2 for $5\nSpicy nuggets with the spicy chicken sandwich no mayo just onions... add a large strawberry lemonade light ice.... 🚀 https://t.co/UYOjvJcHxN"], ["spicy onions", 1091130207023464448, "RT @AHSSA_Sauce: Korean Spicy Japchae are glass noodles (potato noodles) stir fry loaded with shrimp, shiitake mushrooms, carrots, onions,…"], ["spicy onions", 2852897025, "Korean Spicy Japchae are glass noodles (potato noodles) stir fry loaded with shrimp, shiitake mushrooms, carrots, onions, bell pepper, spinach with Ahssa Hot &amp; Spicy Sauce.\n\n#ahssagourmetsauce \n#koreanfood \n#minoritywomanowned https://t.co/naqqq4ydu9"], ["spicy onions", 11847762, "Putting pink pickled onions and pink spicy mayo on my pink beet-feta burgers. Should have saved this meal for Valentine’s Day!"], ["spicy onions", 854195509, "@ChiefPhD I chopped up red, green, yellow bell peppers, onions, and the batch of andouille sausage I got was already really spicy. I also chopped up a handful of jalepenos and I think I should’ve only used two or one instead of like 5 😭😭😭😭😭😭😭😭😭😭"], ["spicy onions", 250713204, "2 tacos, both with  pulled pork, fontina cheese, black beans, raw onions, and spicy mole sauce with a side of guacamole"], ["spicy onions", 4083597374, "onions are spicy and i refuse to eat them raw anywhere"], ["spicy onions", 891491510419472384, "@charlesraustin The worst was when your roommate painstakingly crafted you a pork burger with carmleized apples and onions seasoned and you slathered bbq sauce, mustard, and spicy red pepper flakes on it before trying it"], ["spicy onions", 24913884, "\"My Moms' Chili Pie\" is what'ts for dinner; corn chips, spicy, all meat chili, sharp cheddar, onions, celery, sour cream &amp; salsa. Good stuff."], ["spicy onions", 1084617170, "@gontranboner I feel you. I love onions. Instant heartburn. (Especially red ones) I love spicy things. Acid from gut to tongue.\nI take omeprozole every day to help, but I still can't eat the things I love.\nI miss jalapenos so very much.\nI'm sorry to learn that your stomach is also sensitive"], ["spicy onions", 410013106, "RT @PinthousePizza: We've teamed up with @StilesSwitchBBQ to create the Buford T. Justice Diablo pie for our Burt-Day Bash this Saturday! A…"], ["spicy onions", 815371766, "Thanks to @naturessoy I made a spicy chickun salad with red onions, fried plantains and a creamy cashew dressing\n#food #salad #healthyfood #healthyeating #vegan #veganfood  #healthyvegan #plantbased #meatfree #dairyfree #blackvegan #homecooking #vegancook #chicagovegan https://t.co/YlmoHhCyTc"], ["spicy onions", 3119773504, "RT @discoverNAfrica: • Koshary / كشاري - is an Egyptian dish made of rice, macaroni &amp; lentils all mixed together &amp; topped with spicy tomato…"], ["spicy onions", 1907768750, "DINNER  2/5   LASAGNA/ SAUSAGE W/ ONIONS &amp; PEPPERS/ SPICY CHICKEN SANDWICH/ FRESH SALAD/ VEGETABLES/ SUB SANDWICHES/ WRAPS/ PIZZA/ DESSERTS😃"], ["spicy onions", 2460435340, "Homemade pizza: tom purée, chopped green &amp; red peppers, sliced red onions, chopped garlic, spicy soya protein, chopped pineapple, spinach leaves, vegan mozzarella, &amp; dried Italian seasoning. 🍍🍕🌱😋\n\n#veganrecipes… https://t.co/3OqqgwjxHF"], ["spicy onions", 419161351, "@jimmyjohns My Spicy Italian was delivered with no peppers or onions and this is the second time I've ordered a sandwich with extra pickles - this time it came with four, last time ti came with only one. So sad. 😥 #Ilovepickles"], ["spicy onions", 543828053, "I took my spouse's name, but before that you knew me as The Belch. And just like Papa Belcher before me, I'm a burger woman. This is a burger with folded egg, charred onions, and spicy ketchup. The american cheese I was dumb enough to put on it demands it remain nameless. https://t.co/k5ua2dpNqr"], ["spicy onions", 4204226260, "@CraigbryCraig I prefer sharp fast pains over long ones. And we got really spicy onions."], ["spicy onions", 32440030, "RT @latimes: Spicy chorizo and melty cheese make this Oaxacan tlayuda super rich https://t.co/SmLMGbKQWO"], ["spicy onions", 4204226260, "Today I found out:\nEating spicy onions raw is worse for me than eating jalapenos."], ["spicy onions", 1199338177015746562, "RT @latimes: Spicy chorizo and melty cheese make this Oaxacan tlayuda super rich https://t.co/SmLMGbKQWO"], ["spicy onions", 1223653059827384320, "RT @latimes: Spicy chorizo and melty cheese make this Oaxacan tlayuda super rich https://t.co/SmLMGbKQWO"], ["spicy onions", 955366241870413824, "@AthleticArriola Some spicy chicken with peppers, chilies and onions. Gonna throw in some spinach a little later too"], ["spicy onions", 250713204, "A chimichanga with  chorizo, fontina cheese, tomatoes, raw onions, and spicy mole sauce with mexican potatoes on the side"], ["spicy onions", 15130854, "RT @latimesfood: Spicy chorizo and melty cheese make this Oaxacan tlayuda super rich https://t.co/koFPAi6eQU"], ["spicy onions", 1044741668065484800, "Made a delish breakfast burrito for my honey &amp; I. \n\nVegan sausage seasoned with some herb and garlic, firm tofu cooked with orange and green peppers, onions, and mushrooms... filled spicy humus, salsa, and romaine lettuce. 😭"], ["spicy onions", 2612223967, "Last day for Succotash! This spicy stew of red beans, corn, okra, tomatoes, peppers and onions is #vegan and #glutenfree and featured on today’s menu #ingrandview #5xnw #columbusohio #614 #feedyoursoul… https://t.co/13JRHlrqy7"], ["spicy onions", 17796018, "Spicy chorizo and melty cheese make this Oaxacan tlayuda super rich https://t.co/koFPAi6eQU"]]