[["spicy tomato soup", 611652041, "5 Minute Vegan Tomato Soup – spicy &amp; creamy! #foodblog #recipes https://t.co/366kZjVtKA"], ["spicy tomato soup", 877270515957870592, "@killacayls Haha I wish I would have gotten spicy tacos too. Instead I got a fancy grilled cheese with tomato soup.. without the tomato soup. (:"], ["spicy tomato soup", 3744356661, "RT @palatableplate: Caldo de Camaron is a tomato based Mexican shrimp soup flavored with ancho and pasilla chiles and vegetables in a light…"], ["spicy tomato soup", 768108832727920640, "The Big Soup Taste was amazing!! Thank you all for coming to join in. Spicy vegetable lentil soup won with the beetroot and tomato soup a close second! Well done reception and nursery classes! #woodygrowhealthy @ChefsinSchools https://t.co/b3aSSomfOu"], ["spicy tomato soup", 2175667488, "RT @MojosCafe: It’s a vaguely romantic day right? Treat yourself or a loved one to some smoked salmon and tarragon scrambled eggs on a toas…"], ["spicy tomato soup", 246810232, "For lunch downstairs it’s Fish Or Spicy Chicken Sandwich. Other lines offer Pizza, A La Carte items, or the Soup and sandwich  Bar. Upstairs in the Food Court, it’s the Tomato soup and grilled cheese. For Breakfast TUESDAY, it’s Pancake on a stick."], ["spicy tomato soup", 963007243821223936, "RT @MojosCafe: It’s a vaguely romantic day right? Treat yourself or a loved one to some smoked salmon and tarragon scrambled eggs on a toas…"], ["spicy tomato soup", 2618765939, "It’s a vaguely romantic day right? Treat yourself or a loved one to some smoked salmon and tarragon scrambled eggs on a toasted multiseed bagel! Soups of love today are tomato and basil, broccoli and stilton or spicy tomato 🔥❤️❤️❤️#valentines #smokedsalmon #soup https://t.co/hQgKP9V7wX"], ["spicy tomato soup", 1082486918737260545, "RT @kerbeylanecafe: NEW on our #SpringMenu! Grilled Cheese Combo: Melted swiss, asadero &amp; sharp aged white cheddar with spinach, tomato, an…"], ["spicy tomato soup", 1225587443354787840, "RT @Notyour28981739: @Rectitude20 If you like veg or tomato juice, put a jug in a pan, crush as many cloves of garlic as you can stand, and…"], ["spicy tomato soup", 18382863, "NEW on our #SpringMenu! Grilled Cheese Combo: Melted swiss, asadero &amp; sharp aged white cheddar with spinach, tomato, and our housemade red bell pepper tomato sauce on grilled rustic Italian bread. Served with choice of homemade spicy tortilla soup, veggie chili, or beef chili. https://t.co/smel9WzwJB"], ["spicy tomato soup", 1103715945426702337, "@Rectitude20 If you like veg or tomato juice, put a jug in a pan, crush as many cloves of garlic as you can stand, and just warm it up. Put fresh lemon juice and hot sauce in it. Drink and (maybe) enjoy.  It's like a super spicy, tart tomato soup, but you will feel better in an hour."], ["spicy tomato soup", 4311797175, "Tonight winter warmer ..,a Tomato soup, with touch of spicy chilli sauce, Worcester sauce with seasoned cheese on toast croutons https://t.co/49B3gwKNod"], ["spicy tomato soup", 1114690906559537152, "@RoosterTeeth Chili with no beans is just spicy tomato soup."], ["spicy tomato soup", 498019741, "Vegetable barley soup. Sesame tofu. Lettuce turkey tomato avocado roll up. Sweet spicy cauliflower. Garlic chili pasta. Buffalo chicken pizza."], ["spicy tomato soup", 457066083, "LAMBWICH Today!!!!  Souvlaki marinated and sous vide leg of lamb.  Sliced thin and loaded on a soft F&amp;F baguette with compressed onion, marinated tomato and cucumber, spicy harissa yogurt sauce and fresh herb.  Soup is hot, heat is on. Come see us!!! https://t.co/V9fhkXHezT"], ["spicy tomato soup", 1482625783, "omaigod I wanted to get myself eel soup from foodpanda and I ended up ordering eel in creamy spicy tomato sauce bc am such a cheapskate tonight"], ["spicy tomato soup", 2618765939, "Check out the ever popular meal deal! Choose from carrot &amp; coriander, tomato &amp; basil or spicy tomato, add a 3 filling toastie plus you get tortilla chips and dipping salsa! Lovely 😋 #soup #vegan #glutenfree #mojos #mealdeal https://t.co/vSZKWhRNMN"], ["spicy tomato soup", 2522743187, "A grill cheese sourdough sandwich with a spicy thick creamy tomato/ potato soup 🤤🤤🤤🤤"], ["spicy tomato soup", 1180332554605363200, "midnight grilled cheese and spicy tomato soup 😋"], ["spicy tomato soup", 747000333369544704, "@bzdarling @yung_minaa That spicy tomato soup is crazy"], ["spicy tomato soup", 18729871, "@sick__66 matzo ball soup, tomato bisque, french onion soup, cheesy potato soup with bacon, spicy chicken tortilla soup. Damn, so many soups."], ["spicy tomato soup", 389011646, "Lunch 11:15am-1:15pm\nSOUP DAY; Caesar Salad; Soupbowl; Cheese; Fruit; Toscana Kale Soup; Homemade Spicy Tomato Soup; Thai Coconut Chicken Soup; Grilled Cheese Station; Chocolate Cheesecake. https://t.co/k41URUnQbW"], ["spicy tomato soup", 2894660804, "Why yes, I just crumbles some aged cheddar into my spicy tomato soup.\nWill this be an issue?"], ["spicy tomato soup", 801549353227841536, "@daralynn13 Spicy sweet potato soup, tacos with chili beans or chickpeas instead of beef, fried rice with egg, corn, onion and cashews, pasta with homemade tomato sauce and basil. \n\nGood luck! 😊"], ["spicy tomato soup", 197198939, "Salsa is just Campbell’s Spicy Chunky Tomato Soup"], ["spicy tomato soup", 392465415, "Taco Tuesday! Today is Veggie Tacos, Roast Potato, Oven Dried Tomato, Chipotle Goats Cheese, Mango Hot Sauce, Greens, Fresh Cilantro, and Pickled Jalapeño! Pizza is Spicy Ground Beef and Mango Hot Sauce! and Clam Chowder is back on as le soup du jour. #numefood #tacoseveryday"], ["spicy tomato soup", 579871092, "RT @peerieshopcafe: Well it’s a bit dreich out there this morning but we have some lovely pea and ham soup to warm you up! Or there’s spicy…"], ["spicy tomato soup", 1100248217650753536, "RT @LifeTimeCooking: Indian Spicy Tomato Soup https://t.co/99qFBEQdIv https://t.co/yVs1Gr0krV"], ["spicy tomato soup", 23934518, "Indian Spicy Tomato Soup https://t.co/99qFBEQdIv https://t.co/yVs1Gr0krV"], ["spicy tomato soup", 720246827568631808, "Tuesday 11th February Soup of the Day is Spicy Tomato"], ["spicy tomato soup", 845589045518458881, "Tuesday's specials:\n‣ Spicy arrabbiata\n‣ Low &amp; slow beef brisket ragu\n‣ Tomato &amp; basil soup\n‣ Broccoli &amp; blue soup https://t.co/nCJSiTBJgq"], ["spicy tomato soup", 475324329, "Well it’s a bit dreich out there this morning but we have some lovely pea and ham soup to warm you up! Or there’s spicy bean and tomato or lots of other delicious lunch time treats...#peerieshopcafe #madebyus #lerwick #shetland https://t.co/NRHxSPYASh"], ["spicy tomato soup", 1199437150749679618, "@satanavbles Nah what u do ready: Get tomato soup, stir the takis in the soup a lil bit. Then eat the takis, (which are now warm tortilla chips) and eat the spicy tomato soup 😌"], ["spicy tomato soup", 611652041, "5 Minute Vegan Tomato Soup – spicy &amp; creamy! #foodblog #recipes https://t.co/366kZjVtKA"], ["spicy tomato soup", 6350582, "RT @haschischtasche: Made @foodwishes' Lebanese Mountain Bread today. Enjoying it with a spicy rich tomato soup. :] https://t.co/RsweSi6rrX"], ["spicy tomato soup", 326177364, "Made @foodwishes' Lebanese Mountain Bread today. Enjoying it with a spicy rich tomato soup. :] https://t.co/RsweSi6rrX"], ["spicy tomato soup", 933502784, "I find tomato soup spicy???? And I'm obsessed with it ???? https://t.co/KMv423GZsp"], ["spicy tomato soup", 778012483239878656, "Good Monday everyone.  We hope you all had a great weekend.  Today Yano's has Tomato Basil Soup as our Soup of the day.  Our entrée special is a Grilled Cheese on Multi Grain with Swiss, Spinach, Sauteed Mushrooms and a Light Spicy Aioli.  In the deli case we have Caesar Pasta Sa"], ["spicy tomato soup", 1158819121418649601, "Made a tasty grilled cheese with some spicy tomato soup tonight, very full and unsure what to do with my life other than write poetry. Any suggestions?"], ["spicy tomato soup", 350149550, "A perfect food for this cold weather! A perfect mix of spicy soup and tomato base soup adding in all the seafood you love and veggies ofcourse! ❤️ #hotpot #foodie #foodlover #foodgasm #pescetarian #pescetransian https://t.co/ndQkc8wruX"], ["spicy tomato soup", 1214749732045774848, "RT @Souper_licious: Mornin’ Soupers! Packing up our spicy vegan tomato &amp; vegan green pea, spinach and mint #soups for a soup tasting in #Bi…"], ["spicy tomato soup", 1491923196, "Today’s soup is spicy tomato yes it’s amazing I’m a great chef I expected nothing less"], ["spicy tomato soup", 3150311, "RT @chilepeppergeek: New recipe post -- Quick and Spicy Tomato Green Chile Soup https://t.co/6DCd6J9SkR https://t.co/PMWW7u18ES"], ["spicy tomato soup", 105660982, "RT @Souper_licious: Mornin’ Soupers! Packing up our spicy vegan tomato &amp; vegan green pea, spinach and mint #soups for a soup tasting in #Bi…"], ["spicy tomato soup", 2439262509, "If you are what you eat, then i am a spicy flavorful tomato soup. https://t.co/g2ycnwEIKs"], ["spicy tomato soup", 112920147, "RT @HurmerintaArt: Welcome to my soup dinner. Lets start with salad, then enjoy tomato soup, carrot soup, bread, cheese, basil, herbs, spic…"], ["spicy tomato soup", 3150341879, "Welcome to my soup dinner. Lets start with salad, then enjoy tomato soup, carrot soup, bread, cheese, basil, herbs, spices, olives, vegetables, salad, lime, berries and figs. Soups are good and healthy, and hot spicy soup is terrific any time of the year. https://t.co/de0wlp8hws"], ["spicy tomato soup", 963007243821223936, "RT @nearspaceman: wicked weather building up outside, so it's comforting soup for lunch. This time spicy Green lentil, chorizo, carrot &amp; to…"], ["spicy tomato soup", 257956897, "wicked weather building up outside, so it's comforting soup for lunch. This time spicy Green lentil, chorizo, carrot &amp; tomato 😋 #soup https://t.co/wowVTHKJc0"], ["spicy tomato soup", 1167413363875504128, "RT @dljaques: @BootstrapCook @HackneyAbbott I have only ever followed one recipe in my 56 years. It was for your spicy tomato soup.   The w…"], ["spicy tomato soup", 1136311802038497281, "@ryonello tomato bisque, corn chowder, and there’s this spicy sausage &amp; rigatoni soup that campbells makes 🤩"], ["spicy tomato soup", 212678031, "RT @Souper_licious: Mornin’ Soupers! Packing up our spicy vegan tomato &amp; vegan green pea, spinach and mint #soups for a soup tasting in #Bi…"], ["spicy tomato soup", 706152734194593792, "Mornin’ Soupers! Packing up our spicy vegan tomato &amp; vegan green pea, spinach and mint #soups for a soup tasting in #Biel/#Bienne! Rrvipes for these beauties are on our site!  #Soupseason #Souptasting #ilovesoup #soupweather https://t.co/MfSuR9EEV3"], ["spicy tomato soup", 611652041, "Have you tried my delicious Vegan Tomato Soup yet? Spicy, creamy and made from just 8 pantry ingredients😋 https://t.co/MFRSPO2RCk #vegan #glutenfree #soup https://t.co/ZSmW9XheQ7"], ["spicy tomato soup", 492461846, "@marxist_tech @fOrGiVeNcHy @TomSteyer I'm a Tulsi stan so I like it spicy. \n\nAmy K is mild like tomato soup for a hungover tummy. Has her place."], ["spicy tomato soup", 611652041, "5 Minute Vegan Tomato Soup – spicy &amp; creamy! #foodblog #recipes https://t.co/366kZjVtKA"], ["spicy tomato soup", 798184692, "RT @Balweariefood: Mrs Farmer's S3 were learning to peer assess &amp; give feedback. Lots of independent learning and dovetailing while they ma…"], ["spicy tomato soup", 798184692, "RT @Balweariefood: Mrs Farmer's S3 were learning to peer assess &amp; give feedback. Lots of independent learning and dovetailing while they ma…"], ["spicy tomato soup", 935275697064566784, "Mrs Farmer's S3 were learning to peer assess &amp; give feedback. Lots of independent learning and dovetailing while they made Spicy Tomato Soup with Breakfast Muffins. 🍅 Assessors were the teacher's eyes and ears and they were very focused. @BalwearieHigh #peerassessment #feedback https://t.co/Dx9CUjiYEB"], ["spicy tomato soup", 270069333, "My Box Local veg box is making me cook with more variety - this spicy tomato soup has loads of fresh spinach in and on it! Chop up the stems to use some leaves for a fresh, crunchy topping. @boxlocalfood https://t.co/fTvSNImI4a"], ["spicy tomato soup", 935275697064566784, "Mrs Farmer's S3 were learning to peer assess &amp; give feedback. Lots of independent learning and dovetailing while they made Spicy Tomato Soup with Breakfast Muffins. 🍅 Assessors were the teacher's eyes and ears and they were very focused. @BalwearieHigh #peerassessment #feedback https://t.co/NpAF1NjcS1"], ["spicy tomato soup", 457357446, "@ThatDaengSauce \nVery nice in my tomato soup with hard boiled eggs. \n#spicy #sauce #soup #tomatosoup https://t.co/PwKqjU4nrU"], ["spicy tomato soup", 2904955005, "Trying to track down Baxter's Spicy Tomato &amp; Rice soup, my favourite tinned soup (I don't like lot of tinned soups, I'll be honest!) - not in any supermarkets &amp; in stock on Asda's website but they can't actually send me any 😭 might have to buy in bulk from the Baxter's website!"], ["spicy tomato soup", 873148140051935233, "I’m so into this concept. ASIAN ITALIAN // Lumpia with burrata, meatball, spicy tomato and egg drop soup with celery root, pecorino romano, jalapeño at ABC Pony in Navy Yard, DC\n.\n.\nRating: 9 out of Chen https://t.co/HIrRC32bCk https://t.co/tPgDjIjgXH"], ["spicy tomato soup", 873148140051935233, "I’m so into this concept. ASIAN ITALIAN // Lumpia with burrata, meatball, spicy tomato and egg drop soup with celery root, pecorino romano, jalapeño at ABC Pony in Navy Yard, DC\n.\n.\nRating: 9 out of Chen https://t.co/jzzYOOPAHr"], ["spicy tomato soup", 1065601572405723136, "Nothing beats a bowl of hot &amp; sizzling soup on a chilly winter eve, with a companion. This spicy tomato soup is exactly what you need this evening. Visit 6Flavors today and enjoy delicious tomato soup … Order Online at https://t.co/i6VEYTfHEh for pickup or delivery https://t.co/mv8kN2iY8z"], ["spicy tomato soup", 3181776360, "When I ordered tom yum soup in Karon of Phuket, an area popular with white people, the lady asked me if I wanted the soup \"spicy or non-spicy\". Firstly, what the fuck is non-spicy tom yum soup? Are white people here just eating tomato and mushroom soup??"], ["spicy tomato soup", 286761569, "@PieLadyChicago Chicken soup! (They'll take my Jewish card if I don't say that.)\n\nI also find myself craving thick tomato sauces and spicy salsas when my body's fighting off cooties."], ["spicy tomato soup", 453897431, "@BootstrapCook @HackneyAbbott I have only ever followed one recipe in my 56 years. It was for your spicy tomato soup.   The wait was worth it. Beautiful !"], ["spicy tomato soup", 2582870922, "RT @FabFood4All: Have you tried my delicious Vegan Tomato Soup yet? Spicy, creamy and made from just 8 pantry ingredients😋 https://t.co/MFR…"], ["spicy tomato soup", 963007243821223936, "RT @FabFood4All: Have you tried my delicious Vegan Tomato Soup yet? Spicy, creamy and made from just 8 pantry ingredients😋 https://t.co/MFR…"], ["spicy tomato soup", 611652041, "Have you tried my delicious Vegan Tomato Soup yet? Spicy, creamy and made from just 8 pantry ingredients😋 https://t.co/MFRSPO2RCk #vegan #glutenfree #soup https://t.co/S91N5NOQQi"], ["spicy tomato soup", 832144836970967040, "Thur in DTLA for lunch and dinner. 11-2 pm at 333 S Hope St, Los Angeles, CA 90071 and then 5-9 pm at 888 S Hope St, Los Angeles, CA 90017. We got spicy tomato soup to combat this cold! Thanks @bookmylot and @LotMom #thefixonwheels #thefixburger #dtla #bookmylot #bestfoodtrucks https://t.co/J5tDpjA8XD"], ["spicy tomato soup", 832144836970967040, "Thur in DTLA for lunch and dinner. 11-2 pm at 333 S Hope St, Los Angeles, CA 90071 and then 5-9 pm at 888 S Hope St, Los Angeles, CA 90017. We got spicy tomato soup to combat this cold! Thanks bftguide #thefixonwheels… https://t.co/HTQPSRVkXY"], ["spicy tomato soup", 2915735867, "Thursday's menu:\n\nTomato and lentil soup\nSausage hot pot\nCorned beef hash\nSpicy vegan stew\n\nSpecial:\nBeef keema curry with rice @ Chorley Market https://t.co/Z3J4s1oMlC"], ["spicy tomato soup", 1021987837112201217, "@Momof2in1year @pleasure74 @WifeySpice90 @ScarletMagdalen @jankybrain @ValH213 @june_heinz @MisleaderC @Limmered @strom_annette @JacquieLeyns @alxellt0308 @CunningSq16 @JoKeRDJResists @phalarope @KCobain69 @Shaken0Stirred @Mdrc76Maia @ChrisToTheW @KlitzingChris @Tomi_R_B A) Are you willing to share your pea soup recipe? I have a ham hock and lots of ham in the freezer!\n\nand\n\nB) There's something so comforting about grilled cheese and tomato soup. My fave is grilled cheese on sourdough, dipped into spicy marinara."], ["spicy tomato soup", 611652041, "Have you tried my delicious Vegan Tomato Soup yet? Spicy, creamy and made from just 8 pantry ingredients😋 https://t.co/MFRSPO2RCk #vegan #glutenfree #soup https://t.co/GDIBUxynUK"], ["spicy tomato soup", 816740191864049669, "No matter how many times I cook and eat this Tomato-Habanero Soup, I never get tired of it! It’s truly amazing. A few ingredients, simple to cook, goes with everything, a little spicy, a little creamy-- she's a keeper!\n\nHere’s how to make it:\n￼https://t.co/M4x0fyDPWd https://t.co/EY52uAXcgL"], ["spicy tomato soup", 2988981845, "RT @FabFood4All: Have you tried my delicious Vegan Tomato Soup yet? Spicy, creamy and made from just 8 pantry ingredients😋 https://t.co/MFR…"]]