[["spinach sandwich", 2240041010, "for everyone asking whats in the fucking sandwich, its just roast beef, bacon, cheese, eggs, sauteed spinach and onions, and a cajun garlic mayo-based sauce i made."], ["spinach sandwich", 31014599, "Breakfast sandwich with egg, pepper jack cheese, turkey sausage, lettuce, spinach, tomato, and salsa. What did you have? https://t.co/u8zIcTigEj"], ["spinach sandwich", 1118728312304484352, "Guten Morgen! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of croissants.  Take fried eggs as the protein, tomato and spinach as veggies.  Finally, add some mayo and provolone cheese.  Have it with a cup of black coffee.  Enjoy your morning! https://t.co/zgcxzHXG9u"], ["spinach sandwich", 1120918096187928576, "Bonjour! Let's make a sandwich to start a beautiful day!  Open the fridge, and grab two pieces of bagels.  Take tuna as the protein, avocado and spinach as veggies.  Finally, add some mayo and cheddar cheese.  Have it with a cup of sparkling water.  Enjoy your morning! https://t.co/QWxV4lgZ9y"], ["spinach sandwich", 1118728312304484352, "Bonjour! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of bagels.  Take ham as the protein, tomato and spinach as veggies.  Finally, add some mayo and provolone cheese.  Have it with a cup of black coffee.  Enjoy your morning! https://t.co/RGyqh5aPBi"], ["spinach sandwich", 1120918096187928576, "Good Morning! Let's make a sandwich to start a wonderful day!  Open the fridge, and grab two pieces of croissants.  Take turkey as the protein, onion and spinach as veggies.  Finally, add some mayo and cheddar cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/T2GOkP4nWp"], ["spinach sandwich", 1120918096187928576, "Guten Morgen! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of toasts.  Take turkey as the protein, avocado and spinach as veggies.  Finally, add some mustard and cheddar cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/V8gEna9TXI"], ["spinach sandwich", 1118728312304484352, "早上好! Let's make a sandwich to start a beautiful day!  Open the fridge, and grab two pieces of bagels.  Take turkey as the protein, onion and spinach as veggies.  Finally, add some mustard and provolone cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/ibx1Q09OfO"], ["spinach sandwich", 35097527, "RT @ImStillTDN: Food list for when I visit Mobile next weekend:\n\n-Crawfish from the most ghetto seafood place that I can find\n\n-Honey lemon…"], ["spinach sandwich", 1120918096187928576, "Guten Morgen! Let's make a sandwich to start a wonderful day!  Open the fridge, and grab two pieces of toasts.  Take tuna as the protein, avocado and spinach as veggies.  Finally, add some mayo and cheddar cheese.  Have it with a cup of black coffee.  Enjoy your morning! https://t.co/NMAd6Xi1rw"], ["spinach sandwich", 1118728312304484352, "Bonjour! Let's make a sandwich to start a wonderful day!  Open the fridge, and grab two pieces of bagels.  Take ham as the protein, tomato and spinach as veggies.  Finally, add some cream and cheddar cheese.  Have it with a cup of black coffee.  Enjoy your morning! https://t.co/hFApVjfSTZ"], ["spinach sandwich", 1120918096187928576, "Bonjour! Let's make a sandwich to start a wonderful day!  Open the fridge, and grab two pieces of bagels.  Take scramble eggs as the protein, onion and spinach as veggies.  Finally, add some mustard and provolone cheese.  Have it with a cup of black coffee.  Enjoy your morning! https://t.co/kB8LjI8glW"], ["spinach sandwich", 29402836, "RT @verbisan: Going to work this morning with a Double Decker, some peach and white chocolate traybake, a cheese, horseradish, spinach, tom…"], ["spinach sandwich", 2606140412, "Going to work this morning with a Double Decker, some peach and white chocolate traybake, a cheese, horseradish, spinach, tomato and mayonnaise sandwich and a mocha strong enough to fell a horse. Prepared for anything. #teaching #80paperstomark #pig"], ["spinach sandwich", 1120918096187928576, "Bonjour! Let's make a sandwich to start a wonderful day!  Open the fridge, and grab two pieces of croissants.  Take turkey as the protein, avocado and spinach as veggies.  Finally, add some mustard and cheddar cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/XcKRUjwyq9"], ["spinach sandwich", 1120918096187928576, "Guten Morgen! Let's make a sandwich to start a beautiful day!  Open the fridge, and grab two pieces of toasts.  Take fried eggs as the protein, tomato and spinach as veggies.  Finally, add some mayo and provolone cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/0Cg2OVT7A9"], ["spinach sandwich", 1120918096187928576, "Bonjour! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of bagels.  Take turkey as the protein, tomato and spinach as veggies.  Finally, add some cream and provolone cheese.  Have it with a cup of black coffee.  Enjoy your morning! https://t.co/AQYB3AGLSR"], ["spinach sandwich", 1120918096187928576, "Guten Morgen! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of croissants.  Take turkey as the protein, tomato and spinach as veggies.  Finally, add some mayo and cheddar cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/BLyYgGUDEz"], ["spinach sandwich", 1118728312304484352, "Guten Morgen! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of bagels.  Take scramble eggs as the protein, avocado and spinach as veggies.  Finally, add some cream and cheddar cheese.  Have it with a cup of sparkling water.  Enjoy your morning! https://t.co/AYQIDozP9D"], ["spinach sandwich", 1004762734804664321, "@realjuliasong Depends on the sandwich. Subway for the meatball. Also the spicy Italian toasted with pepper jack, spinach, bell peppers, olives, olive oil and oregano. (I’m hungry right now 🤷🏻‍♂️)\nOutside of those 2, I vote JM."], ["spinach sandwich", 1120918096187928576, "Bonjour! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of bagels.  Take tuna as the protein, onion and spinach as veggies.  Finally, add some mayo and cheddar cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/nW55OAdydM"], ["spinach sandwich", 1118728312304484352, "Good Morning! Let's make a sandwich to start a beautiful day!  Open the fridge, and grab two pieces of toasts.  Take turkey as the protein, onion and spinach as veggies.  Finally, add some cream and provolone cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/te4BKEf5tv"], ["spinach sandwich", 1118728312304484352, "早上好! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of toasts.  Take turkey as the protein, onion and spinach as veggies.  Finally, add some mustard and provolone cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/7WBMG09RvI"], ["spinach sandwich", 1153859982561042433, "They have good food here. Egg spinach sandwich https://t.co/Fd6S22RhHy"], ["spinach sandwich", 1118728312304484352, "Guten Morgen! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of bagels.  Take turkey as the protein, onion and spinach as veggies.  Finally, add some cream and cheddar cheese.  Have it with a cup of sparkling water.  Enjoy your morning! https://t.co/JRZT4yHHT0"], ["spinach sandwich", 1455768708, "RT @ImStillTDN: Food list for when I visit Mobile next weekend:\n\n-Crawfish from the most ghetto seafood place that I can find\n\n-Honey lemon…"], ["spinach sandwich", 1118728312304484352, "Good Morning! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of bagels.  Take fried eggs as the protein, onion and spinach as veggies.  Finally, add some cream and cheddar cheese.  Have it with a cup of sparkling water.  Enjoy your morning! https://t.co/o91eWOmEhi"], ["spinach sandwich", 1120918096187928576, "Good Morning! Let's make a sandwich to start a beautiful day!  Open the fridge, and grab two pieces of toasts.  Take tuna as the protein, tomato and spinach as veggies.  Finally, add some mustard and cheddar cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/B6LJ0ogbw7"], ["spinach sandwich", 1118728312304484352, "Bonjour! Let's make a sandwich to start a beautiful day!  Open the fridge, and grab two pieces of bagels.  Take chicken breasts as the protein, onion and spinach as veggies.  Finally, add some mayo and cheddar cheese.  Have it with a cup of black coffee.  Enjoy your morning! https://t.co/sxhqKy5GMk"], ["spinach sandwich", 24366303, "Food list for when I visit Mobile next weekend:\n\n-Crawfish from the most ghetto seafood place that I can find\n\n-Honey lemon pepper wing plate from Half Time\n\n-Redneck gyro from Mediterranean Sandwich Co\n\n-Crawfish spinach dip from Hero’s\n\n-Conecuh Sausage Colache from Lickin Good"], ["spinach sandwich", 1118728312304484352, "Good Morning! Let's make a sandwich to start a wonderful day!  Open the fridge, and grab two pieces of bagels.  Take ham as the protein, tomato and spinach as veggies.  Finally, add some cream and cheddar cheese.  Have it with a cup of sparkling water.  Enjoy your morning! https://t.co/HpueoyMz92"], ["spinach sandwich", 1120918096187928576, "早上好! Let's make a sandwich to start a wonderful day!  Open the fridge, and grab two pieces of bagels.  Take turkey as the protein, tomato and spinach as veggies.  Finally, add some mustard and cheddar cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/IgUsogj8Nw"], ["spinach sandwich", 1120918096187928576, "早上好! Let's make a sandwich to start a beautiful day!  Open the fridge, and grab two pieces of toasts.  Take ham as the protein, avocado and spinach as veggies.  Finally, add some mustard and cheddar cheese.  Have it with a cup of sparkling water.  Enjoy your morning! https://t.co/JYNqTMwO2c"], ["spinach sandwich", 1490611784, "RT @Dentistry_bio: How minor fixes can help with resident burnout: How did you like it there I ask sitting down next to a new fellow betwee…"], ["spinach sandwich", 1118728312304484352, "Good Morning! Let's make a sandwich to start a beautiful day!  Open the fridge, and grab two pieces of bagels.  Take ham as the protein, tomato and spinach as veggies.  Finally, add some mayo and cheddar cheese.  Have it with a cup of sparkling water.  Enjoy your morning! https://t.co/AptEe6LJ4b"], ["spinach sandwich", 1120918096187928576, "Bonjour! Let's make a sandwich to start a beautiful day!  Open the fridge, and grab two pieces of bagels.  Take ham as the protein, tomato and spinach as veggies.  Finally, add some mustard and cheddar cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/IxVThFsR19"], ["spinach sandwich", 257137709, "What should i cook for tomorrow's lunch?\n\nEasy: spinach mushroom couscous.\n\nEasier: egg salad sandwich and fruit.\n\nFood for days: lentil veggie soup."], ["spinach sandwich", 250102470, "How minor fixes can help with resident burnout: How did you like it there I ask sitting down next to a new fellow between bites of a plump sandwich hoping there is no spinach in myÂteeth. I expect to hear the standardÂresident talking points long hours… https://t.co/3uoujjigW8"], ["spinach sandwich", 923611712, "@bostonmarket I'm dying. I drove to Atlanta to get a Chicken Carver sandwich with extra dijon and they replaced it with herb mayo!! What happened!!! I need to know how to fix this. Luckily you still have my creamed spinach. I need this recipe before I cry"], ["spinach sandwich", 1118728312304484352, "Guten Morgen! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of bagels.  Take chicken breasts as the protein, tomato and spinach as veggies.  Finally, add some cream and cheddar cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/cZBRYv995C"], ["spinach sandwich", 1120918096187928576, "Bonjour! Let's make a sandwich to start a beautiful day!  Open the fridge, and grab two pieces of bagels.  Take scramble eggs as the protein, onion and spinach as veggies.  Finally, add some mustard and provolone cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/In7uz1FpE0"], ["spinach sandwich", 1118728312304484352, "早上好! Let's make a sandwich to start a wonderful day!  Open the fridge, and grab two pieces of croissants.  Take turkey as the protein, tomato and spinach as veggies.  Finally, add some mayo and provolone cheese.  Have it with a cup of black coffee.  Enjoy your morning! https://t.co/qKkVVp7uzq"], ["spinach sandwich", 1120918096187928576, "Bonjour! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of bagels.  Take scramble eggs as the protein, onion and spinach as veggies.  Finally, add some mayo and cheddar cheese.  Have it with a cup of black coffee.  Enjoy your morning! https://t.co/7RCgoZm1JU"], ["spinach sandwich", 64850490, "@AdamAAbdalla did u just say Popeyes spicy chicken sandwich wasn’t better than a Wendy’s spinach chicken??? I get the chik fil a argument but come on"], ["spinach sandwich", 1120918096187928576, "Good Morning! Let's make a sandwich to start a wonderful day!  Open the fridge, and grab two pieces of bagels.  Take fried eggs as the protein, onion and spinach as veggies.  Finally, add some cream and cheddar cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/p5WbLf2Pb8"], ["spinach sandwich", 1118728312304484352, "Bonjour! Let's make a sandwich to start a beautiful day!  Open the fridge, and grab two pieces of bagels.  Take turkey as the protein, avocado and spinach as veggies.  Finally, add some mayo and cheddar cheese.  Have it with a cup of sparkling water.  Enjoy your morning! https://t.co/tKgg26XXta"], ["spinach sandwich", 1120918096187928576, "Guten Morgen! Let's make a sandwich to start a beautiful day!  Open the fridge, and grab two pieces of croissants.  Take turkey as the protein, tomato and spinach as veggies.  Finally, add some mayo and cheddar cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/bLHAf7PR8M"], ["spinach sandwich", 59175129, "@Foone Spinach sandwich gives you power to levitate coffee cups (the balance is a bit tricky, though)."], ["spinach sandwich", 1040336610313818115, "anyway i’m curled up in bed just ate mayo and spinach sandwich and in my new unwashed goodwill hoodie. 2020 is squishing me"], ["spinach sandwich", 1118728312304484352, "Bonjour! Let's make a sandwich to start a beautiful day!  Open the fridge, and grab two pieces of bagels.  Take tuna as the protein, onion and spinach as veggies.  Finally, add some mustard and provolone cheese.  Have it with a cup of black coffee.  Enjoy your morning! https://t.co/4xrSRHDEsk"], ["spinach sandwich", 1118728312304484352, "早上好! Let's make a sandwich to start a wonderful day!  Open the fridge, and grab two pieces of croissants.  Take ham as the protein, onion and spinach as veggies.  Finally, add some mayo and cheddar cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/xFVix4eYrm"], ["spinach sandwich", 1118728312304484352, "Good Morning! Let's make a sandwich to start a wonderful day!  Open the fridge, and grab two pieces of croissants.  Take tuna as the protein, tomato and spinach as veggies.  Finally, add some cream and provolone cheese.  Have it with a cup of black coffee.  Enjoy your morning! https://t.co/qWjPGDTTAZ"], ["spinach sandwich", 1120918096187928576, "Good Morning! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of bagels.  Take ham as the protein, avocado and spinach as veggies.  Finally, add some mustard and cheddar cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/4oXYGR04dS"], ["spinach sandwich", 1120918096187928576, "Good Morning! Let's make a sandwich to start a beautiful day!  Open the fridge, and grab two pieces of bagels.  Take scramble eggs as the protein, onion and spinach as veggies.  Finally, add some mayo and cheddar cheese.  Have it with a cup of black coffee.  Enjoy your morning! https://t.co/OwRVF7vvAn"], ["spinach sandwich", 1118728312304484352, "Bonjour! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of bagels.  Take turkey as the protein, avocado and spinach as veggies.  Finally, add some cream and cheddar cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/mv5FaCaYnm"], ["spinach sandwich", 1118728312304484352, "Good Morning! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of toasts.  Take tuna as the protein, tomato and spinach as veggies.  Finally, add some mustard and cheddar cheese.  Have it with a cup of black coffee.  Enjoy your morning! https://t.co/etu2kyHOUI"], ["spinach sandwich", 1120918096187928576, "早上好! Let's make a sandwich to start a wonderful day!  Open the fridge, and grab two pieces of bagels.  Take scramble eggs as the protein, onion and spinach as veggies.  Finally, add some cream and cheddar cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/08vAECOKvM"], ["spinach sandwich", 1120918096187928576, "Guten Morgen! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of bagels.  Take chicken breasts as the protein, onion and spinach as veggies.  Finally, add some cream and provolone cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/NjUXVQDncA"], ["spinach sandwich", 998317339, "i know i shouldnt have high standards for a dining hall but bro...when i tell you it took this man 15 minutes to make a sandwich and he didn’t know the difference between ham and turkey or spinach and lettuce...wh-"], ["spinach sandwich", 1120918096187928576, "Bonjour! Let's make a sandwich to start a beautiful day!  Open the fridge, and grab two pieces of bagels.  Take scramble eggs as the protein, avocado and spinach as veggies.  Finally, add some cream and cheddar cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/ys3zBdUuQ4"], ["spinach sandwich", 909868234341568513, "Still getting used to whole wheat bread and not using mayo, but my attempt at a healthy sandwich turned out pretty dang good. Turkey-provolone-tomato-spinach with avocado spread; a side salad &amp; applesauce for Jayden; pistachios &amp; a smoothie for me. How’d I do, health twitter? https://t.co/Rh4bGeFQdx"], ["spinach sandwich", 768349032, "@mycathatesu I had the best spinach and cheese vegan sandwich"], ["spinach sandwich", 1120918096187928576, "Good Morning! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of croissants.  Take turkey as the protein, onion and spinach as veggies.  Finally, add some mustard and cheddar cheese.  Have it with a cup of black coffee.  Enjoy your morning! https://t.co/NM1RS2FbIw"], ["spinach sandwich", 1120918096187928576, "Guten Morgen! Let's make a sandwich to start a wonderful day!  Open the fridge, and grab two pieces of croissants.  Take ham as the protein, tomato and spinach as veggies.  Finally, add some cream and provolone cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/YyOlvd7PVi"], ["spinach sandwich", 1551617364, "Tuesday Lunch Features \n1. Toasted Roast Beef Sandwich served with Fries \n2. Chicken Spinach Wrap served with Soup \nSoup: Hamburger Noodle https://t.co/EfGlGbVXQL"], ["spinach sandwich", 1118728312304484352, "Guten Morgen! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of toasts.  Take scramble eggs as the protein, onion and spinach as veggies.  Finally, add some mayo and cheddar cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/TtMs5cSjte"], ["spinach sandwich", 764148855533436928, "RT @CruisinSoozan: I put spinach on my bologna sandwich because I'm anemic and also a little bit ghetto."], ["spinach sandwich", 33103766, "RT @CruisinSoozan: I put spinach on my bologna sandwich because I'm anemic and also a little bit ghetto."], ["spinach sandwich", 1120918096187928576, "Bonjour! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of bagels.  Take fried eggs as the protein, tomato and spinach as veggies.  Finally, add some mustard and provolone cheese.  Have it with a cup of sparkling water.  Enjoy your morning! https://t.co/l4RHWnrbME"], ["spinach sandwich", 1118728312304484352, "Bonjour! Let's make a sandwich to start a beautiful day!  Open the fridge, and grab two pieces of bagels.  Take tuna as the protein, avocado and spinach as veggies.  Finally, add some mustard and provolone cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/NYo1Uvd4yt"], ["spinach sandwich", 1118728312304484352, "Guten Morgen! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of croissants.  Take tuna as the protein, tomato and spinach as veggies.  Finally, add some mayo and cheddar cheese.  Have it with a cup of black coffee.  Enjoy your morning! https://t.co/NHjqJ8sujb"], ["spinach sandwich", 1120918096187928576, "Bonjour! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of bagels.  Take tuna as the protein, avocado and spinach as veggies.  Finally, add some mustard and provolone cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/kOd5sQADKy"], ["spinach sandwich", 1118728312304484352, "Guten Morgen! Let's make a sandwich to start a beautiful day!  Open the fridge, and grab two pieces of toasts.  Take turkey as the protein, tomato and spinach as veggies.  Finally, add some mustard and cheddar cheese.  Have it with a cup of black coffee.  Enjoy your morning! https://t.co/roGiGLDSFb"], ["spinach sandwich", 1118728312304484352, "Guten Morgen! Let's make a sandwich to start a beautiful day!  Open the fridge, and grab two pieces of bagels.  Take scramble eggs as the protein, tomato and spinach as veggies.  Finally, add some cream and cheddar cheese.  Have it with a cup of black coffee.  Enjoy your morning! https://t.co/dqcgTKHujX"], ["spinach sandwich", 1120918096187928576, "早上好! Let's make a sandwich to start a wonderful day!  Open the fridge, and grab two pieces of bagels.  Take fried eggs as the protein, tomato and spinach as veggies.  Finally, add some cream and cheddar cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/JqWL7FqWl3"], ["spinach sandwich", 1120918096187928576, "Guten Morgen! Let's make a sandwich to start a beautiful day!  Open the fridge, and grab two pieces of croissants.  Take tuna as the protein, onion and spinach as veggies.  Finally, add some mayo and provolone cheese.  Have it with a cup of breakfast tea.  Enjoy your morning! https://t.co/ot13O7Mzac"], ["spinach sandwich", 1118728312304484352, "早上好! Let's make a sandwich to start a happy day!  Open the fridge, and grab two pieces of bagels.  Take chicken breasts as the protein, avocado and spinach as veggies.  Finally, add some mayo and cheddar cheese.  Have it with a cup of sparkling water.  Enjoy your morning! https://t.co/mtoz5fyyyq"]]