[["steamed rice", 59691802, "I probably sound so dramatic but I just had the best steamed white rice at this Japanese restaurant"], ["steamed rice", 1155931142039597056, "My guy came over and brought me dinner: Chinese Wonton Soup, Steamed Rice and Ginger Ale. Yay. 💖🥡🥢🥣🧃🍚🍲"], ["steamed rice", 30724469, "RT @tobydaye: @Delafina777 I was getting chronic headaches.\n\nI was 5'8, 155 pounds, going to the gym 3 times a week, my diet was grilled ch…"], ["steamed rice", 16162082, "This is called Hitsumabushi. Its eel basted in BBQ on top of steamed rice and noodles. There is also dashi broth there. There's also Dashi broth there, but I learned that doesn't help the meal. Very good without it though! https://t.co/Bk5xBnLwZ1"], ["steamed rice", 259603678, "@katastrofu I use it for yogurt, rice (and other grains), congee, champorado, soup, making stock, steaming. Lots of settings controlled via an app. (I'm writing all this while eating a steamed/boiled egg and champorado, both cooked with the rice cooker)"], ["steamed rice", 721987063113867264, "Possibly the best thing about the University of Melbourne is the place that does fantastic $9 fried rice, steamed garlic veggies, and honey chicken, with delicious crispy chilli oil on the side"], ["steamed rice", 706312105, "Why is steamed rice so good"], ["steamed rice", 1217185997760483333, "Made today in The Average Kitchen: Chinese pork Char Siu with steamed broccoli and basmati rice. #asianfood #theaveragekitchen #youtube #youtubechannel #food #foodphotography #foodporn https://t.co/z9s9cDBa68"], ["steamed rice", 525564333, "RT @amyhsin: Another day of carb loading against #xenophobia. Sad to see this restaurant near empty when usually a line out the door. Eatin…"], ["steamed rice", 41351835, "an asian thing i just knew: mixing soya sauce and sesame oil in steamed rice. its so good! match well for salmon or any fish rice bowl 🍚 🤤 turned out japanese and korean have been doing this......"], ["steamed rice", 1114690508859645952, "Does thrice baked rabbit terrine chilli con carne or hand-rolled blue cod served on steamed rice sound tantalizing? head on down to Al Brothers."], ["steamed rice", 119822545, "RT @amyhsin: Another day of carb loading against #xenophobia. Sad to see this restaurant near empty when usually a line out the door. Eatin…"], ["steamed rice", 834656931209998337, "Homemade Tofu with White rice and steamed veggies. Also nabbed some Yum Yum Sauce. Yes please. 💕"], ["steamed rice", 10037372, "Leftover night! Leftover steamed rice, Brussels sprouts and big ole portobellos stuffed with crab and topped with panko. Yum! @ IndigoDragon Studios https://t.co/5nH98ZW9Yx"], ["steamed rice", 1148953919600640000, "I honestly feel this. Like I thought it was just in my head but I’ll be tryna explain to my dad why I don’t wanna eat all that shit &amp; I just be craving vegetables with steamed rice. Anything non greasy but everyone thinks I’m just being boujie like nah, ion be feeling right after https://t.co/YyBzQlfvkm"], ["steamed rice", 1189639394489225222, "Orange chicken, steamed rice, and Dos Equis for dinner. While watching the new season of Better Call Saul? I think the fuck YES"], ["steamed rice", 389687418, "The new meat head trainer at the gym ONLY eats steamed broccoli and rice... how do I know this... because he said it 40 times while talking to someone. https://t.co/yhPCbeMeeI"], ["steamed rice", 170903924, "RT @amyhsin: Another day of carb loading against #xenophobia. Sad to see this restaurant near empty when usually a line out the door. Eatin…"], ["steamed rice", 3296380915, "A fave quick, easy, mess free, healthy recipe: \n\n+ Microwaveable frozen steamed rice\n+ Microwaveable steamed veggies \n+ A handful of nuts\n+ Curry Sauce \n\nIt cost under $10, took under 10mins to prepare, &amp; used only 1 dish. Substitute any other veggies, grains, proteins, &amp; sauces! https://t.co/GKcFfCTmJ3"], ["steamed rice", 52838585, "Another day of carb loading against #xenophobia. Sad to see this restaurant near empty when usually a line out the door. Eating my congee &amp; steamed rice noodles while I review a book on Chinese restaurant in Chinese restaurant. #coronavirus #supportchinatown https://t.co/BtqGwDFZEu"], ["steamed rice", 920173603, "RT @TheDolceDiet: As simple as it is delicious!\n.\n6 ounces baked and cubed chicken, 1/2 cup jasmine white rice, 1 cup steamed and chopped b…"], ["steamed rice", 21199284, "As simple as it is delicious!\n.\n6 ounces baked and cubed chicken, 1/2 cup jasmine white rice, 1 cup steamed and chopped broccoli and carrots, and 1/4 cup salted cashews, with a sprinkle of Braggs Liquid Aminos.… https://t.co/HDAY50EmQ8"], ["steamed rice", 48150094, "Added LEFTOVER red sauce (risotto traditionally uses white wine but I had red sauce so... red wine) and stirred to let it come together. Diced up LEFTOVER chicken, heated in the sauce combination, reheated/steamed my LEFTOVER rice, added to the pan, mixed to combine..."], ["steamed rice", 322893135, "Watercress soup. Simple and the kids love it.\nDinner tonight all instant pot:\nLao steamed egg (vegetarian)\nJasmine rice\nBitter melon soup\nWatercress soup (vegetarian)\nLinks to recipes\nEgg:… https://t.co/18kZIRUj01"], ["steamed rice", 322893135, "Bitter melon soup, have you had this? Growing up it was too bitter for me but my mom said it was medicinal. Now I crave it! \n\nDinner tonight all instant pot:\nLao steamed egg (vegetarian)\nJasmine rice\nBitter melon… https://t.co/euXaEM3N7d"], ["steamed rice", 803360714979090432, "RT @leggingsnlattes: This New Orleans Gumbo recipe is made with spicy smoked andouille sausage, crab, shrimp, oysters, okra and vegetables,…"], ["steamed rice", 43713525, "Tuesday, February 11th Special\n\nToday's Obanzai:\n\nSaba - Tamari and Shio Koji (Malted Rice) Marinated and Broiled Mackerel\n\nSpicy Buta Kimchi Soup - Pork, Kimchi, Hakusai Cabbage, Shimeji, Carrot, Ginger, Garlic, Spiced Miso, and Sesame Oil\n\nSteamed Vege… https://t.co/x2COjWgpve"], ["steamed rice", 1114690508859645952, "Want to try woodfire oven baked skirt steak served on steamed rice? head on down to Ronnie's"], ["steamed rice", 93763540, "Dinner Special: Seared Salmon w/ Toasted Garlic -Arugula Cream over Ginger-Basil Brown Rice, Steamed Vegetables, Salad &amp; Bread"], ["steamed rice", 1111642907424030720, "What’s on your dinner plate?\nAckee and Saltfish with Rice and Steamed Vegetables \n#ackee #saltfish #codfish #lyndhurstjerkandgyrospot #caribbeancuisine #mediterraneancuisine #307ridgerdlyndhurstnj #2019355375 #ontheridge #greatfood #jerkandgyro.com #jerkandgyro @jerkandgyro https://t.co/4H7UajMIkA"], ["steamed rice", 45808825, "Dinner Carmichael: Butternut Ravioli w/Walnuts/Almonds/Cranberries (V), Pesto Chicken w/Balsamic Reduction, Eight Grain Rice Pilaf, VG Chik’n Strip, VG Thai Burrito, Choice Sirloin Steak, Create-your-own Stir Fry, Rice Pilaf, Fresh Steamed Green Beans w/Butter"], ["steamed rice", 637294939, "RT @RazorbacksFuel: Training Table menu for this evening - \n\nBBQ Brisket\nPesto Tilapia\nGrilled Herb Chicken\nBlack Bean Patty\nBrown Rice\nSte…"], ["steamed rice", 996950528327270401, "@cherrypugpie STEAMED rice cake HAMJIN"], ["steamed rice", 1227224257974984710, "The Platos Tipico (Classic Entree) I tried was Arroz con Pollo y Papa a la Huancaiana and Bisteck Encebollado. It was chicken, rice, peas, carrots, cooked with cilantro &amp; served with steamed potato huanaina sauce made of cheese and Peruvian spices. Very good! #H330dineout2020 https://t.co/JDV8QeFP2C"], ["steamed rice", 276455612, "Dinner!!! Salmon , wholegrain rice , steamed tender stem broccoli , baby corn on the cob and carrots .\n#nutrition #instafood #protein #diet #eathealthy #eatclean @ Brighton and Hove https://t.co/q4cR7PNjx0"], ["steamed rice", 438529528, "... and when I come here, I have to take some food home for the boys. \n\nTheir baos and other items are some of the best in Asiatown.\n\nI'm taking home Pearl Meatballs - soft pork meatballs covered in rice then steamed. They're amazingly tender and juicy. https://t.co/h4kRnHcWJK"], ["steamed rice", 3575097073, "Training Table menu for this evening - \n\nBBQ Brisket\nPesto Tilapia\nGrilled Herb Chicken\nBlack Bean Patty\nBrown Rice\nSteamed Green Beans\nGrilled Vegetables\nGrilled Cheese Bar - made to order\n\n#fuelingthehogs"], ["steamed rice", 1189968540763410432, "In this world where stir fried beef with assorted vegetables on steamed rice is your enemy, it is my greatest ally."], ["steamed rice", 997518215805796352, "chicken n rice with steamed veggies might be my new go to"], ["steamed rice", 449116899, "Im so fucking done with steamed rice😡"], ["steamed rice", 213326279, "What are you eating tonight? I made this after a long day at work. Grilled chicken breast on a bed of basil wrapped with bacon and topped with mushroom sauce served with steamed rice and roasted veggies. https://t.co/lqfX0L4dce"], ["steamed rice", 2392081726, "RT @Shied__: Baked Lobster over Lemon Rice &amp; Steamed Broccoli https://t.co/IR0aflbn5Z"], ["steamed rice", 436354271, "RT @Shied__: Baked Lobster over Lemon Rice &amp; Steamed Broccoli https://t.co/IR0aflbn5Z"], ["steamed rice", 893510978, "RT @Shied__: Baked Lobster over Lemon Rice &amp; Steamed Broccoli https://t.co/IR0aflbn5Z"], ["steamed rice", 41865979, "Mochi Crisps w/ Grape Butter, breakfast, lunch, snack, or meal in about 10 minutes. Bite size crunchy crisps, chewy inside. Grape Butter and a good nut or seed butter on top. The Mochi is steamed, cooked, &amp; pounded organic sweet brown rice. Gluten free. https://t.co/mZCootmVLy https://t.co/ouRrtD2naD"], ["steamed rice", 978912484794028032, "Insta: /jtblue44\n\nA simply delicious dish served up by James!\n\nCast Iron Seared Sea Scallops with green Thai coconut curried roasted brussels sprouts, shiitake mushrooms, bell peppers and steamed rice.\n\nWhat's your favourite dish to use our Green #Curry Paste in?\n\n#ThaiFood https://t.co/pJ4J6WHf0L"], ["steamed rice", 1199039105985843201, "helo. Im back anyway Steamed rice cakes https://t.co/kItyG8QJOZ"], ["steamed rice", 1053728666901995523, "Seitan steak donburi style. Baked with mirin, miso sauce, and dashi broth. Make miso soup with spinach. Serve with steamed short-grain rice."], ["steamed rice", 288982540, "@Delafina777 I was getting chronic headaches.\n\nI was 5'8, 155 pounds, going to the gym 3 times a week, my diet was grilled chicken, steamed veggies, and rice.\n\nMy doctor still pushed that I try to lose weight, go on a raw food diet, and exercise more."], ["steamed rice", 23395072, "The bibingka cheesecake. It’s a cheesecake interpreted on the theme of a steamed rice cake. What’s on top is salted duck egg. Send coconut. #bibingka #cheesecake #filipinofood #dessert @ The Podium https://t.co/jr4pqnK21O"], ["steamed rice", 108787358, "Tuesday's Menu: Cube Steak, Neckbones w/ Potatoes, Ox Tails, Fried Chicken Wings \n\nhttps://t.co/aNiVD7dpRw\n\nSides: Macaroni and Cheese, Steamed Cabbage, Blackeye Peas w/ okra, Candied Yams, Fried Corn, Turnip Greens, Rice, Butter Beans\n\nDessert: Peach Cobbler"], ["steamed rice", 1179423762908876803, "RT @morleybutchers: This slow cooked Korean Style Beef Brisket is a great with rice or as the perfect filling for traditional steamed Bao B…"], ["steamed rice", 437331683, "TUESDAY LUNCH BUFFET\n11:00 am - 2:00 pm\nAll-You-Can-Eat\n\nChicken Spring Rolls\nEmerald Butterflies\nPanang Beef Curry\nGarlic Chicken\nVegetarian Green Curry\nEmerald Vegetables\nPahd Thai Noodles\nCurry Pineapple Fried Rice\nHouse Salad\nSteamed Jasmine Rice\n$10.95 includes https://t.co/XWu4efpkaj"], ["steamed rice", 1068521108, "Prepare steamed veggies, make rice or pasta, or cook everything in layers at once. Plus, nutrients, vitamins and minerals stay locked into food with true steam cooking. https://t.co/jaIKZTgg11 https://t.co/RfHeVhfqVi"], ["steamed rice", 1955849382, "RT @thesmokevet: steamed rice is a gift from the gods"], ["steamed rice", 843989711890796544, "@steamedbhan Steamed rice + raw egg"], ["steamed rice", 2982047008, "lrt ksoo is delivered to me and placed upon a bed of steamed rice"], ["steamed rice", 42340918, "@Inbarajs @ashraf3178 I bought steamed basmathi rice"], ["steamed rice", 2921977287, "RT @easypeasyfoodie: Quick, easy and very tasty, this Easy One Pot Sausage Casserole is guaranteed to be a real crowdpleaser! Serve with mo…"], ["steamed rice", 3251607712, "Quick, easy and very tasty, this Easy One Pot Sausage Casserole is guaranteed to be a real crowdpleaser! Serve with mounds of buttery mash or steamed white rice for a comfort food classic. \n\nRECIPE =&gt; https://t.co/gQAKVF4c9D \n\n#sausagecasserole #sausages #comfortfoodclassic https://t.co/z1R20GX3Tq"], ["steamed rice", 1114690508859645952, "Ever tried Indian cuisine? Lizard &amp; Cilantro Cafe has some delectable dishes like stir-fried duck parfait served on steamed rice."], ["steamed rice", 901015343233212416, "RT @bubbleandpho: Have you tried our Com Tam? Steamed rice served with cucumber, pickled carrots and Vietnamese dipping sauce\n\n#BubbleandPh…"], ["steamed rice", 729145375785783296, "I just ate Chao Fan with fried dumplings and steamed siomai after my mom told me to go on a serious diet and to stop eating rice 😂"], ["steamed rice", 1053728666901995523, "Dinner idea! Pan-fried 15 minute curry from diced cod fillet + spinach + ground coriander, bacon mince, cumin, tumeric, chili and coconut milk. Serve over steamed jasmine rice."], ["steamed rice", 113599070, "RT @drawingroomcafe: Valentine's Dinner/Buffet with The African Box / Busisiwe Mukendi\n\nMain course ( Buffet)\n\nStarch \n- Steamed Bread/Samp…"], ["steamed rice", 3007647414, "Valentine's Dinner/Buffet with The African Box / Busisiwe Mukendi\n\nMain course ( Buffet)\n\nStarch \n- Steamed Bread/Samp &amp; Beans/Pap/Cassava Pap/Rice \nVegetable\n- Butternut/Creamy spinach/Chakalaka/Pondu (Cassava… https://t.co/TqNXa9QetE"], ["steamed rice", 981925553719664640, "Have you tried our Com Tam? Steamed rice served with cucumber, pickled carrots and Vietnamese dipping sauce\n\n#BubbleandPho #VietnameseFood #Portsmouth #Southsea #Cosham #Portchester #PortsmouthUniversity #Vietnam #GunwharfQuays #Pho #ComTam#Healthy #Fresh #Lunch #Dinner #EatOut https://t.co/aZOudH74u4"], ["steamed rice", 1053728666901995523, "Pork mince and onion stir-fried with ginger, green onions, minced chillis and parmiagiana cheese. Serve with a side of steamed jasmine rice."]]