[["sundal", 3068641671, "$DNO #DNO DNO - Q4 EBITDAX spot on ABGSCe: Q4 EBITDAX of USD 204.9m, ABGSCe at USD 207.1m Limited 2020 guidance in material Only minor est. revisions, political situation remains focus https://t.co/oyjqXVI2bt #equity #stocks https://t.co/Hu51ytCprp"], ["sundal", 3068641671, "$ATEA #Atea ASA Atea - Weak Q4 report across markets: Disappointing report, Norway, and Sweden misses also EBIT of NOK 305m 14% below consensus Dividend stable @ NOK 6.5, but share trades down today https://t.co/jxRLU1TTvP #equity #stocks https://t.co/y1LaXukaLh"], ["sundal", 3068641671, "$PEAB B #Peab AB B Peab - Less is more: Margin excellence for the core operation Starting to realise the SEK 13bn property exposure ~40% of market cap in property values https://t.co/xeqlFG1Ls0 #equity #stocks"], ["sundal", 3068641671, "$ICA #ICA Gruppen AB ICA Group - Weaker Q4 report at first glance: Slightly below expectations Weaker margin in ICA Sweden Consensus estimates expected to come down https://t.co/SEMWgIliKm #equity #stocks"], ["sundal", 3068641671, "$FABG #FABEGE Fabege - Multiples at risk when growth slows: Recurring PTP growth slowed to 12% in Q4 (25% in 2018) EPRA NAVPS growth slowed to 18% (27% in 2018) We expect growth to slow further in 2020e https://t.co/0eQLpBDzUy #equity #stocks"], ["sundal", 3068641671, "$GN #GN Store Nord A/S GN Store Nord - Audio en route to become the big brother: Both divisions finishing strong, in gear for the next year Encouraging 2020 guidance and mid-term outlook We remain BUYers, TP up to DKK 386 (343) https://t.co/RsUEbLVIXk #equity #stocks https://t.co/nSnQdI7F3N"], ["sundal", 1155729586027548672, "RT @frhazreena: Let me make it clear. I’m not saying men are trash but a cheating man and a sundal girl is"], ["sundal", 304221236, "my sister: sundal is actually a good korean name. kim sundal"], ["sundal", 4825197439, "Pergi mampus same Maryam Imran.\nI Mean it, in the life first breathe.\n\nIsrael was not country,\nMak kau Bukan sundal betina sebelum Kahwin Second young Wife ?\n\nA Pig face, Just be forced.\nIm not forget at first breathe !"], ["sundal", 1195289700891676673, "I look extra sundal today"], ["sundal", 1205360787969204225, "babe , if u don't want to be called a \"sundal\" so stop ganggu boyfriend I,thankyou."], ["sundal", 3068641671, "$DANSKE #Danske Bank A/S Danske Bank - All eyes fixed on the Q1 transformation plan: Mixed Q4 was strong on capital and flat on DPS 2020 is a transformation year; detailed plan coming in Q1 We reiterate BUY with a target price of DKK 125 https://t.co/3yFaokfnTE #equity #stocks"], ["sundal", 3068641671, "$INDT #Indutrade AB Indutrade - Time to reevaluate a long-term performer: EBITA up 11%, down ~3% organic adjusted for one-offs We expect flat organic EBITA growth in ‘20e Downgrade to SELL (Hold) TP SEK 305 (330) https://t.co/asfCkDGNRu #equity #stocks https://t.co/iMZdFn7hiu"], ["sundal", 1133530444371075074, "ok, dropping sundal bideo this night cuz malam jumaat kan and btw its not that good pon hehe"], ["sundal", 3068641671, "$NOVO B #Novo Nordisk A/S B Novo Nordisk - Semaglutide en route to conquer the world: Strong performance across most products and regions FY´20 guidance makes sense, investing in the future Still a long-term fundamental BUY https://t.co/DEmA2OmIao #equity #stocks https://t.co/RSDQi1yzSO"], ["sundal", 1657237987, "JS for Jantan Sundal or Johnny Sin ?"], ["sundal", 88088221, "Donnie Sundal has a show on 02/07/2020 at 06:00 PM @ Big Beach Brewing Company in Gulf Shores, AL https://t.co/A8EkFfi5lI #concert https://t.co/4LEJuYNUfF"], ["sundal", 4825197439, "Who not have a Hand of Emma,\nMean Not from Adam Emma.\n\nAs Proton !\nIts not Dirty mind,\nIts real maryam Imran Betina Sundal in ( All outspace )  Hemoriag Rumm OHasH."], ["sundal", 3068641671, "$SHB A #Svenska Handelsbanken Series A, Svenska Handelsbanken - Q4’19: A cost- and DPS-driven relief: Q4 op. profit and capital position better than expected No net estimate revisions for 2020-21, but CET1 ratio up DPS-driven relief, but… https://t.co/6w200ljA0a #equity #stocks https://t.co/Ft8fJbcvd3"], ["sundal", 3068641671, "$HEXA B #Hexagon AB B Hexagon - A lot of improvement already in the price: Solid Q4, but small negative revisions Improving organic growth already in our forecasts Down to HOLD, expensive at 20x 2020e EV/EBIT https://t.co/H46nAjEgXs #equity #stocks https://t.co/V4xJmMU0rU"], ["sundal", 3068641671, "$SRBANK #Sparebank 1 SR Bank Sparebank 1 SR-Bank - Cost growth and higher loan losses ahead: Q4’19 miss due to higher loan losses (LLP) and costs Adj. EPS’20-21e down by 2% and 3% from costs and LLP Still a HOLD; convince us that costs… https://t.co/vhoToq6fTf #equity #stocks https://t.co/HxKV4tnrYh"], ["sundal", 1148451598726832133, "Very important standoff at home to @churchtownmfc on Sundal. A win and top 2 looks very promising!\n\nLassisi is suspended but Bonera has been a very good alternative before.\n\nSorin gets a new chance in our rotating left wingback position. \n\n#supervallen https://t.co/p789NB0hcM"], ["sundal", 3068641671, "$VWS #Vestas Wind Systems A/S Vestas Wind Systems - More than meets the eye: Strong order intake and ASP But disappointing margin guidance at first glance We remain fans - BUY https://t.co/LTPuEmvjVd #equity #stocks https://t.co/tWDcW1POb9"]]