[["texas cheese fries", 448542742, "Cody came home from work and let Roxie eat half of his huge fudge round, went to Texas roadhouse like an hour later and she ate 2 rolls, some of my salad, a bunch of French fries, and half a bowl of mac and cheese. Get home and she drinks an entire cup of milk before bed😳"], ["texas cheese fries", 312458520, "@JuneeJ_ So boom. Get some wings , and texas fries (bacon, cheese, and jalapeños), complimented by an adult beverage, slushy , or milk shake (plz not all 3)Then it’s a movie on Netflix called “where is the money ?”"], ["texas cheese fries", 4326031273, "RT @arianahinojosa6: man, i want some texas cheese fries from chili’s"], ["texas cheese fries", 941943592435830784, "man, i want some texas cheese fries from chili’s"], ["texas cheese fries", 3022596947, "@its_taytayy LMFAOOO, I know i would've been weak asffff and damn they texas cheese fries is sooo good."], ["texas cheese fries", 825583380, "I wanna fuck up chili’s later someone come with! texas cheese Fries!"], ["texas cheese fries", 924874073200611331, "All I really wanted today was chili’s Texas cheese fries 😂 https://t.co/NwmLZGQAEZ"], ["texas cheese fries", 4729521626, "soon as chili’s open i’m going get some texas cheese fries and get my day started🥰"], ["texas cheese fries", 1046516784533135360, "What’s Better Then A Valentines Date @Chilis WHEN HE ORDERS YOU YOUR OWN TEXAS STYLE CHEESE FRIES 🖤 And Ranch"], ["texas cheese fries", 1012982326416904192, "This was my dinner at Texas Roadhouse, \n18oz steak, \nCheese fries with bacon bits, \nGrilled shrimp. \n\n@MsMidnightXXX💋 https://t.co/LXpbEmFujx"], ["texas cheese fries", 554879224, "@TheDrunkJake Im from Georgia and we dont have either, but Whataburger has OPTIONS and is better , as for in-N-out the fries are trash (cardboard) and you basically only have 2 options a hamburger or a cheese burger so it’s basically 1 option tbh. I’ve also had in-N-out from Cali and Texas."], ["texas cheese fries", 761969686506418177, "I had a dream I was eating Texas cheese fries from chili’s with @ilovebeanncheez . It’s a sign"], ["texas cheese fries", 977224445885648897, "@crazy_fur_mama Sushi or Texas cheese fries and margaritas 😂"], ["texas cheese fries", 275256134, "i want some texas cheese fries with extra jalapeños 🥺"], ["texas cheese fries", 162286547, "@_Sasha_Marie Don’t move to southern Texas. LOL. Chili and cheese goes on fries, hot dogs, tortilla chips, corn chips,...."], ["texas cheese fries", 951532700694974465, "@jonkerlin cheese fries from Snuffers (its in texas)"], ["texas cheese fries", 86994406, "It’s 6:24 AM and I really am sitting at a chili’s in the airport and attempted to buy texas cheese fries"], ["texas cheese fries", 2909363347, "all i want is texas cheese fries from chili’s 😭"], ["texas cheese fries", 133029536, "HOT DIGGITY DOG! 🌭 Over the weekend, I checked out umaihotdogscanada and was WOWED by the selection of food there! We tried the cheese stick, sweet chili wings, umai house fries, the Texas Roundhouse (Chicken Hot Dog… https://t.co/5q2toITDIG"], ["texas cheese fries", 851485733374357504, "Store-bought products lunch today. Ore-Ida fast food fries with Kroger stadium cheese and Texas Pete's peppers make a nice imitation version of Steak &amp; Shake cheese fries. For the entrée, corn dog bites, which went well with the stadium cheese and some jalapeños. https://t.co/4RTLY9Mw7A"], ["texas cheese fries", 4847292784, "instead of going to the gym like i said i would i am on my 4th margarita and second plate of texas cheese fries at chili's🙃🥴"], ["texas cheese fries", 1111832047, "@petermonn \nIt’s a Starbucks Reserve \nAlso try the cheese fries at Snuffers \n\nhttps://t.co/8yOrS7iks7"], ["texas cheese fries", 3969299113, "RT @synthia_skirby: Bistro this week will be on Friday! The students are making homemade chicken fried steak with pepper gravy, fries, stea…"], ["texas cheese fries", 860213547858579462, "RT @synthia_skirby: Bistro this week will be on Friday! The students are making homemade chicken fried steak with pepper gravy, fries, stea…"], ["texas cheese fries", 3969299113, "Bistro this week will be on Friday! The students are making homemade chicken fried steak with pepper gravy, fries, steamed broccoli with cheese, Texas toast, peach cobbler a la mode, and tea. $8.50. 11:000-1:00."], ["texas cheese fries", 175762375, "@InfoSecHotSpot Texas Road House - cheese/bacon fries"], ["texas cheese fries", 21531128, "@Sean_Dickerson @LowKeyUHTN I keep my Texas Pete’s in the cabinet because I like the texture better although I know it’s a total health risk. 😭 I can only use cold hot sauce on really hot shit like rice where the coldness disappears right away or fries with bleu cheese."], ["texas cheese fries", 290814202, "@jansenrhogan Get some Texas cheese fries 👏🏽"], ["texas cheese fries", 219835989, "There’s nothing I want more than some texas cheese fries right now"], ["texas cheese fries", 737767087368704000, "Damn I want some Texas cheese fries from chili’s 😂"], ["texas cheese fries", 1470272592, "I want some Texas cheese fries"], ["texas cheese fries", 2412700944, "🍟🍟🍟 West Texas Loaded Fries\nA big bowl of crispy waffle fries loaded with slow-smoked brisket, beer cheese, pico de gallo and cilantro.  Sour cream drizzle.🇨🇱🇨🇱🇨🇱 @ Piedmont Brewery &amp; Kitchen https://t.co/golCPdFnjX"], ["texas cheese fries", 924498029159297024, "@MikeBloomberg You tried to tell me how much soda I could drink at Chili’s while I devoured deep fried chicken crispers, Texas cheese fries, and the rest of my wife’s quesadilla explosion"]]