[["thepla", 1157567596616531968, "RT @LagGayeHai: Boys who make dhokla, handva, thepla&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;"], ["thepla", 795641503305572352, "Boys who make dhokla, handva, thepla&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;"], ["thepla", 369631161, "@PakRoaster99 @dikgaj @sarkar_swati @m_for_moriarty @gupta_skanda @Achaari_Thepla @maidros78 Muslims are hypocrites they use and throw people as per their convenience they would even quote Ambedkar and even Thomas Jefferson. But would only read till the time when it suits their own Ideology"], ["thepla", 1198522236287647744, "Cauliflower: But Dad I wanna be a Thepla. \n\nCauliflower’s Dad: No son, Gobi a Paratha."], ["thepla", 2910067068, "@hiddenshine_ Yup. She also used to worship Shree Krishna."], ["thepla", 1180635106022756353, "RT @oophelia_12: The list of things my mom made to send with my dad who's going to meet her:\n\nUndhio\nPuranpoli \nChapati\nThepla\nChicken \nFis…"], ["thepla", 1300068481, "The list of things my mom made to send with my dad who's going to meet her:\n\nUndhio\nPuranpoli \nChapati\nThepla\nChicken \nFish fry\nBatata wada"], ["thepla", 52029138, "RT @shadihamid: Austria working paper: https://t.co/hNgFewcP92\n\nAustria reaction essay: https://t.co/SAgcWj6Lot"], ["thepla", 52029138, "RT @DPRArohana: The original catwalk https://t.co/F2VpEbUNpz"], ["thepla", 52029138, "RT @historylvrsclub: Leather clad English rocker girl on motorcycle https://t.co/cozgNfLP9i"], ["thepla", 52029138, "@Winkerbell_ If Shiv Sena can ally with Congress, why should I not ally with people who have different ideologies? 😆"], ["thepla", 52029138, "RT @KaushikLab: Our office boy is moving onto a new job. A dynamic go-getter - he relieved the stress of signatures and stamps. Tense to se…"], ["thepla", 52029138, "@semubhatt Ordinary Indians target these people. Not everyone who cares about security issues is from BJP."], ["thepla", 52029138, "@semubhatt @amritabhinder @smitabarooah @shikha_shrivas Ordinary Indians target these people. Not everyone who cares about security issues is from BJP."], ["thepla", 52029138, "RT @spikedonline: Academics at Kent are demanding a feminist professor's upcoming talk be cancelled. Her crime? She is critical of transgen…"], ["thepla", 52029138, "RT @ieexplained: #ExpressExplained | A look at the provisions and journey of the Surrogacy Bill since 2016\n\nhttps://t.co/3OnzRbkbMx"], ["thepla", 149435511, "@RitikRai619 @Gujju_Jon thepla flavour  😂😂😂"], ["thepla", 52029138, "@SwarajyaMag He should be grateful. His place in Jannah and 72 virgins is now secured."], ["thepla", 52029138, "RT @SwarajyaMag: A Telangana Christian man has approached the state human rights commission complaining that his girlfriend’s family made h…"], ["thepla", 113275552, "RT @indusfoodshow: Kick-start your morning with sprouts thepla, a wholesome recipe curated by Lifestyle coach, Luke Coutinho.\nhttps://t.co/…"], ["thepla", 52029138, "RT @ArvindKejriwal: Thank u so much sir. I look forward to working closely wid Centre to make our capital city into a truly world class cit…"], ["thepla", 52029138, "RT @ArvindKejriwal: Thank you @GautamGambhir ji https://t.co/tTKPdpxESB"], ["thepla", 52029138, "RT @narendramodi: Congratulations to AAP and Shri @ArvindKejriwal Ji for the victory in the Delhi Assembly Elections. Wishing them the very…"], ["thepla", 52029138, "@narendramodi @ArvindKejriwal This is the beauty of Indian democracy. Once results are declared everyone accepts it and congratulates the others."], ["thepla", 52029138, "RT @SpokespersonECI: @vishwamTOI Triple A in the abbreviation is not a typo....same abbreviation was used in 2015 Elections also.. as 'AAP'…"], ["thepla", 52029138, "RT @SpokespersonECI: @vishwamTOI Awami Aamjan Party was registered with ECI on 3.1.2011"], ["thepla", 2910067068, "RT @rishibagree: Not a Single BJP supporter blamed EVM for Delhi election losses \n\nThats the difference"], ["thepla", 983484289231851523, "The only good thing about today is the Dhokla duo's defeat. Thepla aur Omelette khaana with Rinkiye ke pappa"], ["thepla", 1215869148363812864, "@dikgaj @sarkar_swati @m_for_moriarty @gupta_skanda @Achaari_Thepla @maidros78 Not to forget this - https://t.co/zwUSYbw3uL"], ["thepla", 885136386902204416, "Kick-start your morning with sprouts thepla, a wholesome recipe curated by Lifestyle coach, Luke Coutinho.\nhttps://t.co/SOYCAPPer2 @DoC_GoI @MOFPI_GOI @APEDADOC  @DIPPGOI https://t.co/CULXUmqQ91"], ["thepla", 1215869148363812864, "@dikgaj @sarkar_swati @m_for_moriarty @gupta_skanda @Achaari_Thepla @maidros78 Take a survey. Ask Muslims if they prefer Bose or Savarkar. 90% will prefer Bose because he fought against British and not muslims. That should  convey everything :)"], ["thepla", 1215869148363812864, "@sarkar_swati @dikgaj @m_for_moriarty @gupta_skanda @Achaari_Thepla @maidros78 Savarkar's Hindutva ideology was against Jihadis and missionaries/British. Bose was just another anti-British warlord with no idea on the dangers of Jihad."], ["thepla", 1215869148363812864, "@sarkar_swati @dikgaj @m_for_moriarty @gupta_skanda @Achaari_Thepla @maidros78 Yeah, Bose fought for Hindus by having rabid Jihadis in Azad Hind Fauz and praising Mughals."], ["thepla", 1148102359, "@PakRoaster99 @dikgaj @m_for_moriarty @gupta_skanda @Achaari_Thepla @maidros78 No worries, we will expose how Hindu Mahasabha of Savarkar played hand maiden to Jihadis &amp; British. We are not done on that yet. You have to be a bit more patient. Read SPM’s diary, there is a reason why BJP does not publicize it."], ["thepla", 2452343594, "@PakRoaster99 @sarkar_swati @m_for_moriarty @gupta_skanda @Achaari_Thepla @maidros78 I think u haven’t read the article linked to you and you are talking from pre fixed need to damn Bose. There’s no point in this discussion as RSS/HMS will never appear appeasing to you regardless of actions at various points in time based on similar cherry picking. all the best!"], ["thepla", 2452343594, "@PakRoaster99 @sarkar_swati @m_for_moriarty @gupta_skanda @Achaari_Thepla @maidros78 if u still feel the need to single out Bose, u hv the freedom to do so&amp; I will simply bracket u in same regional/ Gandhian politics that still gets the possibly largest political funding&amp; has deep animosity to wider common Hindu resistance ag all forms of imperialist intrusions."], ["thepla", 34618931, "RT @dikgaj: @Achaari_Thepla Islamic expansion was guaranteed, with state protection at both ideological and material levels. While even cul…"], ["thepla", 34618931, "RT @dikgaj: @Achaari_Thepla if Partition was to be supported on \"majority Islam=cancer\" needing \"cutting off\", then there wd be measures to…"], ["thepla", 34618931, "RT @dikgaj: @Achaari_Thepla thats a BS logic in support of surrender in Partition, as Muslim popns with mullah-infrastructure intact will a…"], ["thepla", 2855747528, "RT @dikgaj: @PakRoaster99 @sarkar_swati @m_for_moriarty @gupta_skanda @Achaari_Thepla @maidros78 \"I am a frank man. I say bitter things to…"], ["thepla", 2855747528, "RT @dikgaj: @PakRoaster99 @sarkar_swati @m_for_moriarty @gupta_skanda @Achaari_Thepla @maidros78 \"British talk of Hindu-Muslim quarrels, bu…"], ["thepla", 1215869148363812864, "@dikgaj @sarkar_swati @m_for_moriarty @gupta_skanda @Achaari_Thepla @maidros78 Savarkar exposed Muslim invaders for their deeds. Show me any anti-jihadi statements by Bose."], ["thepla", 2855747528, "RT @dikgaj: @PakRoaster99 @sarkar_swati @m_for_moriarty @gupta_skanda @Achaari_Thepla @maidros78 I get that ur determined to bracket Bose i…"], ["thepla", 2855747528, "RT @dikgaj: @PakRoaster99 @sarkar_swati @m_for_moriarty @gupta_skanda @Achaari_Thepla @maidros78 There is a need to delegitimise Bose as na…"], ["thepla", 2452343594, "@PakRoaster99 @sarkar_swati @m_for_moriarty @gupta_skanda @Achaari_Thepla @maidros78 Every non-Muslim politician has so far chosen to navigate carefully in between appearing hostile to siding with mullahs depending on their contemporary perception of strength. We can’t cherry pick to legitimise or delegitimise voices but need overall actions to judge."], ["thepla", 2452343594, "@PakRoaster99 @sarkar_swati @m_for_moriarty @gupta_skanda @Achaari_Thepla @maidros78 I cd quote from Rakesh Sinha’s history of the RSS to point out the desperate attempt to show distancing from Savarkar on Muslim issue, or proving cooperation and tolerance for Islam/mullahs. Going into RSS actual twists and turns on Islam wd be unnecessary muddying of the waters"], ["thepla", 2452343594, "@PakRoaster99 @sarkar_swati @m_for_moriarty @gupta_skanda @Achaari_Thepla @maidros78 I get that ur determined to bracket Bose in the same category of pushing mullah interests first as Gandhians and HMS/RSS as washed tulsi where mullah appeasement is concerned: even after you presumably read our article on this. So not much will be gained in further discussions."]]