[["tomato soup", 864491545420017664, "okra and tomato soup nice and worm"], ["tomato soup", 222257368, "RT @thatsajellyfish: 2020 is all about new experiences! Dance like nobody’s watching! Travel to places you’ve never been! But don’t spill a…"], ["tomato soup", 904900523190571009, "Update on this: I ended up making a tomato soup with chicken broth, tomato paste, and a little bit of ricotta to fill it out. It's helping so much."], ["tomato soup", 2149994796, "@zeninawad Only in tomato soup. You just gotta try it."], ["tomato soup", 391035615, "Timer for a old school comfort lunch on a cold rainy day.  Grilled Cheese and Tomato soup..."], ["tomato soup", 246793812, "Perfect day 4 tomato basil soup with pepperoni and cheese quesadillas! @ Chandler, Oklahoma https://t.co/0jg2PrN4lu"], ["tomato soup", 875542844785782784, "@JaniceDean @MomSonya What? You don’t eat crackers with tomato soup! You eat a grilled ham &amp; cheese!"], ["tomato soup", 179055196, "Pro tip for all carers. Lie. Consider the following.\nMother (who is being difficult today): Is this Campbell's Cream of Tomato Soup?\nMe: (Looks at can and identifies that it is not) Yes.\nMother: (after consuming said soup)  Didn't taste like it.\nMe: That's co's of your meds."], ["tomato soup", 836275849141829634, "RT @JaniceDean: I put so many crackers in my tomato soup for lunch today it might as well have been tomato bread."], ["tomato soup", 19737305, "@Katerade He made me fancy grilled cheese and homemade tomato soup, plus a toasted turkey sandwich when we came home late from a party"], ["tomato soup", 2582853434, "RT @okeebzo: Apparently I can cook pretty well high. \n\nHomemade tomato roasted pepper soup in a bread bowl with a grilled cheese 🤤 https://…"], ["tomato soup", 3307063803, "RT @thatsajellyfish: 2020 is all about new experiences! Dance like nobody’s watching! Travel to places you’ve never been! But don’t spill a…"], ["tomato soup", 1064720085410095106, "RT @heyoitsmateo: whoever came up with the grilled cheese/tomato soup combo deserves a kiss"], ["tomato soup", 239424445, "RT @angtheamazing_: grilled cheese with tomato soup would go CRAZY rn"], ["tomato soup", 111400999, "I put so many crackers in my tomato soup for lunch today it might as well have been tomato bread."], ["tomato soup", 924274303, "RT @xoGlitterTV: My irl timelines are all people marrying each other, reproducing and new mom MLMs. \n\nAnyway last night I, a 26 year old wo…"], ["tomato soup", 3303352997, "Microwave tomato soup give me the power to survive my physics lecture"], ["tomato soup", 904506504933466112, "@CUPIDHYUN omg yeah i can’t deal with tomato soup it’s too much 😖😖"], ["tomato soup", 1224683065101946880, "@challenguate @mr_plantgeek Make a soup ! Peel it , cut it in pieces (3x3cm) , add caraway seeds, a little piece of fresh ginger , black pepper, salt , one tomato. Cook it , then blend it . It’s delicious ..."], ["tomato soup", 923720152348315648, "there are very few things in my schools dining hall that smack. but this cream of tomato soup SMACKS. 🤯"], ["tomato soup", 16360261, "RT @sarawrencomedy: Top 5 Power Couples:\n\n5) Chrissy Teigen &amp; John Legend\n4) Blake Lively &amp; Ryan Reynolds\n3) Ellen DeGeneres &amp; Portia de Ro…"], ["tomato soup", 985425300292022273, "RT @IngredientsBot: \"Soup\" (by Harris-Teeter Inc.) \n\n🍅 💧 🥛 🍬 🌽 🧂 🧅 🧄\n\nIngredients (16): Tomatoes (Tomatoes, Tomato Juice, Citric Acid, Calc…"], ["tomato soup", 1194829587454124033, "\"Soup\" (by Harris-Teeter Inc.) \n\n🍅 💧 🥛 🍬 🌽 🧂 🧅 🧄\n\nIngredients (16): Tomatoes (Tomatoes, Tomato Juice, Citric Acid, Calcium Chloride), Filtered Water, Tomato Paste, Cream, Cane Sugar"], ["tomato soup", 941821937243906048, "Today’s featured sandwich is a warm prime rib topped with sautéed onions, mushrooms, and melted provolone cheese on a toasted hoagie roll. Pairs great with chef’s classic tomato soup! 🍅 👨🏼‍🍳 😋  #deliciousfood #delish #yum #yummy #goodeats #localeats #eatlocal #buylocal #shoplocal https://t.co/gypgUxBkuI"], ["tomato soup", 305705081, "From the classic sandwich paired with tomato soup to a decadent lobster grilled cheese made with brie and goat cheese, here's where to head for a grilled cheese today https://t.co/KLrY372EXY"], ["tomato soup", 1011727897, "#gzgpsu \nBeef Chili(time to try it before it never leaves)\nYam and Chickpea Curry (Vegan and the best in our line up)\nEgg Flower Soup W/Chicken(taste so good.)\nTomato Bisque(great with Grilled Cheese) https://t.co/Wg45u8X4Wh"], ["tomato soup", 426162991, "1 of 2 Wednesday’s Menu!!\n*Tatanka Burger...Pure Bison Patty, Sage Caramelized Onions, Saskatoon Berry Ketchup, Smoked Saskatoon Spruce Cheese, Chipotle Mayo on a Night Oven Brioche Bun: $16 with Soup, Salad or Fries\n*Tomato Juniper Lentil Soup with Baked Bannock: $7 https://t.co/0VTyoUvLYF"], ["tomato soup", 945918978, "Loving the grilled cheese and tomato soup being served up by the awesome cooks at OVI!  Hits the spot! @BCSFoodNFit @Luke6196"], ["tomato soup", 4055192601, "Hot ham &amp; tomato sandwich today! Curried lentil soup and a roasted garlic &amp; brie croissant! #sandwich #ossoriobakery #HistoricCocoaVillage #321food #321flavor #SpaceCoast #LoveCocoaFL @ Historic Cocoa Village https://t.co/5TXrPwc89P"], ["tomato soup", 3473975175, "The tomato soup at my job is undefeated"]]