[["tuna sandwiches", 1192595032554889216, "@Zeledon_D They usually have them at their fresh section where the tuna sandwiches are"], ["tuna sandwiches", 2777466050, "No time for tuna sandwiches. https://t.co/sBOMsO4TFn"], ["tuna sandwiches", 150629188, "I’ve never understood why some people think sandwiches are boring, it’s all about the love you put into it. Tuna, lettuce, grated cheese, red onion, pickled jalapeño, tomato, mayo on sour dough bread double decker sandwich. \nWrap your laughing gear around that!! #sandwich #lunch https://t.co/y8rjb3YfN6"], ["tuna sandwiches", 2320293829, "#FOODTRUCK SPOT!! #LUNCH At Hudson and Sussex (70 Hudson) 11:30-2:30 pm!CALL FOR PICK UP 201-509-1163 #jerseycity #UberEats #ExchangePlace  #sandwiches #schnitzel #chicken #tuna #eggplant #vegetarian #salads #falafel #yum https://t.co/Yumrzj405F"], ["tuna sandwiches", 3239737131, "Our tuna salad (best in town) sandwiches are on special today starting at only $6.99. Served with a pickle, cookie and of course, a smile!"], ["tuna sandwiches", 2785259127, "@barkley_knows It was tasty, thanks! \n\nI still need some good casseroles to work with.  Not tuna, gack. I like Tuna steaks, sandwiches, sushi, but not casseroles.\n\nAny casserole that isn't heavy on onions or that can be adjusted to few of none too. Not because of me, I love onions hub doesn't."], ["tuna sandwiches", 1959439303, "Highlight of the day tucking into a buffet of lovely sandwiches at work. Bite into one without my glasses on and it’s the worst combination known, tuna AND mayo 🤢 Natalie, always wear your glasses 🤦🏼‍♀️"], ["tuna sandwiches", 990012025, "Happy Friday Eve Eve (i.e. Wednesday!) Today in the coffee bar, we're offering:\n*Soup: Cheesy Potato\n*Chili: Beef w/beans\n*Sandwiches: Egg Salad, Tuna Salad, Chicken Salad\n*Our 'Cup of the Day' is Almond Honey latte.\nWe're open 7am-4pm. See you soon! #katiescup #rockfordil https://t.co/igOBKMh66R"], ["tuna sandwiches", 23364610, "RT @FrankiesDeli: Today's Specials \nSoups: French Onion, Cream of Broccoli and our Homemade Beef Chili. \nSandwiches: Grilled Roast Beef Mel…"], ["tuna sandwiches", 326550799, "Today's Specials \nSoups: French Onion, Cream of Broccoli and our Homemade Beef Chili. \nSandwiches: Grilled Roast Beef Melt with fresh grated horseradish, Swiss cheese and Dijonaise dressing. We are also running a Tuna Melt with Cheddar cheese on a pressed panini.\nARANCINI TODAY!!"], ["tuna sandwiches", 1163527179994652673, "RT @JeffLMonaghan: @KwikTrip Your cold sandwiches are way too expensive. Egg salad &amp; tuna should be $1.99, not $3.99. That's ridiculous. Al…"], ["tuna sandwiches", 891814111788625920, "@KwikTrip Your cold sandwiches are way too expensive. Egg salad &amp; tuna should be $1.99, not $3.99. That's ridiculous. Also need a pork chop sandwich, no bone. People would buy that. What happened to green beans? Fried chicken looks overcooked &amp; unattractive. Why not promote baked potatoes?"], ["tuna sandwiches", 371612226, "@dudgeon_neil The bastards had to go with sandwiches...can't go the easy route...BAH! And...in 6 different varieties!! I say, you want sandwiches eat the damn tuna fish and get on with it!! Probably why I lost that job...lol"], ["tuna sandwiches", 1207408294177980418, "Finding out who's ahead of a political race in 2020 is like being told whether they're serving tuna fish or bologna sandwiches in the hospital cafeteria. #Election2020"], ["tuna sandwiches", 1191883310, "@BluefinDoc @FaunaFigures @TetZoo @SolomonRDavid @ColorataShop @thenfb I can’t be the only one addicted to tuna fish porn.  Since Blue planet 1 &amp; 2 we are starving!  The world needs less tuna fish sandwiches and more tuna fish pics."], ["tuna sandwiches", 1471843339, "Home made tuna sandwiches shmack"], ["tuna sandwiches", 936348002788130816, "@Olivia_Graciela Cheap hotdogs, sliced lengthwise in sandwiches. Cheap polish sausages with cheap canned chili dumped on top, with cheese, microwaved. Canned tuna for days."], ["tuna sandwiches", 1164695687646318592, "I brought tuna sandwiches to lunch every day of middle school, and more than anything I think that’s when I started being bullied."], ["tuna sandwiches", 768539840, "ordering my album finally tomorrow I lit have no money left from the time I worked but :( I want to have this album I’ll have to eat only tuna &amp; sandwiches for the next months until vacations so I can work again :( i feel bad for being a spine breaker for my parents again 🥺"], ["tuna sandwiches", 1154672022724599808, "@ihadztotweet @Jaiko1975 @Lethal_mosquito What!? Do you order tuna sandwiches at subway as well!?! https://t.co/zBUMQr5xpz"], ["tuna sandwiches", 1227091433183678464, "@Olivia_Graciela Corned beef, chicken spread, tuna cans, tomato and cheese sandwiches."], ["tuna sandwiches", 814175282676404224, "Tuna sandwiches taste better with wheat bread."], ["tuna sandwiches", 2312778554, "having tuna sandwiches with my favorite honkys"], ["tuna sandwiches", 1021436685131792385, "@Katweegee Yes it is. He also probably taste the chemo in his mouth, happened to me for 6 months. It's depressing because you can also smell the chemo on your skin (sweat). It super nauseating. Chicken noodle soup and tuna sandwiches got me through 6 months of being in a sterilized room."], ["tuna sandwiches", 36541258, "The quickest way to my heart is through a Tuna Sandwich. I’ll break up with a bitch that doesn’t like tuna sandwiches."], ["tuna sandwiches", 140871106, "Among them, the tacos were especially popular, and while we thought tuna sandwiches may appeal to many, they weren’t a big seller. In the end, hamburgers were the most popular, although not as many people went for them as last year."], ["tuna sandwiches", 140871106, "We had chicken wings, pizza, tuna sandwiches and tacos. Now a lot of the people who got hamburgers still went for the burgers, but others liked the extra options and got wings or pizza instead. Some people who had got hot dogs last year went for the burgers, but many did not."], ["tuna sandwiches", 15852054, "Yesterday wasn’t ALL bad. I had my favourite tuna sandwich at @eastsideeatery . Fresh and delicious. I love it with cucumbers and peppers! #nomnomnom #eeeeeats #eatlocal #sandwiches https://t.co/uustTFxWce https://t.co/uKfgzOWiMF"], ["tuna sandwiches", 840961968890556425, "“and you can grab one of the sandwiches from the chiller section, they’re going to expire anyway. it’s on me.”\n\nwseok does a quick turnaround towards the chiller, grabs the first sandwich he sees — it’s tuna, he thinks — and goes up to the counter again, “I don’t +"], ["tuna sandwiches", 1147853643741376512, "Bro you need to go back to having tuna sandwiches 😂😂😂😂😭😭😭😭 only a few will know about this one lmaoooooooo https://t.co/IAwNKSiQir"], ["tuna sandwiches", 255768872, "@jonessoruthless me and the folks will eat some tuna salad sandwiches in your honor."], ["tuna sandwiches", 15232802, "@Romudeth You somewhere someone said \"Pepperochini\" and the hard of hearing guy heard \"Pineapple\". Lol.  Like when people put apple in tuna fish salad sandwiches.... Someone said \"Pickle\" and the other heard \"Apple\"  lol"], ["tuna sandwiches", 4782217476, "@Suntimes BREAKING: Kim Foxx is calling for a ban on tuna sandwiches."], ["tuna sandwiches", 71767040, "@naomi9867 Poor effort, always Salt and Vinegar crisps with tuna sandwiches"], ["tuna sandwiches", 1193948372228591616, "RT @SaintAnthonysPS: 🥘🍛🍕🥔🐟🥪Lentil soup, pizza, baked potatoes, chicken curry, tuna sandwiches, mixed salad and healthy fruit are all on off…"], ["tuna sandwiches", 3728529913, "Ideas for using canned smoked tuna and canned smoked salmon: @prima wrote: I bought 3 tins of smoked salmon and 3 tins of smoked tuna at a craft fair last fall. How would you use it? I could make tuna or salmon casserole, fish cakes or sandwiches.… https://t.co/sasdFxrymq"], ["tuna sandwiches", 3433527107, "Talking about food taboos\n\nI was making cheese and tuna sandwiches for years and got flak for it but now it’s acceptable?"], ["tuna sandwiches", 901391988322439169, "RT @StJuliansEY: @StJuliansEY #StJuliansNursery had lots of fun eating their freshly made tuna sandwiches in the Octopuses garden after lis…"], ["tuna sandwiches", 234915851, "@mckellogs I once went to a wedding that had just this, sausage balls, and tuna salad sandwiches and I still say that was the best damn wedding food I have had at ANY wedding."], ["tuna sandwiches", 827595643224940544, "my office got a vending machine that sells tuna salad sandwiches and hard boiled eggs and sparkling water so now i never have to leave the office"], ["tuna sandwiches", 4170004648, "🥘🍛🍕🥔🐟🥪Lentil soup, pizza, baked potatoes, chicken curry, tuna sandwiches, mixed salad and healthy fruit are all on offer in our dining hall tomorrow #purplemenu #workingtogetherforexcellence #teamwork @North_Ayrshire #decisionsdecisions https://t.co/MyvaUfjYBA"], ["tuna sandwiches", 1486186417, "RT @MordisFoodTruck: #FOODTRUCK SPOT!! #LUNCH At Hudson and Sussex (70 Hudson) 11:30-2:30 pm!CALL FOR PICK UP 201-509-1163 #jerseycity #Ube…"], ["tuna sandwiches", 819088146973474816, "RT @MordisFoodTruck: #FOODTRUCK SPOT!! #LUNCH At Hudson and Sussex (70 Hudson) 11:30-2:30 pm!CALL FOR PICK UP 201-509-1163 #jerseycity #Ube…"]]