[["turkey curry", 755329842, "@jamessbond20 @Jessmegandmum @dominos I’m a bit odd as I don’t like fruit and meat together at all, no apple sauce on pork, cranberry on turkey ect ect. Can handle a sultana in a curry if nessesary but that’s my limit."], ["turkey curry", 4816285632, "#currynight #SaturdayNight\nCreamy turkey meatball curry with brown rice 😋😋\n#30daystohealthylivingandbeyond https://t.co/ljqVH3RZMY"], ["turkey curry", 770732383, "ground turkey looks and feels disgusting but it’s good in curry"], ["turkey curry", 148672738, "Chicken curry sauce, spicy turkey wings, mackerel stew. Slowly getting my cooking vibe back. Weekend finna b lit"], ["turkey curry", 381512025, "@BirdsEyeView008 I made a red curry but using Turkey breast in a healthy fashion"], ["turkey curry", 2752144250, "@nlbmprez Prez you have any info on guys like Goose Curry and Norman 'Turkey' Stearnes?"], ["turkey curry", 134426220, "@chinchilladas @ZipBluePanda No curry, or turkey leg? Booker, i know your pain from having grown up in a tiny Texas town too! I'm taking over food reservations at cons for my nerd herd, you're going to be included and fed! San Japan we are doing Fogo, you're in! I'm gonna adopt you as my food child!"], ["turkey curry", 1169716596056571904, "RT @kennybeats: DENZEL CURRY x KENNY BEATS \n\nUNLOCKED\n\nOUT NOW EVERYWHERE https://t.co/vNtRuwWpSX"], ["turkey curry", 106792353, "Made a bomb ass chickpea and turkey sausage curry tonight! 🥵😍😋 https://t.co/bO5qg7ybAg"], ["turkey curry", 151874368, "Dinner was yummy. I used a turkey broth reduction and one can of low fat coconut milk as a substitute for a can of full fat coconut milk. https://t.co/1IUBIStmyd"], ["turkey curry", 972236811043880961, "Base of Baby Spinach with roasted turkey breast, black beans, tortilla strips, crispy wontons, rainbow rotelli pasta, bean sprouts, and honey curry dressing #SimplySalad #RandomSalad"], ["turkey curry", 20555137, "@alexkealy Hmm. Could be a few more weeks yet, there's turkey curry too."], ["turkey curry", 2950324205, "Curry Turkey w/Potatoes and White Rice #LiveFromTheKitchen https://t.co/mnD3H6XGFI"], ["turkey curry", 292723607, "Spicy Turkey sausage zucchini boats to go along with some Thai Curry Spicy Soup @ Mailers Haven https://t.co/6JUpUyPpws"], ["turkey curry", 126712638, "Happy Thursday!\nToday’s special is grilled veggies, prosciutto and penne tossed in a curry cream sauce, comes with soup to start and the soup today is turkey vegetable w/ rice\n $16.00 🍅🧄🥦🥕🧅\n#pasta #curry #staywarm #deals"], ["turkey curry", 221658128, "One-Skillet Ground Turkey Thai Curry Is Perfect for Meal Prep https://t.co/S8EGU1viCV https://t.co/CEqwnvShdj"]]