[["vada pav", 3118793391, "@Surviving_Sid That's so sweet of you Sid... 😊😊😊thank you for the Vada Pav. 👌👌👌"], ["vada pav", 1937629639, "@nehaviveknair You're so optimistic Neha :) impressed. \nWish god bless you with unlimited vada pav 😛😝🤪 lifetime offer"], ["vada pav", 24367541, "@maikeya There is a significant overlap in Raw Pressery and Vada Pav drinkers. What about them? What about them? These are double-standards!"], ["vada pav", 446095283, "Serve gharam vada pav\n\nDalit followed footsteps of ambedkar\n\nExited out of hinduism\n\n😂 https://t.co/JWArkByBCD"], ["vada pav", 99046973, "Indian digital publications and digital media - there is news, and there is entertainment. There is news for India One. There is news for Bharat. There is entertainment for Raw Pressery drinkers. There is entertainment for Vada Pav eaters.\n\nAnd in between, there is nothing."], ["vada pav", 1186180502866104320, "Footpath near Shiv Sena shaka on 90 ft road mulund e is obstructed by people sitting on chairs on the whole breadth. There is also a vada pav wala here. This forces people to walk on the narrow road. We expect better discipline from the ruling party @mybmcWardT @mybmc https://t.co/c06AFcEfeC"], ["vada pav", 471899070, "@Kohlischarms Bombay is nice but so many slums, food me sirf vada pav, how you will survive."], ["vada pav", 992718642562318336, "@VarunmThakur @Cowtuk @TheAadarGuy Noone:\nLiterally Noone: \nVarun: \"Paishe\" ....watching it again. lol ed so hard at varuns description of air indias food. vada w/o pav 😂🤣😂🤣"], ["vada pav", 2459854650, "Love Vada Pav? We have you covered. Enjoy this iconic Bombay street food right here in #Irving. \n\n#BombayChowpattyIrving #Indianfood #Indianfoodnearme #Indianrestaurantnearme https://t.co/ORa3oZiWGa"], ["vada pav", 3094894528, "@ANI Work on economy..nahin to Vada pav bechna padega."], ["vada pav", 2834424180, "@PadmaLakshmi Do you have a good recipe for vada pav? Not asking for a friend"], ["vada pav", 52357444, "@grrrvita Garvi spoke to him a few days ago on vada pav!!"], ["vada pav", 53368710, "5 Foods to Get to Know Me:\n\n1. Mutton Biryani\n2. Crab Curry\n3. Butter Chicken\n4. Vada Pav\n5. Medu Vada https://t.co/aTB8ug7Vy9"], ["vada pav", 468149402, "@RoflMarathi_ The only vada pav I had in Mumbai was delicious"], ["vada pav", 934286609469513729, "When I'm alone at home I take a little bit of the vada out of the pav guys. And I save a little bit of the toppings of the pizza so that i can eat it later. Judge me.\n#FoodForThought #foodies #home #alonetime #indianfood"], ["vada pav", 1226186170201034752, "RT @RoflMarathi_: If you ever come to Maharashtra..\nDon't eat Vada Pav at any Rajasthani sweet mart..\n\nThey make good samosa's..\nBut Vadapa…"], ["vada pav", 1694576671, "RT @NewWifesTales: @tribalations Horrible boss 1- didn't pay 2 months of salary because of cash crunch and then yelled at me one day when I…"], ["vada pav", 4798752794, "If you ever come to Maharashtra..\nDon't eat Vada Pav at any Rajasthani sweet mart..\n\nThey make good samosa's..\nBut Vadapav.. 👎🏼👎🏼\n\n(Just ate vada pav which was terrible in taste.. 😖)"], ["vada pav", 3087850129, "@tribalations Horrible boss 1- didn't pay 2 months of salary because of cash crunch and then yelled at me one day when I fainted and fell because I hadn't eaten the whole day because I didn't even have money for a vada pav... Left that day and never went back."], ["vada pav", 73810273, "@ScoopWhoop @HiltonHonors Have you tried Vada Pav Outside of  Bhandup Station.. opposite to Ticket Counter...?"], ["vada pav", 894384300744888320, "@KabirTaneja They don't know good mughal food. Ignore that and go to Bombay Vintage for fab local Bombay food that is not vada Pav. Or Miss T for veitnam/Cambodian food or Souffle sil vous plait for best Souffle this side of the world though only open for dinner."], ["vada pav", 144194764, "samne ka pada hai ... vada pav and vada pav is Dr Sid ka favorite so I guess she is giving herself saza by eating those mirchi and this could happen after Sid comes out of coma and she doesn’t wanna face him #Sanjivani https://t.co/qSUQWlrBl3"], ["vada pav", 219273338, "How To Make Fiery Vada Pav Chutney Powder At Home (Recipe Video Inside) #streetfood #snack #indianrecipe\nhttps://t.co/YCacrCbFMA"], ["vada pav", 1096737814656344064, "How To Make Fiery Vada Pav Chutney Powder At Home (Recipe Video Inside) https://t.co/dZ8ZKK2aSO https://t.co/dmjvSkehYM"], ["vada pav", 2744401760, "@miranarayan9619 @lerandomanon @Ghost_NextDoor @veiledpujarin Idli, poha, upma, misal, etc all Mumbai staple..!\n\n\"vada pav defense\" 😂\n\nBy the way, this is the first time I've ever heard someone saying Vada pav is hated.. Lol"], ["vada pav", 1048492979902722048, "@miranarayan9619 @Ghost_NextDoor @justain5 @veiledpujarin Idli and poha are nice too\n\nThere is no defence about vada pav. I am not asking you to like it. You are right in your way :)\n\nIt's just that through the 90s &amp; 00s there have been many people who were too poor to afford proper meals and vada pav filled that gap. It has my respect"], ["vada pav", 1215971602166427648, "@lerandomanon @Ghost_NextDoor @justain5 @veiledpujarin I will do with the idlis n pohas.\n\nOh ok u can b happy about the fact that i loved pohas a lot. Still not buying ur vada pav defense."], ["vada pav", 1048492979902722048, "@miranarayan9619 @Ghost_NextDoor @justain5 @veiledpujarin Pav bhaji and misal pav are for days when you have more money. Vada pav or banana is daily meal."], ["vada pav", 1215971602166427648, "@lerandomanon @Ghost_NextDoor @justain5 @veiledpujarin Can't help it. I hv lived in Mumbai for 7-8 yrs n used to b very poor too. Bt no vada pav for me.\n\nPav bhaji n misal ws still ok."], ["vada pav", 1048492979902722048, "@miranarayan9619 @Ghost_NextDoor @justain5 @veiledpujarin As a poor man living in Mumbai, I am offended at your take on vada pav. It is our staple. It is our meal."], ["vada pav", 1196340921303891968, "How To Make Fiery Vada Pav Chutney Powder At Home (Recipe Video Inside) https://t.co/9fix3QmcqB https://t.co/zlyR5tcsTR"], ["vada pav", 1130079972356370434, "How To Make Fiery Vada Pav Chutney Powder At Home (Recipe Video Inside) https://t.co/rwy9S5GiT0 https://t.co/PWfggUoZb3"], ["vada pav", 1092804391260876800, "How To Make Fiery Vada Pav Chutney Powder At Home (Recipe Video Inside) https://t.co/oxzRxGVPXV"], ["vada pav", 1092804391260876800, "How To Make Fiery Vada Pav Chutney Powder At Home (Recipe Video Inside) https://t.co/8SDXtcVgLl"], ["vada pav", 1092804391260876800, "How To Make Fiery Vada Pav Chutney Powder At Home (Recipe Video Inside) https://t.co/pwQezZPQ2E"], ["vada pav", 4299385155, "Vada Pav - potato cutlet in a bun | popular indian street food with a chinese twist https://t.co/pjcNGZhRey https://t.co/hs0Nl2j0UD"], ["vada pav", 3365632558, "My future probably eating vada pav in some place in Bombay w her friends bitching about each other rn"], ["vada pav", 33583064, "Randomly missing mithibai college.\nMay be it's the chilled out life or maybe it's just the vada pav. 💁‍♀️"], ["vada pav", 1194329208412966912, "@ek_aalu_bonda @AUThackeray @priyankac19 Don't worry....this money they will recover by selling Vada pav at Shiv Vada pav center"], ["vada pav", 1206477414639030272, "@harishbpuri @ttunni @missbunnydoodle @vyasshruti @vinnykhullar @shwetankbhushan @Mohansinha @freentglty @AditiIndiaFirst This is for sobo public i s'pose.\nThe gourmet connoisseurs want to experiment with Indian food to make it palatable for western kitchens.\nBut to tamper with vada pav is sacrilege."], ["vada pav", 100454382, "@rohini_sgh @NRA29 What is secular n secularism in India? Can anyone explain n give only one correct definition? People use it as simple as vada pav or samosa or biryani all eatables but  with only one and the same outcome/ output?"], ["vada pav", 33245871, "@Madah_J I love Vada Pav! I know it's more of a Mumbai thing but I'm sure I can track some down!"], ["vada pav", 593802368, "@Fashionicide I’m so jealous but also excited for your travel stories so I can live vicariously. Also please have authentic vada pav and bhelpuri and pani puri and nihari and Quorma."], ["vada pav", 56117001, "RT @genesiaalves: The Goans (East Indian side eye) are claiming to have taken our wada pao and made it... hold your chutney... better! \nVik…"]]