[["vanilla ice cream", 1219295169440292874, "One scoop of vanilla and one scoop of chocolate chip ice cream drizzled with hot chocolate sauce and decorated with chocolate chips served in a chocolate dipped ice cream cone."], ["vanilla ice cream", 1186452287734112256, "RT @bIinkaholic: some people dont like vanilla ice cream https://t.co/Hb5PilVvRW"], ["vanilla ice cream", 1127696796128509953, "@BillTzamaras Warm Peach pie w/ vanilla bean ice cream on top."], ["vanilla ice cream", 1183045910005243904, "@bIinkaholic vanilla is the best ice cream flavor."], ["vanilla ice cream", 1217939441941209088, "mcdonald’s vanilla ice cream is soo good"], ["vanilla ice cream", 1013084650871361537, "@0201_haniyyah @sunfIowerdobrik @glitterylouis_ HOPE U LIKE CHOCOLATE AND VANILLA ICE CREAM"], ["vanilla ice cream", 875718913815916546, "Vanilla ice, ice BABY! 🍨🥶 Meet Vanilla Ice from @LakeCityCider !\n\nTanzanian fair trade vanilla beans are steeped in a wild ferment of fresh pressed NS apples. The result is a dry, #nscraftcider with tropical notes and flavours of french vanilla ice cream.\n\n📸 by @LakeCityCider https://t.co/vglyDFRVxR"], ["vanilla ice cream", 2638194558, "Getting you all in the mood for Valentines Day with our Rhubarb and custard panacotta, handed pistachio and vanilla ice cream dessert! ❤️ Join us this Valentines Days and treat the Mrs to a glass of bubbly 🥂 #TheShip #ValentinesDay #Dessert #Delicious https://t.co/17kkjccdqi"], ["vanilla ice cream", 1223662123286507520, "@HermaineM Alot of chocolate, chocolate caramel and vanilla ice cream and a cute teddy bear"], ["vanilla ice cream", 3694862234, "@KosherSoul Growing up, it was being teased for \"talkin' White\" or being called \"Sidewalk Sunday\" (chocolate on the outside vanilla ice cream in the middle)."], ["vanilla ice cream", 541451842, "@Youssefyasser__ ah momken vanilla ice cream once every blue moon"], ["vanilla ice cream", 4082928322, "RT @Creamiestice: Which ice cream is better? #like for vanilla, #retweet for chocolate! https://t.co/8gNDJdZAfM"], ["vanilla ice cream", 1225776761788620801, "Which ice cream is better? #like for vanilla, #retweet for chocolate! https://t.co/8gNDJdZAfM"], ["vanilla ice cream", 853544305864183808, "RT @LaSukuta: @TheSwaziPablo Apparently Vin Coco slaps with vanilla ice cream but we really don’t need to know if this is true shem."], ["vanilla ice cream", 1180081241317609473, "@Iuvwoojin I eat vanilla ice cream with cheese puffs 🤷🏼‍♀️"], ["vanilla ice cream", 124229553, "@99freemind Why is she so angry? I think she should have a nice piece of hot apple pie and vanilla ice cream and then try to reply to you afterwards with an apology once she has calmed down. Or maybe she could have a hot chocolate float with whip cream and a cherry with a dusting of coco."], ["vanilla ice cream", 745287870844383232, "@GftdGoddesses Ooooh French vanilla ice cream. Yes ma’am. You right."], ["vanilla ice cream", 2499379428, "serving it looked disgusted to even put it togetehr\"\n\"Stop criticizing my ice cream! You don't hear me saying anything about your stupid blackberry vanilla...swi..rl...god that does sound good, let's trade\"\nSeokjin sighed and gave Yoongi his ice cream while he threw the other one"], ["vanilla ice cream", 1012409395026714624, "RT @bIinkaholic: some people dont like vanilla ice cream https://t.co/Hb5PilVvRW"], ["vanilla ice cream", 121392305, "I took my 12 year old child on the back of my #GSD bike for a 43km trip through the boggy pine woods and along the river with its deep black water and ice flecks. We didn’t see another rider. We stopped at a bakery and ate vanilla cream doughnuts. #bike365 @bikeshopgirlcom"], ["vanilla ice cream", 15265269, "You had me at vanilla, let alone the ice cream!"], ["vanilla ice cream", 1002208020099751942, "Vanilla is the water of ice cream flavours"], ["vanilla ice cream", 467832361, "@JackPosobiec 1. He eats plain toast\n2. He only likes vanilla ice cream\n3. He only has sex in the missionary position"], ["vanilla ice cream", 34402722, "@PascoSheriff @turtlesrcute14 Chocolate cake with vanilla icing and vanilla ice cream"], ["vanilla ice cream", 1182231862737027072, "@daewoo_sda I'd make my husbands favourite, salted caramel with vanilla ice cream @mark50235823 https://t.co/WiEQ7aEVPP"], ["vanilla ice cream", 1158977400241176578, "@fitdelhigirl Try replacing the fresh cream with vanilla ice cream...."], ["vanilla ice cream", 875681623, "@TomByr @highland__Mike It's actually delicious! Vanilla ice cream and coffee= affogato"], ["vanilla ice cream", 877239449217904640, "RT @bIinkaholic: some people dont like vanilla ice cream https://t.co/Hb5PilVvRW"], ["vanilla ice cream", 1213931858330734592, "RT @bIinkaholic: some people dont like vanilla ice cream https://t.co/Hb5PilVvRW"], ["vanilla ice cream", 3429488657, "@Chaosxsilencer Plate 3... Warm brownie and vanilla ice cream"], ["vanilla ice cream", 2994747118, "@BillTzamaras Homemade apple with vanilla ice cream! LOL"], ["vanilla ice cream", 1153686412279128065, "@bIinkaholic i only eat vanilla ice cream"], ["vanilla ice cream", 1104178508446818305, "RT @bIinkaholic: some people dont like vanilla ice cream https://t.co/Hb5PilVvRW"], ["vanilla ice cream", 719243145263869952, "@BillTzamaras Tripleberry 😍🥧\nMust be warmed served with a scoop of vanilla ice cream."], ["vanilla ice cream", 1052195594, "@Simp2011 The only things vanilla I have time for: cookies, cake, ice cream, etc. I’ve never been a fan of chocolate anything"], ["vanilla ice cream", 2770493616, "@Breyers why have you stop making vanilla bean ice cream?!"], ["vanilla ice cream", 1342813022, "Banana Pakora Dessert. Shareable and oh so Yummy. Warm banana Pakora topped with French Vanilla Ice cream, chocolate sauce, whipped topping and a cherry on top!  #Desserts #CurrysLondon #CurrysRestaurant #BananaPakoraDessert https://t.co/HMdqszhYUz"], ["vanilla ice cream", 1073581347011260417, "jalibi, vanilla ice cream, french fries"], ["vanilla ice cream", 889465157683879936, "RT @TheFoodOverload: Cherry Vanilla Ice Cream\n#Food #FoodPorn #Photography https://t.co/PB3Jl1C7Ax"], ["vanilla ice cream", 1216454449171963904, "RT @bIinkaholic: some people dont like vanilla ice cream https://t.co/Hb5PilVvRW"], ["vanilla ice cream", 963646525959270400, "@bIinkaholic cheap vanilla ice cream can be really disgusting doe https://t.co/0Eg0KbOnSB"], ["vanilla ice cream", 238774890, "RT @KeithJCarberry: the jokes about vanilla ice cream have to end. vanilla is good! it's not \"no\" flavor it's vanilla! the ice cream that i…"], ["vanilla ice cream", 1145484528179458048, "some people dont like vanilla ice cream https://t.co/Hb5PilVvRW"], ["vanilla ice cream", 295544793, "Ending in 21d 12h. Lovely shower gel. Philosophy French Vanilla Ice Cream Shower Gel (32 oz) https://t.co/5NDRjrDtnf #eBay"], ["vanilla ice cream", 1221145319565660161, "RT @ManUpUAll: @C_Rich75 Its deep cognitive training of all things white are to be desired. At one time #ADOS/#FBA could only eat vanilla i…"], ["vanilla ice cream", 1058026433090588672, "@SerpentAU Throw hella vanilla ice cream to balance it out and that's a whole ass depressed breakup snack"], ["vanilla ice cream", 716401782063149057, "@theinesrose @wawulizing @TinySilhouette No I get it like I love chocolate ice cream. But say if I’m blind and you offered chocolate ice cream I expect chocolate that’s on me. But if I’m offered chocolate and I get bland ass vanilla instead that’s on them for the deception."], ["vanilla ice cream", 309910867, "White + milk chocolate brownie served with salted caramel sauce and vanilla ice cream 😋 (first time making brownies btw) https://t.co/iukqPdI5aK"], ["vanilla ice cream", 2981360978, "my legs always get way more tanned than the rest of my body and I end up looking like vanilla and chocolate ice cream"], ["vanilla ice cream", 805743207107674112, "@JackPosobiec Romney: “can I get plain ice cream?”\n\nDQ worker: “you mean vanilla?”\n\nRomney: “no, I don’t need all that fancy flavoring stuff”"], ["vanilla ice cream", 23005842, "@TacosNSlurpees I’m not a huge lover of chocolate like this, but eat it warm with some vanilla ice cream and it’s pretty darn good"], ["vanilla ice cream", 1080787498798858241, "RT @TheFoodOverload: Cherry Vanilla Ice Cream\n#Food #FoodPorn #Photography https://t.co/PB3Jl1C7Ax"], ["vanilla ice cream", 764837905705472000, "I might be basic and likes vanilla ice cream,, but at least I wash my *ss with a bidet and not tissue."], ["vanilla ice cream", 427075574, "@CheyMcElhaney3 vanilla ice coffee w cream &amp; sugar \n\n&amp; if you take your own tumbler cup/yeti your coffee is only like $1.60 🤗"], ["vanilla ice cream", 1030140033754443776, "@imyasminaa bread and popcorn\nfries and vanilla ice cream"], ["vanilla ice cream", 1184408072636239878, "RT @KeithJCarberry: the jokes about vanilla ice cream have to end. vanilla is good! it's not \"no\" flavor it's vanilla! the ice cream that i…"], ["vanilla ice cream", 1166413301699547139, "Vanilla bean ice cream and a brownie let’s take a flight"], ["vanilla ice cream", 53234214, "@uncharted_words @POSH_DIVA7 Mint Ice cream is top 2. I also enjoy vanilla Ice Cream with peanuts and Candy corn on top of it."], ["vanilla ice cream", 2400571542, "@Natersby Verdict: Decent flavour. Not too sweet. This means: You can eat loads more than you intend to. This is a good thing.\n\nYet I cannot avoid thinking that I could replicate it (to some extent) fairly easy. Make vanilla flavoured vegan ice cream at home, add Oreos and peanut butter."], ["vanilla ice cream", 451103711, "@TacosNSlurpees Excuse me. Put some vanilla ice cream on here and there are fewer better."], ["vanilla ice cream", 1317707455, "Reduced balsamic on vanilla ice cream is fuckom great"], ["vanilla ice cream", 257207680, "@higgsbosonlite @JeffSharlet That's what I don't understand about \"undecided\" voters. If you're choosing ice cream, \"I like chocolate, but I also like vanilla,\" is a legitimate matter of personal preference. But this isn't chocolate vs vanilla--it's democracy vs fascism, truth vs lies, justice vs corruption!"], ["vanilla ice cream", 88250803, "@BillTzamaras Mmmmm..... I do love fresh and hot baked apple pie topped with vanilla ice cream. But I love strawberry rhubarb, too. AND key lime ain’t too shabby either. #GimmeAllThePies"], ["vanilla ice cream", 1072339399, "@iamshylaoliver mix snow w vanilla extract and sugar and milk and then it’s ice cream"], ["vanilla ice cream", 3129456203, "I’m so tired of Nigerians, its only here you’d hear an ice cream/yoghurt vendor, who rides a bicycle going about selling his goods to the tune of TITANIC.\nWho wants to buy Vanilla ice cream and start crying after taking one lick?!\n\n…"], ["vanilla ice cream", 796007642057572353, "RT @Mike121948: @JackPosobiec @MittRomney came over my house to borrow some ice cream for a meeting he was having with Democrats. All I had…"], ["vanilla ice cream", 1072392707555782656, "@XavyCake I think I already answered this one, actually, buuuut!\n\n1. Regular chocolate chip (no mint, pls!)\n2. Vanilla with Kit Kats!\n3. Heckin’ fresh, cold vanilla ice cream on top of a hot, flakey brownie. *drools*\n\nYah, I love me some vanilla! :P"], ["vanilla ice cream", 895768789018607616, "Worried about destroying the diet on #ValentinesDay? This #Vegan Vanilla Strawberry Ice Cream Cake will delight on #dessert, AND save the diet! Check out the recipe at the #StPeteFit blog: https://t.co/IotOWq9eBE  #HealthyRecipes https://t.co/4TIUKLvBMb"], ["vanilla ice cream", 864983022617190401, "@loveIydior I love to eat strawberries 🍓, but I’m team vanilla for ice cream 🍦"], ["vanilla ice cream", 2776363570, "Please stop feeding your dogs whipped cream or vanilla ice cream. It’s not good for them, give them peanut butter (WITHOUT xylitol) or some fresh fruit like blueberries or banana as a treat."], ["vanilla ice cream", 2829974430, "@ArtItNow1 @UniverCurious I'll have the white bread with mayonnaise and some vanilla ice cream"], ["vanilla ice cream", 848160019124236288, "@BillTzamaras Plain ole cherry—with vanilla ice cream."], ["vanilla ice cream", 18966303, "@Boroboy65546589 Probably eating. Warm apple cobbler with vanilla ice cream sounds good right now..  LOL"], ["vanilla ice cream", 1179383970271780865, "Try our latest featured item: Cannoli Supreme!\n\nTwo layers of our Chocolate Chip ice cream with a crushed cannoli and chocolate ganache center and then topped with chocolate and vanilla frosting, cocoa powder and piled high with ice cream filled cannolis. https://t.co/vQrTfmy2Kq https://t.co/i46P7woJhe"], ["vanilla ice cream", 1170596048, "@xx__kel Add vanilla ice cream or honey with it https://t.co/RHWkRL33s1"], ["vanilla ice cream", 10521002, "@JayJurden This is even funnier because I have vanilla ice cream in the freezer right now"], ["vanilla ice cream", 295241261, "@TheSwaziPablo Apparently Vin Coco slaps with vanilla ice cream but we really don’t need to know if this is true shem."], ["vanilla ice cream", 1219295169440292874, "One scoop of vanilla and one scoop of almond fudge ice cream drizzled with hot chocolate sauce and decorated with roasted almond pieces served in a chocolate dipped ice cream cone."], ["vanilla ice cream", 867108890, "ok so who’s bringing me a venti vanilla sweet cream cold brew less ice with a nitro lid cause i’m in need"], ["vanilla ice cream", 786014849918787584, "I can now say if you put a mars bar, a milky way, some malteasers, chocolate and vanilla ice cream, a mug of baileys, a mug of milk in a blender and turn it into milkshake it v tasty 😁👊🏻"], ["vanilla ice cream", 1167437032391663616, "\"Triple vanilla ice cream makes me moist.\" https://t.co/jzMYpHGGF2"], ["vanilla ice cream", 293668971, "Breakfast this morning was warmed apple pie with vanilla bean ice cream.... #strangebuttrue https://t.co/ECrGRvBiwR"]]