[["veggie samosas", 1619648904, "@bzdarling the veggie samosas!!!!!!also their sesame seed bagels and their juice (grapefruit juice especially!) selection is so *chef kiss*"], ["veggie samosas", 765935168381128704, "Psa: the veggie samosas at my fave subway food stop are better than sex"], ["veggie samosas", 2766001628, "I managed to find out where we might me going... an Italian or an Indian. Curry is safe... I usually just get three sides veggie samosas, alo gobi(curried cauliflower) and tarka Dahl (lentils) then steal a table spoon or two of someone else’s rice 🍚"], ["veggie samosas", 932409815455875072, "@GunKatCosplay Lol no. not that they couldn’t, but I’m a vegetarian so I doubt I would have leftover chicken. It’s some veggie samosas I made that got kinda gooey after sitting in the fridge for a while."], ["veggie samosas", 1170045747917742082, "The guy in Abdul's kebabs in Fallowfield just shouted out my order as soon as I walked in the shop. Yes sir, I do want two veggie samosas on a naan. This is the greatest day of my life."], ["veggie samosas", 1202843503, "@Simplynvm Japanese style curried veggies? Chickpea masala? Peanut butter noodles? Butternut squash soup? Veggie samosas/egg rolls? Curry veggie buns?"], ["veggie samosas", 361439524, "Jasok is bringing home chana masala and veggie samosas and that is all I want to think about right now"], ["veggie samosas", 4845499808, "@cerealkgs veggie samosas, veggie pakoras, and chickpea curry🤤🤤🤤"], ["veggie samosas", 1093865143, "@TwinSunsAmanda @_EricPfeifer Oooo that sounds amazing! Have you ever had veggie samosas? They are so good. I also really like lamb korma, oh and kebabs as well"], ["veggie samosas", 3381035638, "19 asked for samosas first her last meal at home. Chicken tikka and veggie samosas in the oven for an early dinner now before we hit the road. 😭"], ["veggie samosas", 734903432574861312, "@ToshinoriSensei Veggie samosas taste like home and I never even had them growing up. They're just delicious comfort food 🤣"], ["veggie samosas", 714949225373638656, "D-6\nBreakfast: -nothing-\nLunch: vegetable samosas and rice\nDinner: veggie ramen\nSnacks: dates and nuts"], ["veggie samosas", 264179434, "would it be sustainable for me to live off veggie samosas for the rest of my life?"]]