[["ven pongal", 854425457848135681, "@JonathanPKatz i love biryani it's delish but have a special comfort place in my heart for ven pongal - rice and moong dal cooked together til real soft, temper some cumin peppercorns ginger in a lot of coconut oil or ghee mix it in. i add some coconut milk and cashews to mine. easy and yum."], ["ven pongal", 1013992432650686464, "Ven Pongal &amp; Coconut Chutney (nip) - Breakfast time .... \n\n#venpongal #breakfasttime☕️ #breakfasttoday #tambrahm #southindianfood #foodphotography #tuesdayvibes #tuesdaythoughts #homecookedmeal #homemadewithlove… https://t.co/ShKeqNymSY"], ["ven pongal", 1218529491494088706, "Ven Pongal is a very easy and comfort South Indian  breakfast recipe. Enjoy Ven Pongal with Tiffin Sambar.Instant Pot Ven Pongal recipe available @ https://t.co/w90DgiOA4X\nTry this recipe and post your comments\n#instantpot #breakfast #pongal #vegetarian #comfortfood https://t.co/sPLW15pwfG"], ["ven pongal", 1164218748401836032, "@Winkerbell_ I can eat South Indian food every day - idiappam, upma, vada, ven pongal, ghee roast, appam, sambhar, rasam, all the curries in different flavors and colors (plus all the dishes I can't pronounce that one gets from Kerala Pongal specials).  Yum yum (i am not South Indian 😋😋)"], ["ven pongal", 964860672462020608, "RT @FoodsGlood: Ven Pongal Recipe is a very traditional breakfast or tiffin dish in South India.\nGlood Foods - For Trade Enquiry: 842806099…"], ["ven pongal", 1222153594100572161, "Ven Pongal Recipe is a very traditional breakfast or tiffin dish in South India.\nGlood Foods - For Trade Enquiry: 8428060999\nVisit: https://t.co/4WNHnB27fk\n\n#gloodfood #pongal #venpongal #goodfood #traditionalfood #southindianfood #breakfast #readytocook #easyrecipes https://t.co/VScqo7n3yn"], ["ven pongal", 37956884, "@anand_s98 @Telugu_vaaru @n81shrikanth @jsaideepak each south indian state has its own tiffin specialities, but being the best this or that can be a highly debatable topic. but still would like to stick my neck out &amp; bat for ven pongal &amp; medu vadai. Idlies at Ratna cafe in Chennai"], ["ven pongal", 37956884, "@Telugu_vaaru @n81shrikanth @jsaideepak ven pongal and medu vadai combo, beats any other tamilian dish hands down, am afraid"], ["ven pongal", 1163170865279692801, "Simultaneously cooking ven pongal and couscous makes me realize just how eclectic my diet has become in grad school."]]