[["yogurt soup", 1586144815, "Anyone else want to dive into a bowl of soup right about now? BRrrr Kuri Squash soup with ginger lime yogurt, chili oil, and crispy carrots. #soup #charlottesoup #cltsoup #moffettrestaurantgroup #goodfoodclt https://t.co/7HfbwlB620"], ["yogurt soup", 923270571965554689, "@yuka_cchii Oh good god im so sorry yuka 😭 make sure you buy lots of yummy yogurt and soup beforehand"], ["yogurt soup", 340019931, "@ChrisDon3381 @fishsports @JayGlazer @MattGalatzan @rynhnt @McCoolBCB @1053SS Could not agree more. Dak is not the face of soup &amp; yogurt without a star on his helmet"], ["yogurt soup", 1115035711454044161, "@xPersephoneRose Soup and crackers, gingerale and fresh fruits. If you're a tea person, there are a few that help settle the stomach nicely. If you're a coffee person, maybe ease up on it a few days. Fresh lemon and Honey, bananas, mangos and yogurt work on me."], ["yogurt soup", 68272679, "Been a while since I actually ate a proper breakfast at home despite most of it being instant lol.\n\nI'm eating oatmeal, aojiru, miso soup, natto and yogurt with granola. \n\nThe only thing that's unhealthy is the instant ramen lol"], ["yogurt soup", 717429612050059264, "Irene Matys has done us all a favour by sharing her recipe for this delectable soup - Moroccan Roasted Carrot Soup w Greek Yogurt &amp; Spiced Crispy Chickpeas. \n\nhttps://t.co/QTn4zxmZ8J?\nfbclid=IwAR32IGyjDHRCgJBMnkxAB94dHwk_HYQ3RK4rW1PA9OfclGwsWcK3lB6ABys"], ["yogurt soup", 1223513573298667520, "RT @RagaaFakhouri: Ultimate nutritious Greek yogurt bulgar wheat soup “Khishk” https://t.co/tB7sjsIn1w via @YouTube #recipes #RecipeOfTheDa…"], ["yogurt soup", 296886362, "Ultimate nutritious Greek yogurt bulgar wheat soup “Khishk” https://t.co/tB7sjsIn1w via @YouTube #recipes #RecipeOfTheDay #recipeblog #food #foodideas #eat"], ["yogurt soup", 296886362, "Ultimate nutritious Greek yogurt bulgar wheat soup “Khishk” https://t.co/tB7sjsIn1w via @YouTube @RagaaFakhouri #RecipeOfTheDay #Egyptian #food #food #recipeblog #Greek #Mediterranean #subscribe"], ["yogurt soup", 1037988312, "Antihistamines, honey, lemon, cough sweets, chicken soup, yogurt, ice cream... You name it. I would literally take anything anyone gave me not to be exhausted into oblivion by lunchtime everyday.\nIf she thinks elderflower will help let her have it.\nThis is bad karma."], ["yogurt soup", 2256664812, "RT @NorthwestVegan: Roasted heirloom tomato soup topped with a little @ForagerProject unsweetened yogurt and pepitas. This soup is seriousl…"], ["yogurt soup", 2329299936, "RT @FoodNutriMag: We have exciting news! It's #NationalFrozenYogurtDay! 🤗🥳\n\nThis customizable, protein packed yogurt bark #recipe by @macky…"], ["yogurt soup", 1216854706661683200, "Roasted heirloom tomato soup topped with a little @ForagerProject unsweetened yogurt and pepitas. This soup is seriously so easy to make and so yummy! #plantbased #vegan https://t.co/4G4XzihvQs"], ["yogurt soup", 778328429758451712, "@cmclymer I've eaten yogurt with a plastic fork. \nI've eaten split pea soup cold. \nI've driven around with a microwave in my car. \nI've eaten gas station burritos. \nSometimes, when you have a job to do, getting the energy into your body is more important than how you do it."], ["yogurt soup", 1225974141267763200, "EXTRACTED GAC POWDER FOR SALE \n-Application:\nMedicine material &amp; ice-cream &amp; Yogurt &amp; bakery &amp; soup &amp; drink and so on .\n-CONTACT:\nWhatsapp/Line: +84344010866\nEmail: Phoebe2508.vdelta@gmail.com\n#Gacpowder #Driedfruitpowder #Momordicacochinchinensispowderextract https://t.co/3ZqNpGg8Cc"], ["yogurt soup", 127525721, "This vitamin-packed Clementine, Carrot, and Tahini Soup with Spiced Yogurt and Pistachio will brighten up the gloomiest winter days 🍊🧡\n\nRECIPE: https://t.co/liQW7XSn2S\nPin it for later: https://t.co/7OjjRcVG8W\n\n#simplycitrus #citruslove #soupseason #clementines #healthyrecipes https://t.co/jiCx1Fr8ka"], ["yogurt soup", 223332062, "It was honey vanilla Greek yogurt from aldi and it was p.damn good and not just vanilla milk soup"], ["yogurt soup", 853826328, "no crunchy foods for a while and probably have to wait for a while to eat much of anything today\n\nbought a bunch of  yogurt, soup and apple sauce and im already mad"], ["yogurt soup", 980088745184694273, "@judoyoongi good luck 💜 on days when your teeth will hurt , try eating ramen , yogurt , soup 💜💜💜"], ["yogurt soup", 1055189641312186369, "i just blew on my yogurt like i was eating soup ..."], ["yogurt soup", 252005658, "Late lunch fish soup.  Dessert naturel yogurt pineapple &amp; honey #FridayThoughts\n#IfTheWorldIsEndingSoon\n#YikesOutNow\n#powertrip"], ["yogurt soup", 704593968, "@herbivore_club Veg rissoles baby spinach avocado salad pumpkin soup home made bread pickles fruit salad with coconut yogurt all yummy!"], ["yogurt soup", 32776127, "ANY suggestions for foods to tackle constipation in an old lady? She already eats lots of fresh fruit, veg, fibre, pulses etc. She’s breakfasting on oatmeal with flax seeds and prunes and kefir yogurt ffs. I’m giving her lentil soup for lunch. She’s taking laxatives. And yet. \n:/"], ["yogurt soup", 104099298, "Turkey Meatball, Swiss Chard, &amp; White Bean Soup.\n\nRigatoni, w/ Eggplant, &amp; Tomatoes.\n\nYogurt, Ginger, Orange Marinaded Chicken w/ Cumin, &amp; Honey Roasted Carrots https://t.co/Xlo5bndw7v"], ["yogurt soup", 835405948755841025, "Since I can’t have solid food for a few days I cooked the prime steaks in red wine, a bit of seasoning, Worcestershire, and beef broth till it was falling apart, now this and loaded mashed potatoes , Dr got me messed up talking about eat soup and yogurt. https://t.co/3OjtdT5iw7"], ["yogurt soup", 517651844, "We have exciting news! It's #NationalFrozenYogurtDay! 🤗🥳\n\nThis customizable, protein packed yogurt bark #recipe by @mackykb is just what you need to celebrate!\n\n#froyo #frozenyogurt #healthy #foodnutrimag #protein #fruit #snack \n\nhttps://t.co/1oLXvHFs2r"], ["yogurt soup", 923264126373257223, "It has been 3 days since the last time I ate anything other than soup and yogurt w tel3at ro7iii khalas I hate being sick."], ["yogurt soup", 1137724309504479234, "06/01\n62.9kg\n\nYogurt, apple, cinnamon and chia\nFresh grapefruit juice\nWhole grain bread, light cheese and jam\nDates\nTomato soup\nFresh pasta and zucchini https://t.co/4OxrKfNUF1"], ["yogurt soup", 1207814976003592192, "also i might allow myself to have soup and soya yogurt when i’m desperate bc i’ll jsut burnt it off also it’s liquid so idk it’s not as scary"], ["yogurt soup", 20192686, "@DevinVandriel That's so funny that you ask because I'm laying in bed sick right now. My husband is at the store buying me English muffins, chicken soup, and Greek yogurt"], ["yogurt soup", 476612735, "Red lentil &amp; tomato (tinned) soup with yogurt and za’atar.... storecupboard cooking, pre mum taxi-ing with lots of children here for tea cooking.\n\n#the5oclockapron \n#cookingforkids https://t.co/lPNblAtHPe https://t.co/e4oE9yx3gt"], ["yogurt soup", 476612735, "Red lentil &amp; tomato (tinned) soup with yogurt and za’atar.... storecupboard cooking, pre mum taxi-ing with lots of children here for tea cooking.\n\n#the5oclockapron \n#cookingforkids https://t.co/e70q67kx3r"], ["yogurt soup", 372992840, "Lunch:\nTuna salad, baked potato bar, hot dogs, chili toppings, The Hawaiian, chicken thigh cacciatore, lentil pasta, green beans, chicken noodle soup, garden vegetable soup, turkey reuben melt, grilled cheese, frozen yogurt with toppings #nationalfrozenyogurtday"], ["yogurt soup", 3102269316, "@SUNSHlNESHAWTY I hate piercings and needles so the whole thought is too damn over whelming for me, eat hella yogurt and soup 😭"], ["yogurt soup", 211994858, "BTW, there’s no “leader” of whom I’m proud at present. So, instead of dwelling on it today, I prepped dough for 4-8 artisan loaves, made a half-gallon of yogurt, and hard-cooked 18 eggs. Just finishing a huge pot of Indian-spices seasoned yellow split-pea soup. All from scratch."